{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.  We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! As a Software Engineer at Workfront, you will work with your Engineering team and partner with Product Management to take ideas for Workfront’s products and turn them into realized features in our Work Automation Cloud platform in an Agile environment and estimate assigned work, create OO designs, provide task breakdowns and implement features and micro-services.  As a Software Engineer, you are more than just a coder. In addition to your software engineering responsibilities, you are also expected to guide a small to medium-sized team to deliver in a product area by helping identify dependencies and risks for the group, being a planning consultant to the project managers, recommending improvements to our engineering practices and helping other specialists become more proficient in solving specific problems. Come and join Workfront, an Adobe company At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, or veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T22:01:38.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 79100,
    "max_value": 111000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Lehi",
    "region": "UT",
    "postal_code": "84043",
    "street_address": null,
    "latitude": 40.387875,
    "longitude": -111.84917
  }
}