{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Site Reliability Engineer with experience, please read on!  Top Reasons to Work with Us  We are an up and coming SAAS company, providing time tracking and management tools for major global players! We provide solutions for clients like Boeing, Disney, Volkswagen, Oracle, Hulu and Office Depot. Come be a part of something great!  What You Will Be Doing What You Need for this Position What's In It for You So, if you are a Site Reliability Engineer with experience, please apply today!  Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Joe Kipp Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Joe.Kipp@Optello.com Joe Kipp - Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-17T10:55:02.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}