{
  "job": {
    "title": "Data &amp; Applied Scientist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "Would you like to impact the experience of millions of users per month? Be on the forefront of global digital transformation? Come join Azure Customer Experience (CXP), where we are committed to driving Azure growth through our relentless pursuit of satisfied Azure customers, by leading world-class customer reliability engagements, engineering modern customer-first experiences for scale, and embedding AI and ML-based insights across the ecosystem.  As the Azure CXP Data Science team, we leverage advanced analytics and ML/AI techniques to drive specific, measurable, and impactful improvements to key areas of Azure customer experience including driving engineering investments both within CXP as well as more broadly across Azure service and product engineering teams.  In an environment of high opportunity and impact, we are looking for a Data & Applied Scientist who is enthusiastic, willing-to-learn, willing to engage the multifaceted business on Azure, and develop machine learning solutions to address the corresponding business needs. This is a great role for you if you want to work on cutting-edge ML Solutions empowering world-class Azure customer experiences. Qualifications : This position will require to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T05:44:05.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}