{
  "job": {
    "title": "Life Actuarial Data Engineer/Data Scientist",
    "industry": "Insurance,Management Consulting",
    "description": "Oliver Wyman provides customized actuarial services and strategic insight, supporting clients as they strive to exceed their business objectives.Our exceptional client and employee retention exemplify our commitment to relationships built on trust, responsiveness and clear communication.  The Actuarial Practice of Oliver Wyman is an operating division of the Oliver Wyman Group, a member of the Marsh & McLennan Companies (MMC), the foremost employer of actuaries in the world.The US Life Actuarial Practice of Oliver Wyman works with organizations to manage their insurance risks using advanced actuarial and modeling techniques and has over 130 employees across 10 offices in North America.Oliver Wyman is recognized by Fortune as one of the 100 Best Companies to work for in 2019.  Oliver Wyman uses mathematical and statistical modeling skills and our qualitative assessment methodologies to assist our clients in evaluating and addressing risk. Our solutions help clients to manage and prepare for the potential financial consequences of uncertain future events.  Oliver Wyman provides a competitive compensation and benefits package, including an Actuarial Study Program.Explore all the benefits offered at www.connect.mmc.com. The US Life Practice of Oliver Wyman strives to be the consulting firm of choice for clients and employees, and to be recognized as the premier life, annuity and LTC actuarial consultancy by fostering the power of ideas to lead our industry, consistently helping clients achieve their strategic objectives, and gaining trusted advisor status. The practice seeks to inspire an entrepreneurial culture which fosters free flowing ideas, values diversity, and allows for challenges to the status quo. Its colleagues are proud to perform exciting, diverse, and leading-edge work.  The US Life Practice of Oliver Wyman seeks to invest in its people by fostering a safe and inclusive environment, respecting and welcoming different perspectives, promoting an ownership culture, providing opportunities for individuals to develop their personal brand, and celebrating successes and rewarding performance.  Office/Regions available: Atlanta, Boston, Charlotte, Chicago, Hartford, Kansas City, New York and Seattle; remote positions may be considered as well.  Job Title: Life Actuarial Data Engineer/Data Scientist  Our US Life Practice is enhancing our expertise in the data and technology space. We are seeking individuals to support client projects related to the modernization of actuarial data and analytical processes and data science initiatives.  As a Consultant, you will work alongside Oliver Wyman’s industry leaders and other experienced consultants and will be expected to contribute to a broad range of client projects, including advising clients with end-to-end data solution architecture, documenting detailed requirements and implementing the solution in the technology of choice. You will achieve significant interaction and visibility with Oliver Wyman’s clients, which include top tier insurance companies, reinsurance companies, investment banks, law firms, state regulators, and private equity firms.  Potential projects may include: Oliver Wyman is committed to the principles for equal employment opportunity and complies with all relevant federal, state, and local laws.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T08:44:23.000Z"
  },
  "company": {
    "name": "Oliver Wyman",
    "link": "https://www.linkedin.com/company/oliver-wyman"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}