{
  "job": {
    "title": "Software Engineer, Desktop Team",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "The Desktop team is making Asana core to our users’ work with a smart, omnipresent experience that helps them and their teammates find flow and perform their best. Our brand new desktop app brings Asana to our users' fingertips and will be the first interaction with Asana for many future users. Our Desktop app is built on top of Electron , which allows us to leverage the same web technologies that we use to build our web app in building our cross platform Desktop app.  Over time, we want our Desktop app to build awareness of a user’s work mode by integrating with the user’s calendar, other installed applications and leverage the capabilities of the operating system to keep distractions at bay and increase productivity. We’re looking for an experienced software engineer to help bring these exciting ideas to life. This is a new team working on a new platform for Asana, tackling technical challenges that are brand new for our organization. At Asana, we're building a better way to work, fueled by transparency, inclusion, and technology that is a force for positive change. Asana is a work management platform that helps teams orchestrate their work, from daily tasks to strategic initiatives, so they can move faster and accomplish more with less. For the past 5 years, we've been named a top workplace, including top 10 Best Small & Medium Workplaces, #1 Fortune Best Workplace in the Bay Area for four years in a row, #8 Fortune Best Workplaces for Women, #14 , and one of . After spending more than a year physically distanced, we are safely and mindfully returning our global teams to in-person collaboration, incorporating flexibility that adds hybrid elements to our . With offices all over the world, we are always looking for curious, collaborative, and mission-driven people to help us enable the world’s teams to work together effortlessly.  We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that Asana upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T09:27:06.000Z"
  },
  "company": {
    "name": "Asana",
    "link": "https://www.linkedin.com/company/asana"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 112000,
    "max_value": 162000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}