{
  "job": {
    "title": "Principal Data Scientist - 90297807 - Washington",
    "industry": "Construction,Information Technology and Services,Financial Services",
    "description": "Amtrak connects businesses and communities across the country and we move America’s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees. The Data Scientist works closely with business stakeholders to understand their goals and determine how data can be used to achieve those goals. They design data modeling processes, create algorithms and predictive models to extract the data the business needs, and help analyze the data and share insights with peers.  The Data Scientist is responsible for building standard practices and operating principles to develop a data science practice that rely on repeatable processes that employ standard tooling and structured analysis to achieve business results.  The Data Scientist will also engage with process and data experts throughout Amtrak including Operations Research, Subject Matter Experts, Statisticians and Data Analysts to ensure a unified approach to problem solving MS in Data Science, or related field, with 5+ years of relevant work experience or PhD in related field and 0-2 years of relevant work experience Must have excellent oral and written communication skills. 66861 District of Columbia Information Technology No Up to 25% We want your work at Amtrak to be more than a job – we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family and a high performance culture that recognizes and values your contributions and helps you reach your career goals.  All positions require pre-employment background check verification, a pre-employment drug screen and proof of full vaccination against COVID -19. Amtrak is committed to a safe workplace free of drugs and alcohol and performs pre-employment substance abuse testing. Marijuana, notwithstanding any statute, ordinance, regulation, or other law that legalizes or decriminalizes the use or possession of marijuana, whether for medical, recreational, or other use. Candidates who engage in the usage of marijuana will not be qualified for hire. Successful applicants for employment with Amtrak must be fully vaccinated against COVID-19 by the date of hire as a condition of employment, subject to requests for accommodation. Fully vaccinated means 14 days have elapsed since receiving the second dose of the Pfizer or Moderna vaccine or 14 days since receiving the Johnson & Johnson injection.  In accordance with DOT regulations (49 CFR Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.  Amtrak is an EOE/Affirmative Action Minority/Female employer, and we welcome all to apply. We consider candidates regardless of race/color, religion, sex (including pregnancy, childbirth and related conditions), national origin/ethnicity, age, disability (intellectual, mental and physical), veteran status, marital status, ancestry, sexual orientation, gender identity and gender expression, genetic information, citizenship or any other personal characteristics protected by law.  POSTING NOTES: Information Technology || Information Technology",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:02:45.000Z"
  },
  "company": {
    "name": "Amtrak",
    "link": "https://www.linkedin.com/company/amtrak"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Washington",
    "region": "DC",
    "postal_code": "20002",
    "street_address": null,
    "latitude": 38.901917,
    "longitude": -76.993774
  }
}