{
  "job": {
    "title": "Software Engineer, New Services",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "One Medical is a primary care platform challenging the industry status quo by making quality care more affordable, accessible and enjoyable. But this isn’t your average doctor’s office. We’re on a mission to radically transform healthcare, which means tackling the frustrations of everyone involved — from patients and providers to employers and health networks.  Across the country, our members enjoy seamless access to comprehensive care at more than 90 locations across thirteen cities (and counting!) as well as 24/7 access to virtual care powered by intelligent uses of technology. In addition to a direct-to-consumer membership model, we work with more than 7,000 companies to provide One Medical health benefits to their employees.  On January 31, 2020 we marked a milestone with our public listing on Nasdaq, but our work is far from over. As we continue to grow and broaden our impact, we’re building a diverse, driven and empathetic team, while working hard to cultivate an environment where everyone can thrive. This is a hands-on technical role on our New Services team. The team is currently focused on the Behavioral Health Experience at One Medical. This includes easing access to mental health care at One Medical for our members and improving provider and admin tools for these services. In this role, you will contribute to the team’s technical work to build tools and help improve team processes. This will involve regular collaborations with cross-functional team members, improving documentation, and helping to troubleshoot technical issues that may arise. Taking care of you today Protecting your future for you and your family One Medical is an equal opportunity employer, and we encourage qualified applicants of every background, ability, and life experience to contact us about appropriate employment opportunities.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T23:13:02.000Z"
  },
  "company": {
    "name": "One Medical",
    "link": "https://www.linkedin.com/company/one-medical-group"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}