{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "BrightLink (  The ideal team member has mastery of computer science and engineering fundamentals and is comfortable working in an Agile/Scrum/Lean development environment. The team member should be passionate about helping others, learning new technologies, leading a team by example, and solving difficult problems. Because we build technology for the professional credentialing industry, BrightLink sits in the crossroads between what people were and what they're going to become. We help individuals demonstrate value, articulate trustworthiness, and move to a new chapter of life. Simply put: We help people prove themselves worthy of opportunity. Sure, we look like a technology company. Sharp people working really hard to do something that changes the world in a meaningful way.  However, if you look at our core values you'll notice BrightLink specifically focuses on positive personal growth. Whether it's our team members, clients, or client's clients this means our goal is to leave people better than we found them. You'll be surrounded by people with a drive to grow, discover, and build a better life. If this is something you're interested in, take a look at our currently open positions.  Powered by JazzHR  j7DWgWoKrg",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-14T07:19:43.000Z"
  },
  "company": {
    "name": "BrightLink ",
    "link": "https://www.linkedin.com/company/brightlink-technology-llc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}