{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "Are you passionate about developing cutting-edge back end solutions to enhance the consumer-facing experience?  The Senior Software Engineer position is one that calls for a technical expertise that puts the end-user experience at the center. You’ll apply your JAVA and distributed systems competencies to the improvement of existing products and the development of new software solutions at the enterprise-scale. A proven team player and direct report of the Senior Software Engineering Manager, you’ll have the opportunity to provide hands-on leadership while taking an active role in collaborative assessments and design discussions.  You’ll sweep us off our feet if… The above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full Job Description can be made available as part of the hiring process. Beyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more. As a member of our Engineering organization, you’ll be viewed as a subject matter expert who is capable of taking our competencies to the next level. The work you do will help us to define a best-in-class user experience while positioning Wal-Mart as a cutting-edge company, one that puts innovation at the forefront.  Equal Opportunity Employer  Walmart, Inc. is an Equal Opportunity Employer – By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing diversity- unique styles, experiences, identities, ideas and opinions – while being inclusive of all people.  Benefits & Perks  Beyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.  Equal Opportunity Employer  Walmart, Inc. is an Equal Opportunity Employer – By Choice. We believe we are best equipped to help our associates, customers, and the communities we serve live better when we really know them. That means understanding, respecting, and valuing diversity- unique styles, experiences, identities, ideas, and opinions – while being inclusive of all people. Imagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That’s what we do at Walmart Global Tech. We’re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service, or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations. Being human-led is our true disruption.  We’re virtual  Working virtually this year has helped us make quicker decisions, remove location barriers across our global team, be more flexible in our personal lives and spend less time commuting. Today, we are reimagining the tech workplace of the future by making a permanent transition to virtual work for most of our team. Of course, being together in person is an important part of our culture and shared success. We’ll collaborate in person at a regular cadence and with purpose. Minimum Qualifications: Bachelor of Science and 5 years' experience in software engineering OR Master of Science 2 years' experience in software engineering Preferred Qualifications... Master’s degree in Computer Science or related field and 2 years' experience in software engineering or related fieldInformation Technology - CISCO Certification - Certification Primary Location...860 W CALIFORNIA AVENUE, SUNNYVALE, CA 94086-0000, United States of America",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:20:30.000Z"
  },
  "company": {
    "name": "Walmart",
    "link": "https://www.linkedin.com/company/walmart"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 99800,
    "max_value": 194000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Sunnyvale",
    "region": "CA",
    "postal_code": "94089",
    "street_address": null,
    "latitude": 37.373676,
    "longitude": -122.036575
  }
}