{
  "job": {
    "title": "Data Scientist / Machine Learning SW Engineer",
    "industry": "Staffing and Recruiting",
    "description": "A global Conversational AI technology company is offering a solutions platform that is fueled by AI and automation technologies. The companies vision is to bridge the gap between people and machines through voice.  They’re looking for a world class Data Scientist who is interested in working on the next generation of “goal driven conversational models”. The ideal candidate understands the fast pace of the start-up environment and is not intimidated to work on topics that are at the frontier of the research. The candidate will work as an individual contributor but it is expected to collaborate and sync up with the other members of the Data Science team. What You Will Be Doing  Tech Breakdown Daily Responsibilities The Offer Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. *NO Visa Sponsorship or C2C at this time*  A global Conversational AI technology company is offering a solutions platform that is fueled by AI and automation technologies. The companies vision is to bridge the gap between people and machines through voice.  They’re looking for a world class Data Scientist who is interested in working on the next generation of “goal driven conversational models”. The ideal candidate understands the fast pace of the start-up environment and is not intimidated to work on topics that are at the frontier of the research. The candidate will work as an individual contributor but it is expected to collaborate and sync up with the other members of the Data Science team. Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. *NO Visa Sponsorship or C2C at this time* Breann Gonzalez",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-13T12:02:25.000Z"
  },
  "company": {
    "name": "Motion Recruitment",
    "link": "https://www.linkedin.com/company/motion-recruitment-partners"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 96400,
    "max_value": 176000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}