{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising",
    "description": "Dentsu is a modern marketing solutions company. Our mission is to help clients navigate, progress, and thrive in a world of change. Businesses rely on our integrated network of agencies and specialized practices to champion meaningful progress through creative, media, commerce, data and technology. Part of Dentsu Group, our global network comprises 66,000 diverse people in 143 countries, who are dedicated to teaming for growth and good. Some of our award-winning agencies include 360i, Carat, dentsumcgarrybowen, DEG, dentsuX, iProspect and Merkle. Follow us on Twitter @DentsuUSA and visit dentsu.com/us.  We are champions for meaningful progress and we strive to be a force for good—for our people, for our clients, for the industry and for our society. We keep our people at the center, creating space for growth, understanding and learning so they can thrive. We embed diversity, in our mindset, in our solutions and in our teams to empower an inclusive, equitable and culturally fluent environment. Building this culture within our teams makes us better collaborators with each other and with our clients, driving better outcomes for all. As a Software Engineer on our Technology Team, you will help us support and innovate our platforms that support web sites and media operations for major companies. We firmly believe in the DevOps mentality and are looking for Engineers who not only want to build platforms, but also the tooling and systems that allow us to efficiently test and operate them. You can expect to be hands-on in supporting and debugging our systems, and you will also need to understand how our systems are used to ensure we build what the business needs. We are distributed globally and operate as remote-first team. As with all our team members, you’ll be afforded the opportunity to continuously learn, and to practice sharing that expertise with other team members in a variety of structured and informal teaching forums. Building, Delivering, and Operating Our Platforms Communicating Inside the Team Leading by Example Diversity is embedded in who we are and all that we do: our mindset, our solutions, and in our teams to empower an inclusive, equitable environment. We put our people at the center, creating space for growth, understanding and learning so they can thrive. Our differences make us richer and enable stronger relationships with each other and foster greater impact for our clients. We engage with our communities to drive positive social impact by fostering equity and working to create a digital society that works for all. Employees from diverse or underrepresented backgrounds encouraged to apply.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T00:37:49.000Z"
  },
  "company": {
    "name": "dentsu international",
    "link": "https://uk.linkedin.com/company/dentsuintl"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}