{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Software,Computer &amp; Network Security,Computer Networking",
    "description": "Are you excited by the prospect of creating state-of-art algorithms to solve real world problems?  Do you like to own end-to-end business problems/metrics that directly impact the profitability of the company? Areas we are working on are diverse and include NLP, Time-Series Analysis, Deep Learning, Reinforcement learning, Recommender Systems and more. Come join a team of scientists who use machine learning and AI to help WeWork scale. WeWork is the platform for creators, providing hundreds of thousands of members around the world with space, community, and services that enable them to do what they love and create their life's work. Our mission is to create a world where people work to make a life, not just a living, and our own team members are central to that goal.  Our mission doesn’t end with the small businesses and entrepreneurs that call us home. We believe in empowering our team to create their own life's work. We move fast and we challenge each other, but we look after each other and care about our culture, which makes working here extremely rewarding. There's a lot of work left for us to do, and we couldn't do it without a single member of our team.  We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-03T02:06:51.000Z"
  },
  "company": {
    "name": "WeWork",
    "link": "https://www.linkedin.com/company/wework"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 102000,
    "max_value": 172000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}