{
  "job": {
    "title": "Senior Ruby on Rails Software Engineer",
    "industry": "",
    "description": "We're changing the landscape of snacking on nuts, dried fruit, chocolate and more! We planted our roots in Newark, New Jersey during the Great Depression, selling premium nuts on Mulberry Street's open-air market. We've come quite a long way since then, taking our multi-generational family business online in 1999. Even after 90 years, we continue to pride ourselves in expertly sourcing the highest quality foods and treating our customers like family.  What's our team like? We're driven, collaborative, and entrepreneurial. Energy and passion power our business and we look for candidates who share in that excitement to help us continue to build something special. Come help implement and deploy new features for the Nuts.com warehouse operations software! You will have the opportunity to make immediate contributions to our Ruby on Rails warehouse management system, interact with the end users of your features, and see the direct impact they have in supporting Nuts.com's rapid growth.  This software drives dozens of food-safety, sourcing, production, and fulfillment processes for facilities across the country. You'll work on a small team with a modern codebase building top-of-the-line software in a domain that rarely sees innovation like this. Our team has built this system from the ground up with a keen focus on producing clean and maintainable code. We describe ourselves as \"pragmatic perfectionists,\" always striving to produce the highest quality code while delivering new features that are absolutely critical to supporting the demanding growth of our business.  Ruby on Rails experience is key, ideally in a large codebase with a focus on long-term maintainability and stability. Understanding the fundamentals of good data modeling and SQL queries is important. AWS and Docker experience is a plus. Nuts.com is an affirmative action and equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, or genetic information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:17:50.000Z"
  },
  "company": {
    "name": "Nuts.com",
    "link": "https://www.linkedin.com/company/nutsdotcom"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Jersey City",
    "region": "NJ",
    "postal_code": "07306",
    "street_address": null,
    "latitude": 40.717495,
    "longitude": -74.04411
  }
}