{
  "job": {
    "title": "DevOps Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "DevOps Engineer Ogden, UT $100K - $115K On-site and Hybrid Work From Home Position!  Top Reasons to Work with Us We are a part of a large retail business and our division services the Financial side. We offer multi-businesses including high-level Technology Services within the Financial space. We are growing tremendously and our footprint across the US is getting bigger. If you like to own your work and make an impact for the greater good of the corporation, this is the place for you. This is an opportunity for you to truly push yourself to the next limit in your career! What You Will Be Doing  The DevOps Engineer will work directly with our Project Manager and help run Kubernetes for the team. You will be running the interface with the Developers and help push the code into production. This is a role where you will be leading the project so if you like to \"own\" your work and make an impact with the organization, this is the place for you!  Our team is investing in modern technology so we can take our team and organization to the next level!  What You Need for this Position What's In It for You  Competitive salary ranging from $100K - $115K Bonus is included 401(K) PTO  So, if you are a DevOps Engineer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Mecca.Benitez@Optello.com Mecca Benitez - Recruiting Manager - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T21:45:13.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Ogden",
    "region": "UT",
    "postal_code": "84401",
    "street_address": null,
    "latitude": 41.22276,
    "longitude": -111.97042
  }
}