{
  "job": {
    "title": "Architect, Data",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "**This position can be located in Overland Park, KS; Frisco, TX OR Atlanta, GA**  FinCo Visualization, Analytics, Data Engineering & Reporting (VADER) serves all of Finance as a provider of reporting and analytics around T-Mobile’s financial products (loans, leases, securitization) with a focus on:  Automation Self-Service Visualization and Analytics We are looking for a savvy Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The ideal candidate is an experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support our report developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. They must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing or even re-designing our company’s data architecture to support our next generation of products and data initiatives. Finance TX520-TX-Frisco II RBO 3560 Dallas Pkwy Frisco Texas 75034 Overland Park, KS; Atlanta, GA No Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs. T-Mobile U.S. Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com  Applicant Privacy Policy  We are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy . We take equal opportunity seriously—by choice.  T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated. 1 T-Mobile Full Time",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:42:35.000Z"
  },
  "company": {
    "name": "T-Mobile",
    "link": "https://www.linkedin.com/company/t-mobile"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Frisco",
    "region": "TX",
    "postal_code": "75034",
    "street_address": null,
    "latitude": 33.15066,
    "longitude": -96.82508
  }
}