{
  "job": {
    "title": "Director of Engineering, Autolist",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "For most people, shopping for a vehicle is an experience we'd rather forget. Navigating a sea of endless options, spending hours, and the dealership and negotiating toe-to-toe with a dealer who does all this every day leaves automotive shoppers feeling exhausted and overwhelmed while hopeful, but not sure, they got a vehicle in good condition for a fair price.  Autolist is on a mission to rewire the automotive industry by making it easier for everyone to find and get a vehicle they love! We are creating an automotive shopping experience for every stage of the automotive life cycle - buying, selling, owning - and we're well on our way. As an independent brand and subsidiary of CarGurus (NASDAQ: CARG) we're a startup within the worldwide category leader in automotive shopping helping millions of monthly users via our award-winning apps and web shopping platforms. Our efforts to streamline the automotive shopping experience is supported by a strong passion to empower people with the knowledge and experience they need for everything automotive, a dedication to equity, inclusion, and belonging, and world-class benefits. As the at Autolist you will provide managerial and technical leadership in a lean, fast-paced, data-driven environment. You will be deeply engaged in the leadership of the company, our culture, product strategy, technical strategy, and more. You will work alongside our engineers and managers to deliver great products and support the full development lifecycle discovering, designing, developing, testing, deploying, maintaining, observing, and improving our software.  You will own the success of our engineers in developing their careers as well as executing on products. You will be hands-on and collaborative with fellow engineers, analysts, designers, product, and business partners as you solve exciting problems with real impact at scale.  This role will report to the General Manager of Autolist and be a member of the Autolist Leadership Team. Note: The requirements listed on this job description are guidelines not hard and fast rules. To excel in this role you will not need to satisfy or meet every requirement listed. If you have the transferable skills and want the opportunity to be considered – please apply! Autolist is an equal opportunity employer. We believe that everyone should receive equal consideration and treatment. Recruitment, hiring, placements, transfers, and promotions will happen based on qualifications for the positions being filled regardless of sex, gender identity, race, religious creed, color, national origin ancestry, age, physical disability, pregnancy, mental disability, or medical condition.  Check out this link to learn more about our engineering team: https://www.autolist.com/engineering",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:25:15.000Z"
  },
  "company": {
    "name": "CarGurus",
    "link": "https://www.linkedin.com/company/cargurus"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}