{
  "job": {
    "title": "Sr. Researcher, Video Technology",
    "industry": "Consumer Electronics,Entertainment,Broadcast Media",
    "description": "Join the leader in entertainment innovation and help us design the future. At Dolby, science meets art, and high tech means more than computer code. As a member of the Dolby team, you’ll see and hear the results of your work everywhere, from movie theaters to smartphones. We continue to revolutionize how people create, deliver, and enjoy entertainment worldwide. To do that, we need the absolute best talent. We’re big enough to give you all the resources you need and small enough so you can make a real difference and earn recognition for your work. We offer a collegial culture, challenging projects, and excellent compensation and benefits.  Dolby’s Applied Vision Science Group is a small collaborative team within Dolby which investigates perceptual aspects of the human visual system and converts the learnings into image processing algorithms for improving perceived video quality. Understanding the relationship between science, art, and engineering is key to doing this well. Our group is looking for a motivated and energetic engineer/scientist to join our team and contribute to this meaningful effort.  We are specifically looking for a talented, curious, and inventive Researcher with an entrepreneurial spirit to develop an approach for optimizing images and video for different screen sizes, aspect ratios, and viewing positions. You will take ownership and lead the development of this new feature, through defining requirements, developing prototypes, demonstrating the value proposition to internal and external stakeholders, driving support through the imaging ecosystem from content creation to playback, and delivering high-quality reference code to engineering teams. The ideal candidate brings a passion for imaging and the personal focus and drive to spearhead new projects through a complex imaging ecosystem. If this sounds like you, please get in touch! Dolby is proud to be an equal opportunity employer. Our success depends on the combined skills and talents of all our employees. We are committed to making employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, gender identity, national origin, religion, marital status, family status, medical condition, disability, military service, pregnancy, childbirth, and related medical conditions or any other classification protected by federal, state, and local laws and ordinances.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-18T06:11:04.000Z"
  },
  "company": {
    "name": "Dolby Laboratories",
    "link": "https://www.linkedin.com/company/dolby-laboratories"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Sunnyvale",
    "region": "CA",
    "postal_code": "94089",
    "street_address": null,
    "latitude": 37.373676,
    "longitude": -122.036575
  }
}