{
  "job": {
    "title": "AI/ML - Siri Platform Engineer, Siri Experience",
    "industry": "Consumer Electronics",
    "description": "You can be a part of the next revolution in human-computer interaction and voice computing. Help establish the coding and engineering patterns that will define the next generation in application development. We build groundbreaking technology for artificial intelligence, machine learning and voice computing. Help us craft a smarter, safer way to use your iPhone in your car, call up your favorite movie on AppleTV, and help people with disabilities access technology. Work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team at Apple. 5+ years of experience in backend or platform engineering  Experience building Software Development Frameworks  Proven professional knowledge in large scale, distributed systems  A high level of excitement / deep interest in voice computing  Strong object-oriented programming and design skills  Excellent problem solving, critical thinking, and interpersonal skills'  Experience integrating data and services from multiple providers The Siri Developer Experience team is looking for extraordinary individuals to improve and extend the core software infrastructure that enables Apple developers to craft cutting edge voice experiences. We are seeking someone who can collaborate with other specialists to extend Siri’s capabilities. You should enjoy working in a rapidly changing environment with rapidly changing priorities, have a thirst for using new technologies to solve real problems, and an eagerness to improve the state of intelligent assistants. B.S or M.S in Computer Science, or equivalent experience -  Prior experience with iOS application programming experience   -  Strong API design knowledge  -  Familiarity with Unix    Role Number: 200181072",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T07:43:55.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}