{
  "job": {
    "title": "Associate Scientist - Polysaccharide Process Development",
    "industry": "Biotechnology",
    "description": "If you are a Associate Scientist with Polysaccharide Process Development experience, please read on!  We are a publicly-traded vaccine company with multiple strong therapeutic candidates in our pipeline. Our team is composed of high EQ and high IQ scientists who want to make the world a better place. We offer competitive pay, comprehensive benefits and equity.  Top Reasons to Work with Us What You Will Be Doing  As the Associate Scientist in Polysaccharide Process Development, you will be responsible for developing process in fermentation, microbiology, biopharma and vaccines. You will have the opportunity to learn new processes. You will spend 60% + of your time in the lab. You will work with the team to design/perform experiments and present data internally.  What You Need for this Position  Master degree - 0 + years experience  Bachelors degree - 1 + years experience  Prior experience working with bioreactors for fermentation experiments  What's In It for You So, if you are a Associate Scientist with Polysaccharide Process Development experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Alexander.Charles@CyberCoders.com Alexander Charles - Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:40:42.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Foster City",
    "region": "CA",
    "postal_code": "94029",
    "street_address": null,
    "latitude": 37.561882,
    "longitude": -122.26644
  }
}