{
  "job": {
    "title": "Data Scientist, Senior, Tech Consulting - Location Open",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all. EY delivers unparalleled service in big data, business intelligence, and digital analytics built on a blend of custom-developed methods related to customer analytics, data visualization, and optimization. We leverage best practices and a high degree of business acumen that has been compiled over years of experience to ensure the highest level of execution and satisfaction for our clients. At EY, our methods are not tied to any specific platforms but rather arrived at by analyzing business needs and making sure that the solutions delivered meet all client goals. You will help our clients navigate the complex world of modern data science and analytics. We’ll look to you to provide our clients with a unique business perspective on how data science and analytics can transform and improve their entire organization – starting with key business issues they face. This is a high growth, high visibility area with plenty of opportunities to enhance your skillset and build your career. You’ll spend most of your time working with a wide variety of clients to deliver the latest data science and big data technologies and practices to design, build and maintain scalable and robust solutions that unify, enrich and analyse data from multiple sources. We’re interested in passionate leaders with strong vision and a desire to stay on top of trends in the Data Science and Big Data industry. If you have a genuine passion for helping businesses achieve the full potential of their data, this role is for you. We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. If you can demonstrate that you meet the criteria above, please contact us as soon as possible.  The exceptional EY experience. It’s yours to build. EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.  Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.  Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.  EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:18:53.000Z"
  },
  "company": {
    "name": "EY",
    "link": "https://uk.linkedin.com/company/ernstandyoung"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10036",
    "street_address": null,
    "latitude": 40.759766,
    "longitude": -73.98797
  }
}