{
  "job": {
    "title": "Cloud Solutions Architect, VMC MSP - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Digital transformation is changing industries and to our customers, the application is the lifeblood of the modern organization – it’s how a business competes in the market and delivers value to its end-users. The culmination of macro trends around applications, locations, and hardware is all about transforming to deliver modern workloads that bring business opportunity. No longer are organizations focused on the traditional n-tier web and mobile applications. Digital foundation will facilitate modern workloads because they will become the new norm - more common place. And the applications that drive those workloads will become more composite in nature and therefore we now see the emergence of the subscription economy with freedom to access services and always use them anytime and anywhere with the latest technology or product model available at our fingertips. The cloud journey can be difficult as organizations struggle through strategy around rationalization of existing datacenters to choices around hybrid and multi-cloud models. There is unprecedented opportunity today for Managed Services Providers to lead organizations through their cloud journey to the future. This is a great and challenging opportunity to join the VMware Cloud Provider MSP program as a Cloud Solution Architect, Specialist where you will be at the forefront of multi-cloud thought leadership and work with Managed Services Providers to drive success. The Cloud Solution Architect, Specialist supporting the MSP Services program within the Cloud Provider program will engage with VMware Sales professionals in selling and Managed Service Providers (MSP). The Cloud Solution Architect, Specialist for MSP will be responsible for providing in-depth technical product overview, roadmap, and prescriptive guidance to MSP’s to enable them to go to market with public facing cloud service offers built on VMware Cloud solutions and architectures that drive revenue through our MSP’s. The individual will interface directly with the service provider technical product teams as a trusted advisor and assist in leading and managing the MSP’s technical agenda as part of the VMware relationship. The individual will also assist to escalate support requests as needed as well as encourage participation in VMware Cloud Services opportunities. In addition, the individual will drive communication best practices with VMware product Teams and Subject Matter Experts (SME’s) to provide relevant MSP product feedback that will contribute to VMware product roadmap features and capabilities. Sales Systems Engineering Manager and Professional Full Time 2021-06-25  VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.  Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:36:02.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}