{
  "job": {
    "title": "Software Design Engineer - Trolling Motors - Perm!",
    "industry": "Electrical/Electronic Manufacturing",
    "description": "If you are a Software Design Engineer - Trolling Motors with experience, please read on!  Top Reasons to Work with Us  Our location is in the beautiful area of Tulsa, OK, and the cost of living is inexpensive! We are looking for a talented Software Design Engineer working with Control Systems and Trolling Motors products and will have experience in both testing and software development, with a focus on embedded C and Motor Control Algorithms. The role will involve extensive on-the-water testing of exciting new products. What You Will Be Doing What You Need for this Position What's In It for You  Our location is beautiful and the cost of living is inexpensive! Great people are here! You will be part of hot technology with a top-notched engineering team and company! If you like to be mentally stimulated, then this is the place! Please FULLY COMPLETE THE APPLICATION QUESTIONS INCLUDING THE SELF ASSESSMENT ASAP! Complete applications will receive priority! We'd like to get you set up for an interview ASAP if you'd like this opportunity and are a suitable candidate! There are 4 short questions. Should take you no more than 4-7 min max! Or ph. 617-848-4420  Setting up interviews now for suitable candidates!  So, if you are a Software Design Engineer - Trolling Motors with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Lynne.Azkoul-Polanis@cybercoders.com Lynne Azkoul-Polanis - Principal Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:03:45.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Broken Arrow",
    "region": "OK",
    "postal_code": "74012",
    "street_address": null,
    "latitude": 36.05245,
    "longitude": -95.79081
  }
}