{
  "job": {
    "title": "Software Engineer, Full Stack",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Join a movement in which everyone can win. We started a movement in which everyone can win – shoppers, retailers, society and every person on our team. To play fair, trust people and reward them for doing the right thing. We see and feel the impact of our work as more and more people gain financial freedom and retailers grow across the globe. Founded five years ago in Sydney, Australia, Afterpay has over 11 million active customers globally and more than 64,000 of the world’s best retailers around the world including Anthropologie, Revolve, DSW, GOAT, Finish Line, Levi’s, Mac Cosmetics, Ray-Ban and many others. Afterpay is on a mission to power an economy in which everyone wins. Afterpay is completely free for customers who pay on time – helping people spend responsibly without incurring interest, fees or extended debt. Afterpay empowers customers to access the things they want and need, while still allowing them to maintain financial wellness and control, by splitting payments in four, for both online and in-store purchases. Afterpay is deeply committed to delivering positive outcomes for customers. We are focused on supporting our community of shoppers.We trust in the next generation and share a vision of a more accessible and sustainable world in which people are rewarded for doing the right thing.  The Opportunity  The Merchant Experience team works on building new and important experiences for Afterpay merchants. These experiences tend to associate and coordinate multiple domain areas and teams with a potential large impact on the business. As a senior member of the team, you will be responsible for bringing these experiences from vision to reality. This is an exciting opportunity to make a direct, tangible impact on our product and work on projects that are pivotal to our company’s growth.  We are much more than our job descriptions, but here’s where you will begin…. Who are you?  Like us, you’ll be deeply committed to delivering positive outcomes for customers and passionate about shaping the future of Afterpay. How we reward you. We have a pay for performance culture so you can expect to be rewarded for high performance. We pride ourselves on fairness and offer a competitive total reward package made up of salary, incentives and benefits including the opportunity to enroll in our share matching plan. We have a strong focus on health and wellbeing at Afterpay as we aim to support you to succeed in both your career and personal lives, such as providing employees with a corporate membership to Headspace. We offer a wide range of insurance programs so you have the flexibility to choose what is best for you. Afterpay covers 100% of the employee cost and 75% of the cost of your dependents. We value diversity and a collaborative and inclusive environment where everyone feels they belong is important to us.  How to Apply: We don’t know what the future holds. That’s the exciting part; we show up and make it happen. If you’re brave, if you’re committed to doing the right thing and excited by this opportunity, click apply now!  Afterpay is continuing to hire for all open roles with all interviewing and on-boarding done virtually due to COVID-19. All new team members, in addition to current staff, will temporarily work from home until it is safe to return to our offices.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T05:28:04.000Z"
  },
  "company": {
    "name": "Afterpay",
    "link": "https://au.linkedin.com/company/afterpay-com-au"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}