{
  "job": {
    "title": "System Validation Engineer",
    "industry": "Oil &amp; Energy,Renewables &amp; Environment",
    "description": "Do you want to change the world? We do, too.  The energy market is roughly $4 trillion globally, and solar penetration is less than 1%. But just one hour of sunlight, if harnessed, could power the entire world for a year. We have the opportunity to completely change the way energy is produced, distributed and consumed on a global scale, and we’re looking for talented, committed people to help us drive our growth and achieve our goals.  SunPower is a global solar energy solutions company with a rich heritage of pioneering the best energy technologies in the world. Our solutions are unrivaled in terms of long-term reliability, efficiency and guaranteed performance, and our company is unmatched in terms of global reach and scale. Through design, manufacturing, installation and ongoing maintenance and monitoring, SunPower provides its proprietary, world-record efficient solar technology to residential, commercial and utility customers worldwide.  SunPower is changing the way our world is powered every day with a brilliant, passionate and driven team of more than 2,000 in North America and the Philippines. In an industry that is reshaping the world’s energy future, there’s no better place to be than SunPower. We believe that our employees create our brand – with each project, each communication, each task completed and each interaction. Experience is critical to SunPower in regards to not only our customers but also our employees and dealer partners. As such, we strive to hire candidates that are service focused. The experience we would expect the ideal person to deliver is:  As a system validation engineer, you will support the validation program for electrical hardware related to residential solar and energy storage systems. You will define test methodologies, design test fixtures, and automate system operation, data gathering, and results reporting. All your work will help ensure that the product meets customer expectations with each platform release. The Company is an equal employment opportunity employer and makes employment decisions, including but not limited to, hiring, firing, promotion, demotion, training, and/or compensation, on the basis of merit. Employment decisions are based on an individual’s qualifications as they relate to the job under consideration. The Company’s policy prohibits unlawful discrimination based on sex (which includes pregnancy, childbirth, breastfeeding, or related medical conditions, the actual sex of the individual, or the gender identity or gender expression), race, color, religion, including religious dress practices and religious grooming practices, sexual orientation, national origin, ancestry, citizenship, marital status, familial status, age, physical disability, mental disability, medical condition, genetic information, protected veteran or military status, or any other consideration made unlawful by federal, state or local laws, ordinances, or regulations. The Company is committed to complying with all applicable laws providing equal employment opportunities. This commitment applies to all persons involved in the operations of the Company and prohibits unlawful discrimination by any employee of the Company, including supervisors and co-workers. SunPower Corporation is an Equal Employment Opportunity / Affirmative Action employer and provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. If you have any difficulty using our online system and you need a reasonable accommodation due to a disability, you may use the following alternative email address to contact us about your interest in employment at SunPower Corporation: jobs@sunpower.com. Please indicate in the subject that line of your email that you are requesting accommodation. Only candidates being considered for a position who require an accommodation will receive a follow-up response. SunPower is a federal government contractor. As a part of the Company’s obligations under law, it must develop a written Affirmative Action Program (AAP) for the Disabled, Recently Separated Veterans, Armed Forces Service Medal Veterans, Disabled Veterans and Active Duty Wartime Or Campaign Badge Veterans and for Women and Minorities as specified by law. Non-confidential and non-proprietary aspects of the AAP are available for inspection by applicants and employees, consistent with applicable law, which will be made available during office hours by contacting the EEO Officer.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T06:06:49.000Z"
  },
  "company": {
    "name": "SunPower Corporation",
    "link": "https://www.linkedin.com/company/sunpower-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Richmond",
    "region": "CA",
    "postal_code": "94802",
    "street_address": null,
    "latitude": 37.937866,
    "longitude": -122.34315
  }
}