{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "If you are you seeking an environment where you can drive innovation, collaborate in a team of +30 researchers, applied and data scientists, move marketing science to the edge of the industry to make sure our customers receive the advertising they vote for: keep reading. We look for inquisitive, life long learner with a keen interest on evidence driven decision making, e-commerce and digital businesses and understanding of customer behaviour. If this is you, read on! We are looking for a Data Scientist that will help us create best measurement and optimization models for our marketing functions on all consumer businesses in Amazon across all geographies. This includes Amazon Science gives you insight into the company’s approach to customer-obsessed scientific innovation. Amazon fundamentally believes that scientific innovation is essential to being the most customer-centric company in the world. It’s the company’s ability to have an impact at scale that allows us to attract some of the brightest minds in artificial intelligence and related fields. Our scientists continue to publish, teach, and engage with the academic community, in addition to utilizing our working backwards method to enrich the way we live and work. Please visit https://www.amazon.science for more information. Amazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability / Veteran / Gender Identity / Sexual Orientation / Age. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. Preferred experience in Marketing Science. Biostatistics on large scale inference from large scale, intermittent experimentation schemes - Amazon.com Services LLC Job ID: A1632996",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-14T23:48:40.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 113000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}