{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Amazon’s Middle Mile Planning & Optimization team is looking for an exceptional Data Scientist to drive innovation within Amazon Transportation Services in our forecasting, machine learning, and stochastic optimization products that ensure we deliver on customer promises and minimize overall operational cost all while we continue to support Amazon’s rapid growth. We use cutting edge technologies in Big Data and Machine Learning to optimize the flow of packages within the network to efficiently match network capacity with shipment demand. We build scalable systems that react to live signals in real time by using innovative forecasting and optimization algorithms. Our services already handle thousands of requests per second, make business decisions impacting billions of dollars a year, and improve the delivery experience for millions of online shoppers. That said, this remains a fast-growing business and our journey has just started. Our mission is to build the most efficient and optimal transportation solution on the planet, using our technology, science, and engineering excellence as our biggest advantage.  As a Data Scientist, you will be responsible for modeling complex problems, discovering insights and identifying opportunities through the use of statistical, machine learning, algorithmic, data mining and visualization techniques. You will need to collaborate effectively with internal stakeholders and cross-functional teams to solve problems, create operational efficiencies, and deliver successfully against high organizational standards. The candidate should be able to apply a breadth of tools, data sources and analytical techniques to answer a wide range of business questions and present the insights in a concise and effective manner. Additionally, the candidate should be an effective communicator capable of independently driving issues to resolution and communicating with both technical and non-technical audiences. Want to learn more about working with Amazon Transportation Services? Check out this video!  https://www.youtube.com/watch?v=en5YqrtBGvY&feature=youtu.be Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.  We believe passionately that employing a diverse workforce is central to our success and we make recruiting decisions based on your experience and skills. We welcome applications from all members of society irrespective of age, gender, disability, sexual orientation, race, religion or belief. - Amazon.com Services LLC  Job ID: A1687638",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T08:46:31.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}