{
  "job": {
    "title": "Data Scientist-NLP",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Stackline is an all-in-one ecommerce platform for brands and retailers. By combining market intelligence, advertising automation, workflow management, and operational analytics into a single platform, Stackline delivers the industry-leading operating system for companies to scale their online retail business globally. Founded in 2014 and headquartered in Seattle with additional offices in Minneapolis and London, Stackline is on a mission to engineer the world’s most powerful data, tools, and services for commerce.  In June 2021, Stackline received a $130 million strategic investment from TA Associates, a leading global growth private equity firm. This was followed by a $50 million investment from Goldman Sachs Growth Equity in November 2020. Stackline will utilize TA’s capital to continue growing the company’s product offerings and expanding its global footprint.  Stackline’s extensive brand list includes retail stalwarts such as Starbucks, Sony, General Mills, Mondelez, and Levi’s. In 2020, the company helped its clients grow their online businesses while continuing to diversify its technology offerings.  Join our team as a Data Scientist and you will help leading consumer brands use data and technology to discover insights, improve decision-making, and transform their businesses.  As a Data Scientist at Stackline, you will work in a fast-paced team-focused environment developing applied machine learning solutions to provide predictive analytics.  As a key member of our team, you will use your experience to analyze and glean insights from massive data pipelines, as we process, ingest and cleanse over a billion data points each week. You will be working closely with Data Engineers, Software Engineers, and Product Management teams to deliver high quality data products. This is a very hands-on analytical role, where a large part of your time is spent writing code, while the remainder is spent architecting, developing, and testing new models.  We're looking for applied data scientists to come in ready to explore our diverse array of datasets in order to develop models that have direct impact on our products. Benefits and Perks: It’s important each and every employee feels they are supported and can complete their life’s best work today and in the future. We are investing in each person not only with competitive compensation, but also with industry leading benefits and perks. A few ways we support our employees is by offering:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T05:20:59.000Z"
  },
  "company": {
    "name": "Stackline",
    "link": "https://www.linkedin.com/company/stackline"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 117000,
    "max_value": 167000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}