{
  "job": {
    "title": "Research Scientist AI/Autonomous Systems",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
    "description": "Intel Labs is seeking a motivated researcher in the area of intelligent systems. This is a full-time position with the Autonomous Agents Lab.  In this position, you will be responsible for conceiving, researching, and prototyping new techniques in the context of autonomous systems. You will use your strong knowledge of mathematical and algorithmic techniques to identify and develop new methods in one (or several) of the following areas: reinforcement learning, policy learning, computer vision, machine learning, simulation, sim2real, autonomous driving, and robotics.  This requires a comprehensive understanding of the state of the art. You are expected to maintain substantial knowledge of state-of-the-art principles and theories and to contribute regularly to scientific literature and the research community at large. You must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. The experience listed below would be obtained through a combination of your work experience, graduate school, postdoc research, and/or relevant internship experiences. Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units. Germany, Munich All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T04:08:40.000Z"
  },
  "company": {
    "name": "Intel Corporation",
    "link": "https://www.linkedin.com/company/intel-corporation"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}