{
  "job": {
    "title": "Site Reliability Engineer I",
    "industry": "Internet,Information Technology and Services",
    "description": "Careem is the internet platform for the greater Middle East region. A pioneer of the region's ride-hailing economy, Careem is expanding services across its platform to become the region's everyday Super App. Careem's mission is to simplify and improve the lives of people and build an awesome organisation that inspires. Established in July 2012, Careem operates in over 100 cities across 13 countries and has created more than one million employment opportunities in the region. Careem became a wholly-owned subsidiary of Uber Technologies, Inc. in January 2020! We are looking for an experienced engineer who will work within the SRE team to take cloud-native technology to the next level within Careem. We need expert, execution-focused engineers to help shape the future of the Careem platform and to help us scale our already sizable effort greatly. Working in an international environment with colleagues from 70+ nationalities, ownership culture, flexible working hours, unlimited (paid!) holidays and the latest technologies.  Careem gives equal opportunities. All aspects of ownership including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We celebrate diversity and are committed to creating an inclusive environment for everyone.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T18:37:06.000Z"
  },
  "company": {
    "name": "Careem",
    "link": "https://ae.linkedin.com/company/careem"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Jordan",
    "region": "PA",
    "postal_code": "17752",
    "street_address": null,
    "latitude": 41.246445,
    "longitude": -76.53813
  }
}