{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Are you looking for a challenge? Imagine being part of a team that owns one of the largest supply chain simulation systems in the world to predict inventory flows for the millions of items available on Amazon.com worldwide. Inventory planning involves many algorithms to buy inventory in the right quantities, at the right frequencies, from the right vendors, and assigning to the best warehouse to fulfill customer demand to optimize long term free cash flow for Amazon. Our system lives at the heart of these algorithms, keeping up with the rapid pace of optimization improvements and simulating how they interact with each other. We simulate what these systems will do for months into the future, predicting inventory flows and key operational and financial metrics across the network. This experimentation platform is critical in understanding labor needs, managing our network capacity, and allowing continued optimizations to the many algorithms we simulate. Imagine enabling Amazon's supply chain systems to make data driven decisions based on simulations of trillions of inventory events per day.  Every time an Amazon customer makes a purchase, a number of systems are involved: these systems help optimize inventory acquisition, enable a number of purchase options, ensure great pricing, store products so they are available for fast delivery, and minimize package frustration. The Supply Chain Optimization Technology (SCOT) Group develops and manages these systems. We are central to Amazon customers' ability to find what they want and get it when they want it. Within SCOT, the SimEx (Simulation and Experimentation) team is responsible for designing and executing the simulations and experiments that measure the impact of SCOT initiatives, as well as predicting inventory flows for labor planning.  We are looking for data scientists to drive innovation in SCOT by pushing SimEx systems further upstream in the innovation process, developing new techniques and analytics for both experimentation and prediction use cases, and applying existing models to our problem space and beyond. As an Amazon Data Scientist, your work will impact on how we serve our customers so that they get the right product at the right time. In our team, you will be working in one of the world's largest data warehouse environments. You need to be a sophisticated user of data querying tools and advanced quantitative and modeling techniques, and an expert at synthesizing and communicating insights and recommendations to audiences of varying levels of technical sophistication to drive change, as your work will be visible up to the highest business leaders in SCOT. You will perform deep dives across various system inputs/outputs and connect to key performance indicators through observational and simulation data, and detect anomalies to identify problems in our systems. Much of the job will require close collaboration with software development engineers, other scientists, and business teams to innovate for and solve problems of the future. - Amazon.com Services LLC Job ID: A1602033",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T09:24:08.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}