{
  "job": {
    "title": "Site Reliability Engineer II",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "The Azure Edge + Platform Engineering System (AE+P ES) organization is responsible for running one of the largest scale engineering systems in the industry. Our services support the secure development and release of some of the most widely used products in the world.  The Artifact Services (AS) Team is responsible for managing storage, access, and retention of content produced in AE+P ES through large scale, highly reliable services. These services bridge the gap between producers and consumers of content, and are responsible for managing the content for its lifecycle. We are a diverse, agile team focused on delivering quality cloud based, scalable solutions in a thoughtful and flexible way. Come work on modernizing one of the largest scale engineering systems in the industry! This position is for someone that: Required Qualifications: Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-07T05:20:44.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}