{
  "job": {
    "title": "Sr. Research Scientist-Liver 1",
    "industry": "Biotechnology,Pharmaceuticals,Research",
    "description": "Join the Spark Team  We were born of innovation, springing from the curiosity, imagination and dedication of remarkable scientists and healthcare visionaries. Our shared mission is to challenge the inevitability of genetic disease by discovering, developing, and delivering treatments in ways unimaginable – until now.  We don’t follow footsteps. We create the path.  The Liver Translational R&D team designs and engineers breakthrough therapies that harness the power of the liver as a platform for production and systemic distribution of therapeutics. The Senior Research Scientist on the Liver R&D Team leads a pre-clinical pipeline from identification lead candidates through proof of concept and IND-enabling studies. She/he will lead efforts in assay development, perform data analysis independently, and communicate scientific findings to executive leadership. In addition, the Senior Scientist serves as a subject matter expert to support cross-functional research efforts across the Translational R&D Department. 70%  Identify and validate new indication targets and optimize gene expression cassettes to support both existing and new programs in the pipeline. This includes executing experiments on the bench, extensive literature review, championing product candidate development from proof of concept to IND submission, etc.  15%  Design experiments, organize, discuss, and record experimental data  10%  Generate technical reports, prepare presentation slides, generate novel concepts.  5%  Trainings, lab meetings and administration work Please be aware that Spark mandates COVID-19 vaccination of all employees regardless of work location. Accommodations may be made in accordance with applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:13:50.000Z"
  },
  "company": {
    "name": "Spark Therapeutics, Inc.",
    "link": "https://www.linkedin.com/company/spark-therapeutics-inc"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Philadelphia",
    "region": "PA",
    "postal_code": "08051",
    "street_address": null,
    "latitude": 39.95106,
    "longitude": -75.16562
  }
}