{
  "job": {
    "title": "Data &amp; Applied Scientist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "The Insights Apps team (in Microsoft’s Cloud+AI org) is building the next-generation Customer Data Platform (CDP) that helps our enterprise users get a 360-degree view of their customers so they can make actionable insights on engagement. The AI team within Insights Apps builds advanced machine learning models on transactional, behavioral and market data that powers these insights.  As a data scientist in Insights App AI team, you will develop machine learning models that are used by some of the latest AI product features in our CDP platform. You will work on large scale structured and unstructured data, apply cutting-edge AI/ML technologies on the real-world datasets to develop models for prediction, recommendation, forecasting and NLP. You will partner with our engineering team to build and deploy models using the latest cloud technologies, and work closely with our program managers, industry-leading design and customer research team to design our product features for achieving the best user experience.  This is a unique opportunity to bring your knowledge of Consumer and Commercial business, as well as your deep understanding of data science methods and best practices, to help Microsoft deliver the best AI products possible for our customers and partners. You will be joining one of the largest AI teams in Microsoft Dynamics 365 with a tremendous scope to grow As a data scientist in this team, you will be responsible for: Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T01:18:52.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}