{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Remitly is on a mission to transform the lives of immigrants and their families by providing the most trusted financial products and services on the planet. For nearly 10 years, we have been tirelessly delivering on our promises to immigrants sending their hard earned money home. Today, we are incredibly proud to have served millions of customers globally with Remitly and our newly launched Passbook app to provide immigrants access to banking. We strive daily to meet our promise to our customers by building peace of mind into everything we do. Join over 1,300 employees across 9 offices who are growing their careers while having a positive impact on people globally. As a Machine Learning Engineer (MLE), you will report to the tech lead of Machine Learning Products. As a part of this team, you will help support the ML/data products that underpin our business. You will help scale data-driven decision-making throughout the organization, provide ML support/best practices to partner teams, and help explore new ML product opportunities. . Equal employment opportunity has been, and will continue to be, a fundamental principle at Remitly. We are committed to nondiscrimination across our global organization and in all of our business operations. Employment is determined based upon personal capabilities and qualifications without discrimination on the basis of race, creed, color, religion, sex, gender identification and expression, marital status, military status or status as an honorably discharge/veteran, pregnancy (including a woman's potential to get pregnant, pregnancy-related conditions, and childbearing), sexual orientation, age (40 and over), national origin, ancestry, citizenship or immigration status, physical, mental, or sensory disability (including the use of a trained dog guide or service animal), HIV/AIDS or hepatitis C status, genetic information, status as an actual or perceived victim of domestic violence, sexual assault, or stalking, or any other protected class as established by law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-19T13:02:59.000Z"
  },
  "company": {
    "name": "Remitly",
    "link": "https://www.linkedin.com/company/remitly"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}