{
  "job": {
    "title": "Cloud Software Engineer",
    "industry": "Internet",
    "description": "The Cloud Software Engineer develops, maintains, and enhances complex and diverse Big-Data Cloud systems based upon documented requirements. Directly contributes to all stages of back-end processing, analyzing, and indexing. Provides expertise in Cloud Computing, Hadoop Eco-System including implementing Java applications, Distributed Computing, Information Retrieval (IR), and Object Oriented Design. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components. The Level 2 Cloud Software Engineer shall possess the following capabilities: Provide in-depth knowledge of Information Retrieval; assisting the software development team in designing, developing and testing Cloud Information Retrieval Implement complex workflows that manage Cloud MapReduce analytics Implement code that interacts with Cloud Distributed Coordination Frameworks Oversee one or more software development tasks and ensures the work is completed in accordance with the constraints of the software development process being used on any particular project Make recommendations for improving documentation and software development process standards Required: Eight (8) years' experience software engineering experience on programs and contracts of similar scope, type, and complexity is required; two (2) years of which must be in programs utilizing Big-Data Cloud technologies and/or Distributed Computing. Bachelor's degree in Computer Science or related discipline from an accredited college or university. Current TS/SCI with polygraph; (2) years of Cloud and Distributed Computing Information Retrieval (IR). (1) year of experience with implementing code that interacts with implementation of Cloud Big Table. (1) year of experience with implementing code that interacts with implementation of Cloud Distributed File System. (1) year of experience with implementing complex MapReduce analytics. (1) year of experience with implementing code that interacts with Cloud Distributed Coordination Frameworks. Three (3) years' experience: Utility Computing, Network Management, Virtualization (VMWare or VirtualBox), Cloud Computing",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:41:24.000Z"
  },
  "company": {
    "name": "JobGet",
    "link": "https://www.linkedin.com/company/jobget"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Russett",
    "region": "MD",
    "postal_code": "20755",
    "street_address": null,
    "latitude": 39.1083,
    "longitude": -76.8033
  }
}