{
  "job": {
    "title": "Lead Software Engineer, Container Services - Tableau",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology Tableau introduced the power of visual analytics to the world making it the de-facto standard in the enterprise. Tableau is as much a philosophy as an amazing suite of tools. , helping people make important decisions based on those insights. If you are passionate about technology, but also care deeply about doing something meaningful, Tableau is the place for you. Tableau products have been helping fight global pandemics, most recently COVID-19, by providing data insights to the professionals, and the public. Besides helping people transform data to easy visuals, we also have really fun architectural and scaling challenges. in the C drives platform innovation for products. We explore new platforms, technologies, tools and bring the best to run Tableau SaaS. We lead the Tableau SaaS transformation to Containers with . Along the way, we adopted cool tools for and . is a talented and passionate group of engineers. They are building a SaaS platform with AWS EKS infrastructure, and a Deployment platform for release orchestration. The team is in-charge of migrating Tableau Online from AWS EC2 to EKS. As trailblazers of Kubernetes in Tableau, team members regularly guide other internal teams adopting Containers and Kubernetes. As a core member of the Container Services team, you will bring your creativity, and expertise to the team for best practice guidance. You will craft the Infrastructure, Deployment, and Migration strategies and oversee their implementation. If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. and are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. and do not accept unsolicited headhunter and agency resumes. and will not pay any third-party agency or company that does not have a signed agreement with or .  Salesforce welcomes all.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-11T23:39:33.000Z"
  },
  "company": {
    "name": "Salesforce",
    "link": "https://www.linkedin.com/company/salesforce"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Kirkland",
    "region": "WA",
    "postal_code": "98034",
    "street_address": null,
    "latitude": 47.675507,
    "longitude": -122.20336
  }
}