{
  "job": {
    "title": "Production Support Lead / Site Reliability Engineer",
    "industry": "Apparel &amp; Fashion,Retail,Luxury Goods &amp; Jewelry",
    "description": "Join the thousands of innovators, advocates and forces who are making an impact every day at one of the biggest footwear brands in the world. Whether you love to connect with consumers on the retail floor or want to drive our award-winning powerhouse in new directions, the SKECHERS team is the place to be. Learn more about our brand at skx.com. Skechers Digital is looking for a Production Support Lead / Site Reliability Engineer to coordinate & communicate with Customer Service and IT for any incidents on Global E-commerce, Loyalty, Native App, and Digital Direct-To-Consumer business. The successful candidate will work to establish processes consistent with digital best practices by establishing operational KPI's, reporting, alerts, communicate plans and status to team members and stakeholders, manage incoming incidents and triage and other day-to-day interactions as needed to keep projects moving.  This role will report to the Director of Quality Assurance and Product Support, and will become part of a core Digital program team delivering production support to accelerate business growth for Skechers USA. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The skills, abilities and physical demands described are representative of those duties that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodation may be made to enable individuals with disabilities, who are otherwise qualified for the job position, to perform the essential functions.  Additional Information While performing the duties of this job, the employee is regularly required to stand; use hands to finger, handle, or feel, and talk or hear. The employee frequently is required to walk; sit, reach with hands and arms, and stoop, kneel. The employee is occasionally required to sit for long period of times. The employee is regularly required to lift a 35 - 40lb dress form for garment evaluations.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-07T05:04:00.000Z"
  },
  "company": {
    "name": "Skechers",
    "link": "https://www.linkedin.com/company/skechers"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Manhattan Beach",
    "region": "CA",
    "postal_code": "90266",
    "street_address": null,
    "latitude": 33.887684,
    "longitude": -118.40332
  }
}