{
  "job": {
    "title": "Data Scientist - Data Analytics",
    "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
    "description": "This is an environment and the secret of Costco’s success is its culture. The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes. Our employees and our members come FIRST. Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others. In 2018, Costco contributed over $39 million to organizations such as United Way and Children's Miracle Network Hospitals.  Costco IT is responsible for the , the second largest retailer in the world with wholesale operations in twelve countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco consistently ranks in the . . At Costco, we are on a mission to . This role is focused on advanced analytics, machine learning and data science delivery to support multiple business areas. This role will partner with Product Owner and business owners to . This is a senior role to enhance the maturity of advanced analytics methods and coach the team across multiple PODs. The Data Scientist is a knowledgeable leader with an ability to lead and is passionate about data and using machine learning to solve business problems. The right candidate will have deep knowledge of applying data science for forecasting, customer analysis, item and inventory management and other areas of retail.  We are looking for a highly motivated, customer focused professional who wants to work in a fun and highly collaborative environment and willing to be the player as well as coach for the data science community at Costco.  If you want to be a part of one of the , simply apply and let your career be reimagined. Recommended California applicants, please click to review the Costco Applicant Privacy Notice.  Apart from any religious or disability considerations, open availability is needed to meet the needs of the business. If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas.  Share",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T02:11:03.000Z"
  },
  "company": {
    "name": "Costco IT",
    "link": "https://www.linkedin.com/company/costco-weareit"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}