{
  "job": {
    "title": "Sr. Staff Software Engineer",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "At PayPal (NASDAQ: PYPL), we believe that every person has the right to participate fully in the global economy. Our mission is to democratize financial services to ensure that everyone, regardless of background or economic standing, has access to affordable, convenient, and secure products and services to take control of their financial lives. We’re a purpose-driven company, and our beliefs are the foundation of how we conduct business every day. We’re guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Collectively, these values inspire us to work together as One Team with our customers at the center of everything we do, and to take care of ourselves, each other, and the communities in which we live and work. We challenge the status quo, ask questions, and find solutions. Join us as we enable the hopes, dreams, and ambitions of millions of people around the world. As a Senior Staff Software Engineer for PayPal Checkout Engineering you will provide technical leadership for your development team and you will be lead the team’s participation in all phases of our software developm¬¬¬¬¬¬ent lifecycle: from system design, architecture, and planning to development, testing, deployment, monitoring, and beyond. You will be responsible for developing industry-leading Checkout experiences that bring unquestionable value to both merchants and buyers and you will use your solid understanding of the business domain to guide the proper designs of our technical solutions. In this role, you will be responsible for shaping the future of PayPal's customer-facing Checkout products, from payment buttons to transaction receipts, and every step along the way. We're looking for talented, motivated, detail-oriented technologists with a passion for building beautiful products and experiences. We value collaboration, communication, and a passion for achieving engineering and product excellence. We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. If you care about delivering great technical products with a willingness to learn and help, please don't hesitate to apply.  For more than 20 years, PayPal has remained at the forefront of the digital payment revolution. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, our open digital payments platform gives PayPal’s 400 million active account holders the confidence to connect and transact in new and powerful ways. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying, or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.  PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.  REQ ID R0072520",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:30:37.000Z"
  },
  "company": {
    "name": "PayPal",
    "link": "https://www.linkedin.com/company/paypal"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 102000,
    "max_value": 166000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}