{
  "job": {
    "title": "Applied Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Coinbase has built the world's leading compliant cryptocurrency platform serving over 30 million accounts in more than 100 countries. With multiple successful products, and our vocal advocacy for blockchain technology, we have played a major part in mainstream awareness and adoption of cryptocurrency. We are proud to offer an entire suite of products that are helping build the cryptoeconomy and increase economic freedom around the world.  There are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for signals that a candidate will thrive in a culture like ours, where we default to trust, embrace feedback, disrupt ourselves, and expect sustained high performance because we play as a championship team. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people with the desire and capacity to build and share expertise in the frontier technologies of crypto and blockchain, in whatever way is most relevant to their role.  As an applied learning engineer you’ll be building the critical infrastructure for the open financial system -- tapping into a variety of large data sources such as the blockchain -- to provide millions of people access to crypto while detecting and preventing bad actors. You’ll not only have the chance to drive significant impact from protecting Coinbase, you’ll also leverage machine learning to make our product delightful by adding intelligence to news, notifications, risk, and much more. A resume that describes your experience with large scale applied machine learning. ID: G1874  Commitment to Equal Opportunity  Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view Pay Transparency, Employee Rights and Equal Employment Opportunity is the Law notices by clicking on their corresponding links. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law.  Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations@ coinbase.com and let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Please contact accommodations@ coinbase.com for additional information or to request accommodations.  Global Data Privacy Notice for Job Candidates and Applicants  Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here: Ireland/EU, United Kingdom, and California. By submitting your application, you are agreeing to our use and processing of your data as required.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T15:53:24.000Z"
  },
  "company": {
    "name": "Coinbase",
    "link": "https://www.linkedin.com/company/coinbase"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Boulder",
    "region": "CO",
    "postal_code": "80310",
    "street_address": null,
    "latitude": 40.016872,
    "longitude": -105.279625
  }
}