{
  "job": {
    "title": "Dripping Springs CFT - Cross Functional Rep - Part-Time",
    "industry": "Food &amp; Beverages,Food Production,Retail",
    "description": "Would you rather do something different every day? H-E-B needs energetic and motivated Partners willing to work hard and have fun while providing superior customer service. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first.  As a Cross-Functional Representative, you'll provide general customer service, checking on the front end, and work across multiple departments in packaging, stocking, rotation, production, and sanitation duties.  Once you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that make H-E-B The Greatest Omnichannel Retailing Company. HEART FOR PEOPLE... commitment to provide superior Customer Service? HEAD FOR BUSINESS... a strong sense of how what you do affects Customers and our success? PASSION FOR RESULTS... initiative to step up and do what needs doing, with an eye for detail? What is the work? What is your background? Do you have what it takes to be a fit as an H-E-B Cross-Functional Representative? Can you... Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Cross Functional Rep Variable Hours Part-time US-TX-Dripping Springs Aug 11, 2021, 11:59:00 PM",
    "employment_type": "PART_TIME",
    "date_posted": "2021-08-03T03:25:29.000Z"
  },
  "company": {
    "name": "H-E-B",
    "link": "https://www.linkedin.com/company/heb"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 6,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Dripping Springs",
    "region": "TX",
    "postal_code": "78620",
    "street_address": null,
    "latitude": 30.190702,
    "longitude": -98.087494
  }
}