{
  "job": {
    "title": "Software Development Engineer I - 19544",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "At Wimmer Solutions, we believe care creates community. We work smart; we have built a reputation for results-oriented, innovative, business and technology solutions that help companies execute on their strategic initiatives. We have fun; we love our work. We are positive, kind, and hungry to learn. We give big; we aim to make a real impact on the causes that affect the communities we serve and build strong relationships with the dedicated volunteers and nonprofit organizations working to address them.  We are all about people and community. Since 2002, we have offered technology staffing and managed services for the greater Seattle area and throughout the United States. We focus on getting to know our clients and candidates to create lasting partnerships and ensure success.  Our client is looking for a Your well-being is important to Wimmer Solutions. All regular, full-time employees working a minimum of 30 hours per week are eligible to participate in the benefits plan. Outside of offering excellent medical, dental, and vision benefits, we also offer the following: Wimmer Solutions is proud to be an equal-opportunity employer. All applicants will be considered for employment regardless of race, color, religion or belief, age, gender identity, sexual orientation, national origin, parental status, veteran or disability status. Wimmer Solutions is committed to achieving a diverse employee network through all aspects of the hiring process and we welcome all applicants.  If you are passionate about what you do and want to join a diverse team dedicated to diversity, equity, and inclusion in the workplace, we would love to hear from you. Get the job you have always wanted. You will join a broad team of professionals who are energized about their careers as well as their community. For more career opportunities or to refer a friend, please visit http://wimmersolutions.com/careers and talk to a recruiter today.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T23:57:05.000Z"
  },
  "company": {
    "name": "Wimmer Solutions",
    "link": "https://www.linkedin.com/company/wimmer-solutions"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}