{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "At Alexa Shopping, we strive to enable shopping in everyday life. We allow customers to instantly order whatever they need, by simply interacting with their Smart Devices such as Amazon Show, Spot, Echo, Dot or Tap. Our Services allow you to shop, no matter where you are or what you are doing, you can go from 'I want that' to 'that's on the way' in a matter of seconds. We are seeking the industry's best to help us create new ways to interact, search and shop. Join us, and you'll be taking part in changing the future of everyday life  We are seeking a Data Scientist to be part of the Correction and Automated Recovery (CARe) team for Alexa Shopping. Our team focuses on solving the hard problem of recovering from shopping errors in the Alexa pipeline and improve customer CX. The solutions will help address unique shopping challenges and maximize the self-learning benefits for shopping. This is a strategic role to shape and deliver our science strategy in developing and deploying Machine Learning solutions to our hardest customer facing problems. The initiatives are at the heart of the organization and recognized as the innovations that are ground breaking and will allow us to exceed customer expectations. If this role seems like a good fit, please reach out, we'd love to talk to you.  This role requires working closely with business, engineering and other scientists within Alexa, Shopping and across Amazon to deliver ground breaking features. You will lead high visibility and high impact programs collaborating with various teams across Amazon. You will work with a team of SDEs and Scientists to launch new customer facing features and improve the current features. Ability work in an ambiguous environment  Amazon is an Equal Opportunity Employer – Minority / Women / Disability / Veteran / Gender Identity / Sexual Orientation / Age. - Amazon.com Services LLC Job ID: A1657589",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T01:20:02.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}