{
  "job": {
    "title": "Quality Data Analyst- Power BI",
    "industry": "Medical Devices",
    "description": "At ConvaTec, our vision is to develop pioneering trusted medical solutions to improve the lives we touch. We are a global medical technology business focused on serving people and care givers in the areas of advanced wound care, ostomy care, continence and critical care and infusion care. We devise, develop and manufacture innovative products and services that support people with deeply personal and challenging medical conditions, helping to improve care for them and giving them greater confidence, freedom and mobility.  We are guided by our five core values, that shape the way we work, every day: Improve Care, Deliver Results, Grow Together, Own It and Do What’s Right. We are a global Group, with over 9,900 employees and in 2020, our Group generated revenues of over $1.894 billion. To learn more about ConvaTec, please visit www.convatecgroup.com.  Every day, our products improve the lives of millions of people around the world. We're hugely proud of this, which is why we're transforming our business to reach millions more. Join us as a Quality Data Analyst, and you'll drive progress that really means something. You will be responsible for generating reports and analysis that support strategic and operational changes to proactively mitigate risk and/or improve efficiency. This includes: Participate in key business projects as required With your excellent analytical, communication and presentation skills, you maintain the highest standards of accuracy and precision, while presenting data in a meaningful and professional format. You bring the ability to influence, create and work within cross-functional teams because you are a self-motivated, proactive and creative thinker, who effectively contributes to the business in the face of change and rapid pace. Your strong attention to detail, energy and passion for delivering high-quality, accurate data, allow you to thrive in a fast-paced, metric-driven, regulated environment. Position will be based in an office or remote, or some combination of both based on business needs. Office presence may be required for certain meetings or events. May need to adjust schedule to work across time zones to support the business.  Our products make a big difference every day. So will your contribution. The work you do will mean more, because it'll make things better for your team, our business or our customers' lives. It'll inspire you to deliver to your very best.  And we'll be right behind you when you do.  This is a challenge more worthwhile.  This is work that'll you.  ConvaTec provides equal employment opportunities for all current employees and applicants for employment. This policy means that no one will be discriminated against because of race, religion, creed, color, national origin, nationality, citizenship, ancestry, sex, age, marital status, physical or mental disability, affectional or sexual orientation, gender identity, military or veteran status, genetic predisposing characteristics or any other basis prohibited by law.  Notice to Agency and Search Firm Representatives: ConvaTec is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any ConvaTec employee by a third party agency and/or search firm without a valid written and signed search agreement, will become the sole property of ConvaTec. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:46:47.000Z"
  },
  "company": {
    "name": "ConvaTec",
    "link": "https://uk.linkedin.com/company/convatec_2"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Greensboro",
    "region": "NC",
    "postal_code": "27395",
    "street_address": null,
    "latitude": 36.0727,
    "longitude": -79.7939
  }
}