{
  "job": {
    "title": "Principal Member of Technical Staff (JoinOCI-SDE)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At Oracle Cloud Infrastructure (OCI), we build the future of the cloud for Enterprises as a diverse team of fellow creators and inventors. We act with the speed and attitude of a start-up, with the scale and customer-focus of the leading enterprise software company in the world.  The Oracle Cloud Infrastructure (OCI) team can provide you the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment. OCI is committed to providing the best in cloud products that meet the needs of our customers who are tackling some of the world’s biggest challenges.  We offer unique opportunities for smart, hands-on engineers with the expertise and passion to solve difficult problems in distributed highly available services and virtualized infrastructure. At every level, our engineers have a significant technical and business impact designing and building innovative new systems to power our customer’s business critical applications.  We are reimagining what's possible with storage to provide unparalleled performance and durability with our new large scale distributed services and storage backend. Our services expose highly available, high-performance storage volumes and backups to our elastic compute customers.  We’re looking for hands-on engineers with expertise and passion in solving difficult problems in distributed systems, storage infrastructure, transaction processing, and highly available services. If this is you, at Oracle you can design and build innovative new systems from the ground up. These are exciting times in our space - we are growing fast, still at an early stage, and working on ambitious new initiatives. An engineer at any level can have significant technical and business impact. As a Software Engineer you will own software development of major features in Oracle Cloud's Storage product offerings. You should be comfortable with development in C++/Java, and be willing to learn new languages as needed. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.  Come build the state of the art IaaS storage enabling new class of databases and applications starting from the ground floor.  Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.  As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID in the subject line of the email.  Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.  As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.  Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:12:03.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}