{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "Olive’s AI workforce is built to fix our broken healthcare system by addressing healthcare’s most burdensome issues -- delivering hospitals and health systems increased revenue, reduced costs, and increased capacity. People feel lost in the system today and healthcare employees are essentially working in the dark due to outdated technology that creates a lack of shared knowledge and siloed data. Olive is designed to drive connections, shining a new light on the broken healthcare processes that stand between providers and patient care. She uses AI to reveal life-changing insights that make healthcare more efficient, affordable and effective. Olive’s vision is to unleash a trillion dollars of hidden potential within healthcare by connecting its disconnected systems. Olive is improving healthcare operations today, so everyone can benefit from a healthier industry tomorrow.  Olive Assures is an AI-enabled product that automates the revenue management cycle and pays providers for care when it’s delivered. Currently, healthcare revenue cycle management requires providers to manage a cumbersome process to get paid for delivering care. Olive Assures uses intelligent automation to automate much of this process and leverages predictive algorithms to provide payment for care in real time. Olive Assures reduces administrative burdens and creates greater financial certainty for providers, freeing them to focus on what matters most - improving the access and quality of care for patients.  Supporting Assures is a cloud-native, event-driven, serverless architecture which requires novel thinking and practices for how the team owns and operates the solution. We’ll be handling sensitive healthcare and financial data, so security is paramount as well. We’re looking for an inspired engineer whose focus will be tackling quality starting at production and working backwards into the tooling and process needed to ensure we’re set up to operate, maintain, and iterate to the highest standards of quality, agility, security, and compliance. Working with both the local engineering teams and other relevant Olive teams, you’ll own the SLOs for the system at large. From there, you’ll define the plan to achieve those objectives and the work needed to put the plan in motion. You’ll then continue guiding the teams through iterations and evolutions as we continue to scale the solutions. At Olive, we're committed to growing and empowering an inclusive community within our company and industry. This is why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives across our organization. Research shows that oftentimes women and other minority groups only apply to open roles if they meet 100% of the listed criteria. Olive encourages everyone — including women, people of color, individuals with disabilities and those in the LGBTQIA+ community — to apply for our available positions, even if they don't necessarily check every box on the job description.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T23:53:18.000Z"
  },
  "company": {
    "name": "Olive",
    "link": "https://www.linkedin.com/company/oliveai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}