{
  "job": {
    "title": "Data Engineer ML (Open to Remote)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Our company are leaders delivering fuel pricing data, market intelligence and analytics to the global Energy industry. We believe in having the best technology capabilities to deliver our products to our customers.  Your team focuses on developing the data infrastructure and platform to support our large volume data analytics processing, AI, data science, and machine learning projects.  OPIS, part of IHS Markit, is expanding its Data Science and Machine Learning (MLOps) Engineering team. You will play a critical role in the design and development of a world-class Data Science and MLOps platform. We encourage creativity, autonomy, and flexibility to allow you to bring your ideas to life!  To fit this role, we are looking for a mid-level data engineer with a unique mix of technical capabilities, strong data analysis and collaboration skills. We are proud to provide reasonable accommodations to applicants with disabilities. If you are interested in applying for employment with IHS Markit and need special assistance or an accommodation to use our website or to apply for a position, please contact or call +1 212 849 0399. Determination on requests for reasonable accommodation are considered on a case-by-case basis. This contact information (email and phone) is intended for application assistance and accommodation requests only. We are unable to accept resumes or provide information about application status through the phone number or email address above. Resumes are only accepted through the online application process, and only qualified candidates will receive consideration and follow-up.  IHS Markit maintains a substance-free workplace; employees may be asked to submit to a drug test (where permitted by law). In addition, as a federal contractor in the United States, the company participates in the E-Verify Program to confirm eligibility to work. IHS Markit Business Code of Conduct  Right to Work  EEO is the Law  EEO is the Law Supplement  Pay Transparency Inclusion and diversity are critical to the success of IHS Markit, and we actively encourage applications from people of all backgrounds. We are committed to providing equal employment opportunity without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected category. For more information on the many ways in which we enthusiastically support inclusion and diversity efforts for both candidates and employees, please access our Inclusion & Diversity Statement here .  We are proud to provide reasonable accommodations to applicants with disabilities. If you are interested in applying for employment with IHS Markit and need special assistance or an accommodation to use our website or to apply for a position, please contact or call +1 212 849 0399. Determination on requests for reasonable accommodation are considered on a case-by-case basis. This contact information (email and phone) is intended for application assistance and accommodation requests only. We are unable to accept resumes or provide information about application status through the phone number or email address above. Resumes are only accepted through the online application process, and only qualified candidates will receive consideration and follow-up.  IHS Markit maintains a substance-free workplace; employees may be asked to submit to a drug test (where permitted by law). In addition, as a federal contractor in the United States, the company participates in the E-Verify Program to confirm eligibility to work. IHS Markit Business Code of Conduct  Right to Work  EEO is the Law  EEO is the Law Supplement  Pay Transparency If you are currently employed by IHS Markit, please apply internally via the Workday internal careers site.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T01:22:07.000Z"
  },
  "company": {
    "name": "Jobs via eFinancialCareers",
    "link": "https://uk.linkedin.com/company/jobs-on-efinancialcareers"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}