{
  "job": {
    "title": "Lead Data Scientist",
    "industry": "Biotechnology",
    "description": "Seeking a Lead Data Scientist to lead a team of Data Scientists building new machine learning models which will help users achieve their health goals.  What You Will Be Doing  Collaborate with product teams to deliver solutions that enhance the customer experience and improve the efficiency of user acquisition.  Follow Agile methodology process to get tasks done.  Provide guidance to Data Scientists and ensure proper use of standard methodologies  Work with research and clinical teams to define the data requirements and the data collection protocols and ensure quality of the data being collected  Build and expand array of machine learning models using NLP, regression, classification, neural networks.  Responsible for the performance of data science products with a keen understanding of the levers to provide increased value.  Develop advanced algorithms that solve problems of large dimensionality in a computationally efficient and statistically effective manner  Drive R&D on new models and evaluate business opportunities.  Establish roadmap to improve the scalability of data pipelines and modeling infrastructure.  What You Need for this Position  Masters Degree in Data Science, Statistics or a related field. PhD desired.  8+ years of experience in the field of data science or machine learning.  Proficient with code versioning tools such as Git.  Strong technical background and experience working with scalable data systems (Spark).  Proficient with SQL and data mining experience with Matlab, Python, R, Scala or other Big Data tools.  Strong understanding of machine learning algorithms and statistical methods.  Agile methodology and working with Scrum Teams.  Leveraging relational databases, manipulating data structures and analyzing complex data sets.  Hands-On building and optimizing data pipelines, developing data models and designing schemas.  Strong analytic skills related to working with unstructured datasets.  Proficient with code versioning tools such as Git.  Experience organizing and analyzing data collection from various sources.  Good communication skills, both verbal and written, and the ability to interface effectively with engineering and manufacturing personnel.  Knowledge of diabetes is a BIG PLUS.  For your hard work and dedication, earn a generous salary plus bonus and stock options along with a comprehensive benefits package including 401k and more...plus, join a organization who promotes within to build your career path.  Possible relocation assistance for an ideal candidate. Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Nyna.Goldberg@CyberCoders.com Nyna Goldberg - Principal Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:31:26.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Lake Forest",
    "region": "CA",
    "postal_code": "92609",
    "street_address": null,
    "latitude": 33.66746,
    "longitude": -117.6885
  }
}