{
  "job": {
    "title": "Principal Full-Stack Data Scientist / Data Engineer",
    "industry": "Retail,Consumer Goods,Internet",
    "description": "We are focused on building the largest e-commerce platform in the world. Founded by a team of seasoned ex-Amazon operators, Acquco strategically acquires the best brands and accelerates their growth across Amazon, Walmart, Shopify, and other e-commerce ecosystems. We’ve raised over $160M of institutional capital since our inception in 2020, and are focused on rapidly scaling our portfolio team. Recently featured on Techcrunch, Crunchbase, Business Insider, Pymnts, Pitchbook  The Data & Analytics team at Acquco is responsible for driving the vision and execution of developing data assets and insights central to Acquco’s business and technology strategy. Utilizing proprietary models & datasets, the team will be generating data-driven insights across our investments and operational decision making processes. The team will build the data infrastructure to empower technical analysis and answer critical business questions.  Acquco is seeking a Principal Full Stack Data Scientist/Data Engineer to deliver end-to-end data solutions. In addition to training statistical models and building data infrastructure, you’ll be engaging with business divisions to define/scope questions and validate your solutions/answers.  You will have the opportunity to work in a dynamic fast-paced environment with exceptional growth potential, learning/working across all business areas, gaining full stack experience, and seeing immediate impact/usage of your data solutions.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T13:21:06.000Z"
  },
  "company": {
    "name": "Acquco",
    "link": "https://www.linkedin.com/company/acquco"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}