{
  "job": {
    "title": "Subscriptions &amp; Commerce Data Scientist - Austin",
    "industry": "Consumer Electronics",
    "description": "At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences. If you are a self-motivated, high-energy individual who is not afraid of challenges, we're looking for you.   Apple is seeking a Subscriptions & Commerce Data Scientist to join a team passionate about Data Science & Analytics for Apple Media Products (AMP) to support subscription and commerce platforms across all of Apple’s Services businesses (App Store, Apple Music, Apple TV, Apple Fitness, Apple One, and other services).   You will play a key role improving the AMP commerce and subscription platforms as a part of the Business Development and Commerce Data Science team. As a member of this team, you will help to optimize the platform by sizing & developing new data products and tuning existing features. Responsibilities will include understanding subscription renewals, payment authorizations, transaction efficiencies across multiple lines of businesses. Deep dives in large-scale data to identify key insights that inform product improvements and business strategy  Develop, improve, and execute on experimental measurement plans for new subscriptions and commerce products and features  Employ sophisticated analytic tools like A/B testing and causal modeling to accurate understand the effect of multiple and often interrelated initiatives  Engage with business, engineering, product management teams as a thought partner to develop design and operational improvements  Build and maintain positive relationships with key partners across the company to successfully deliver measurable insights  Partner with other Apple organizations on data gathering, data governance, redefining data with reporting tools and evangelizing critical metrics 5+ years of professional experience in data science or product analytics. Preferably for a digital subscription business or e-commerce platform.   Strong passion for applied empirical analytics, data mining, and predictive analytics to develop impactful insights   Mastery in SQL-based languages, and proficiency large-scale data languages such as PySpark   Experience measuring user experience behavior, customer engagement, and business impact using sophisticated and appropriate analytic tools   Strong proponent of experimental test and design, and practical experience with interpreting observational results   Experience in data visualization tools such as Tableau for full-stack data analysis, insight synthesis, and presentation   Excellent communication and presentation skills with meticulous attention to detail with the ability to communicate effectively between business and analytics teams   Ability to partner with the data engineering and business intelligence teams to run workflows, design requirements, and establish project roadmap to ensure consistent data availability, quality, and accessibility   Excellent time management skills with the ability to operate under tight deadlines   Be a self-starting, driven, accountable, and a high-energy teammate Minimum of a Bachelors degree in Computer Science, Statistics, Mathematics, Engineering, Economics or related field   Masters in a related field preferred    Role Number: 200238362",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:30:52.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}