{
  "job": {
    "title": "data scientist, Operations Analytics - Seattle, WA",
    "industry": "Consumer Goods,Food &amp; Beverages,Retail",
    "description": "Now Brewing - Data Scientist, Operations Analytics #tobeapartner  From the beginning, Starbucks set out to be a different kind of company. One that not only celebrated coffee and its rich tradition, but that also brought a feeling of connection. We are known for developing and supporting partners who share this passion and are guided by their service to others.  As a Starbucks Data Scientist, you will support the Operation Services organization and contribute to Starbucks success by guiding business decisions through utilizing data analysis and consulting that results in predicting outcomes, understanding complex data relationships, and developing a quantitative return on investment. This position partners on a cross-functional team of data scientists, decision scientists and data analysts supporting strategic initiatives utilizing the latest in computing technologies and operating across customer transactions and data elements to unlock the opportunities to support our global business. Starbucks and its brands are an equal opportunity employer of all qualified individuals.  We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.  Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-20T00:00:00.000Z"
  },
  "company": {
    "name": "Starbucks",
    "link": "https://www.linkedin.com/company/starbucks"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}