{
  "job": {
    "title": "Project Engineer 4",
    "industry": "Electrical/Electronic Manufacturing,Aviation &amp; Aerospace,Mechanical or Industrial Engineering",
    "description": "Job description  The Project Engineer 4 (PE4) is responsible for the development, design, test, verification, validation, documentation, qualification, support and release of variety of complex electromechanical components and equipment with mechanical, electronics and software content. The PE4 has extensive technical expertise and has full knowledge of design and product support of aircraft equipment and systems and will be able to troubleshoot the equipment successfully and lead in failure root cause analysis. The PE4 extends technical leadership and is able to lead a team of 3 or more engineers and effectively operate in a cross functional team with members of other departments / partners.  The PE4 interprets customer requirements documents and relate them successfully to the design of new products to meet those requirements. The PE4 is fluent in aircraft regulatory requirements and is able to identify improvement opportunities in the equipment to meet the ever changing needs of the customers. Responsible for the complex electro-mechanical equipment fulfilling the overall system operation, the PE4 has attained the expert level knowledge of the project/system for which s/he is responsible and is responsible for all aspects of safety and regulatory compliance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:19:42.000Z"
  },
  "company": {
    "name": "Safran",
    "link": "https://fr.linkedin.com/company/safran"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Huntington Beach",
    "region": "CA",
    "postal_code": "92605",
    "street_address": null,
    "latitude": 33.659775,
    "longitude": -117.99931
  }
}