{
  "job": {
    "title": "Senior Applications Engineer - Semi/Electronics",
    "industry": "Electrical/Electronic Manufacturing,Computer Software",
    "description": "The Role  Applications Engineers work closely with our sales and business development teams to understand market and customer needs. We are seeking experienced engineers with a strong technical background and customer-focused mindset to join a team of business and technical leaders who drive new areas of growth for NI within the Semiconductor/Electronics and Academic/Research industries.  Successful Applications Engineers effectively balance their time between working closely with the Global Sales and Services organizations to drive new opportunities, growing technical expertise, coaching/mentoring more junior engineers, and providing internal feedback as the voice of the customer. Applications Engineers serve as trusted technical consultants, influencing customer and NI technical direction to ensure mutual long-term success. They stay in tune with industry trends and the NI product roadmap to recommend approaches for customers’ current and future application needs.  Core Responsibilities Key Performance Objectives Qualifications and Skills Basic Qualifications Preferred Qualifications There are many reasons to consider joining a company. Key among them are the people, the ideas, and the technology. At NI, we believe in the power and potential of connecting the three to create a path to success. : We’re looking for curious and creative problem solvers who value diversity and fresh perspectives, are bold and kind, and willing to take chances. : What did you want to be when you grew up? Did you want to program robots? Build flying cars? Leave the world better than you found it? At NI, we build on the big ideas of big dreamers to make their visions a reality. : With our tailored, software-connected approach, we support our customers through all phases of the product development cycle. From 5G and medical innovations to autonomous driving and the future of space travel, we help our customers Engineer Ambitiously every day.  We’ve long been globally recognized as a top employer. Our compensation and benefits are very competitive, as are our modern workspaces, career development and mobility opportunities, and a culture that fosters belonging and emphasizes community giving. We encourage our teammates to challenge the status quo and collaborate with one another to build innovative solutions.  No matter your career path, we’re here for you, for each other, and for the next generation of innovators who think bigger, aim higher, and go faster.  Are you up for the challenge of helping shape humanity for the next 100 years? If so, let’s get started, and let’s Engineer Ambitiously together.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:24:19.000Z"
  },
  "company": {
    "name": "NI (National Instruments)",
    "link": "https://www.linkedin.com/company/niglobal"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}