{
  "job": {
    "title": "Senior Campus Network Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "This position requires the incumbent to sit, stand and perform general office functions. The incumbent may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law. Just a few minutes from Salt Lake City and Utah’s ski slopes, Overstock is an original resident of “ Silicon Slopes ”, one of the fastest growing technology hubs in the country. We’re a passionate group of collaborative problem solvers and creative innovators, working on cutting-edge technology. From building award-winning retail applications (with amazing AR functionality ) to creating leading blockchain and machine learning technologies, each of us embodies a unique value and contributes a diverse perspective to the team. This position requires you to sit, stand and perform general office functions. You may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law.  Back to Overstock Careers",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:34:36.000Z"
  },
  "company": {
    "name": "Overstock.com",
    "link": "https://www.linkedin.com/company/overstock-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 67000,
    "max_value": 98300,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Midvale",
    "region": "UT",
    "postal_code": "84047",
    "street_address": null,
    "latitude": 40.610794,
    "longitude": -111.90804
  }
}