{
  "job": {
    "title": "Machine Learning Research Engineer",
    "industry": "Consumer Electronics,Automotive",
    "description": "The Applied Research team at Bose is seeking a Machine Learning Research Engineer to work at the intersection of Artificial Intelligence and User Experience. As a member of our team, you’ll work on problems in Audio Signal Processing and related fields, and will have the flexibility to pursue research in areas you believe are important to help our users increase their quality of life. Through your pioneering work, you will have the potential to significantly impact the direction of our research, future products, and the lives of our users.  At Bose, we’ve spent more than 50 years finding new ways to bring pioneering audio products to millions of people in their homes, cars, planes, and just about anywhere else people enjoy their music. To succeed for the next 50 years, we must continue to drive innovation that delivers on our human-centered brand promise to help people be more,  feel more, and do more. Work as part of a passionate and collaborative team of ML, iOS, embedded, DSP, and cloud engineers to influence the direction of future Bose Consumer Electronics products  Research, implement, and evaluate published approaches and algorithms for Machine Learning problems.  Participate in all aspects of projects including data collection, literature review, prototype and experience design, and user studies.  Contribute to our human-centered vision of the future of AI for Bose products. Master's Degree in Computer Science, Mathematics, or related field  Strong programming background with 2+ years of experience in Python and/or Java  Experience with TensorFlow or PyTorch  Hands-on experience building ML systems for Signal Processing and/or MIR applications  Familiarity with recent research in DL for audio and ability to implement algorithms from research papers  Passionate, creative, and collaborative mindset  (Desired) Experience and interest in working on audio perception problems such as speech enhancement, voice pick-up, SED/SELD, MIR, etc.  (Desired) Publications in communities such as ISMIR, DCASE, ICASSP, etc. Be a part of passionate, friendly, collaborative team with limitless potential  Opportunity to significantly impact future Bose products that will be used by millions  Excellent work-life balance and a continuous learning environment  Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-19T15:18:41.000Z"
  },
  "company": {
    "name": "Bose Corporation",
    "link": "https://www.linkedin.com/company/bose-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Framingham",
    "region": "MA",
    "postal_code": "01703",
    "street_address": null,
    "latitude": 42.28156,
    "longitude": -71.41882
  }
}