{
  "job": {
    "title": "Cox Home Life Data Analyst IV",
    "industry": "Information Technology and Services,Telecommunications,Financial Services",
    "description": "6205 Peachtree Dunwoody Rd, Atlanta, GA, USA Cox Communications Inc Individual Contributor Yes, 5 % of the Time Full-time Day Job 202103364  The Data Analyst IV creates and delivers business intelligence dashboards and reports to support Cox Homelife operations, sales, customer experience and analytics. This role is an experienced business intelligence architect and developer who is an expert in reporting, analysis, and KPI metrics with advanced understanding of data warehouse concepts, reusable schema and SQL development. This role partners with cross-functional teams and stakeholders in a consultative role on ideas and solutions that impact operational results. This role will ensure the delivery of operational data, analytics and dashboards for all Cox Homelife products. At Cox, we reward your hard work with meaningful benefits.  First, we offer a highly competitive compensation package (base salary + excellent commission plan rewarding strong performance), 401(k) with a generous company match, comprehensive healthcare, life, and disability benefits, plus numerous other benefits, including adoption assistance, pet insurance, and discounts on travel and cars!  We value people more than technology. That means youll work within a culture and with a team that values your leadership, your experience, your contributions, and you - yes, you - as a person. We believe recognition is important, and Cox strives to celebrate those who help make us successful every day. We also encourage diversity and support inclusion; we want you to do you and feel comfortable doing so.  We also offer boundless opportunities for growth; you can sharpen your skills, learn a new talent, join a mentoring program, even earn an advanced degree. Youll find the potential for lateral or upward career growth within the Cox family businesses, including the innovative startups in transportation mobility, clean tech and more. Join the Cox family of businesses and make your mark today!  Who We Are Cox Communications is committed to creating meaningful moments of human connection through broadband applications and services. The largest private telecom company in America, we proudly serve six million homes and businesses across 18 states. Were dedicated to empowering others to build a better future and celebrate diverse products, people, suppliers, communities and the characteristics that makes each one unique. We are the Cox family of businesses. Weve been making our mark since 1898 by building and evolving world-class businesses, staying true to our values, and encouraging top talent to always look for growth and impact while building a career with us. Our primary divisions - Cox Communications and Cox Automotive - are driving a new wave of innovation, powering smart cities with powerhouse broadband communications and pioneering greener, more progressive transportation alternatives for individuals and fleet operators. Were also expanding into new spaces like cleantech and healthcare to rev up our momentum toward building a better future for the next generation. Were looking for the talent today who will be our leaders tomorrow. Sound intriguing? Learn more about where we are today, where we hope youll be going with us, and the common purpose that unites us at coxenterprises.com.  Benefits of working at Cox may include health care insurance (medical, dental, vision), retirement planning (401(k)), and paid days off (sick leave, parental leave, flexible vacation/wellness days, and/or PTO). For more details on what benefits you may be offered, visit our benefits page.  Cox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.  Statement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:38:33.000Z"
  },
  "company": {
    "name": "Cox Communications",
    "link": "https://www.linkedin.com/company/cox-communications"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}