{
  "job": {
    "title": "Software Development Engineer - AWS",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Ever wondered how a company like Amazon /AWS was able to grow so quickly? The Enterprise Engineering team is the key component making it all possible! We are the core to unlocking all the products, services, and tools being used securely and reliably within corporate resources, communicating with one another, and in collaboration with our AWS customers. We build diverse services, ranging from global identity services to critical datacenter infrastructure to customer-facing software, meeting demands for cutting-edge AWS technology and pioneering and what it means to scale optimally.  Over 900K Amazonians and variable staff rely on our products in 35 regions, 472 corporate offices, more than 350 fulfillment centers, and over 900 total Amazon locations including logistics centers and physical retail stores.  We are a builder organization and take pride in resilience, and security in our services. We have a broad portfolio that we manage through our guiding principles. When services throughout Amazon need an Amazonian's identity to grant access to resources, they call on our identity and authentication services, which include Amazon NT (ANT), Amazon's LDAP Directory (LDAP), and Amazon Federate. LDAP supports identity and infrastructure needs in 35 regions, contains 22M objects, and handles 1.5B search operations each month. Our collaboration products include a multitude of products such as email, SharePoint, Slack, telecom for inbound/outbound calling and emergency services, and products to facilitate rich in-person and remote meetings. Our Amazon Oncall and paging solutions allow all Amazon builders support their services and quickly respond to incidents. On an annual basis, we deliver 12B emails, schedule over 7M meetings, connect 60M phone calls, manage on-call rotations for more than 17K teams, and deliver 18M pages. Our client patch compliance services (e.g. Amazon Client Management Engine) manage 486K Windows, Linux, Ubuntu, and Mac desktops and laptops, keeping current with patch releases at lightning speed which no other organization in the world can compare to. Enterprise Engineering drives the Unfabric program, leading the way to zero trust networks inside Amazon and enabling Amazonians to access corporate resources with a zero trust model. We built Amazon Enterprise Access (AEA). Today, AEA provides off-CORP access to Amazon services for 42K iOS and Android mobile devices and 486K AEA-ready laptops. Working from home or on devices with secure access to internal programs is become easier and easier and our teams are pioneering this technology!  Enterprise Engineering also supports workloads central to the operation of our AWS datacenters. This includes services like H2C that provides a real time registry of all Amazon’s servers, playing a central role in the provisioning of new capacity for Amazon services. It also includes services for network time (NTP), configuration management (CMF), and DHCP. Our vision for the future of Enterprise Engineering is to define and deliver a new enterprise strategy for Amazon, driven by greater needs for Amazonians to be productive and collaborate with each other in more flexible ways, constantly being tested and driven at an incomparable level and scale of Amazon Web Services!  In the software engineering role, your experience will become involved with the highest priorities including: POOLING Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us - Amazon Web Services, Inc. Job ID: A1606714",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-14T17:06:27.000Z"
  },
  "company": {
    "name": "Amazon Web Services (AWS)",
    "link": "https://www.linkedin.com/company/amazon-web-services"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 154000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}