{
  "job": {
    "title": "Remote Senior Data Engineer/ Data Scientist",
    "industry": "Information Technology and Services,Computer Software",
    "description": "This Jobot Job is hosted by Amber Heigerick  Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.  Salary $120,000 - $160,000 per year We are a well established Technology company consistently voted best places to work! We believe that everyone deserves to thrive at the company they are part of! We treat our employees like our clients, without you we wouldn't have a company! We give our employees unlimited PTO, flexible work hours, and every other Fridays off. These are just some of our perks. We have very low turn-over, because we have happy employees. We like to promote from with in whenever possible and 90% of the time, are able to do that. Come join a company that you can learn, grow, have fun, and create memories and experiences that will last a lifetime! As a Senior Data Engineer / Data Scientist you will be collaborating with product engineers and software architects to help lead and grow our initiatives.  You should know the following  5+ years as a Data Engineer, Data Scientist, or Machine Learning Engineer  Proven experience in Machine Learning techniques  2+ years deploying data science features in production and working with tools such as Python, Spark, and SQL.  Experience working with unlabled and unstructured data  Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-19T00:00:00.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}