{
  "job": {
    "title": "Sr Software Engineer (Support Coordinator)",
    "industry": "Pharmaceuticals",
    "description": "Lexi is an application program interface (API) layer that connects all IQVIA applications and data assets using a common vocabulary. Our continued growth has opened up new opportunities.  We are looking for a Software Engineer to champion our customer needs and drive towards resolution. We are passionate about our users and our products; help us change the face of enterprise software.  Technical Skill Job Functions At IQVIA, we believe in pushing the boundaries of human science and data science to make the biggest impact possible – to help our customers create a healthier world. The advanced analytics, technology solutions and contract research services we provide to the life sciences industry are made possible by our 70,000+ employees around the world who apply their insight, curiosity and intellectual courage every step of the way. Learn more at jobs.iqvia.com.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other status protected by applicable law.  IQVIA, Inc. provides reasonable accommodations for applicants with disabilities. Applicants who require reasonable accommodation to submit an application for employment or otherwise participate in the application process should contact IQVIA’s Talent Acquisition team at workday_recruiting@iqvia.com to arrange for such an accommodation.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:45:53.000Z"
  },
  "company": {
    "name": "IQVIA",
    "link": "https://www.linkedin.com/company/iqvia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 94400,
    "max_value": 189000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Bridgewater",
    "region": "NJ",
    "postal_code": "08807",
    "street_address": null,
    "latitude": 40.593002,
    "longitude": -74.626434
  }
}