{
  "job": {
    "title": "Data Scientist - Avatar",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Every day, tens of millions of people from around the world come to Roblox to play, learn, work, and socialize in immersive digital experiences created by the community.  Our vision is to build a platform that enables shared experiences among billions of users. This is what’s known as the metaverse: a persistent space where anyone can do just about anything they can imagine, from anywhere in the world and on any device. The breadth of opportunities, and the evolving demands of this first-of-its-kind platform, ensure that your avenues for growth are always expanding and flexible.  Join us and you’ll usher in a new category of human interaction while solving exceptional challenges that you won’t find anywhere else. The Data Science & Analytics organization's mission is to increase our speed, frequency and acumen of making decisions at scale by instilling a data-influenced approach to building products. We cover a wide area of the data spectrum including analytical data engineering, product analytics, experimentation, causal inference, statistical modeling and machine learning. Aligned and partnering with product verticals, we use this tool belt to discover new opportunities and unmet use cases, influence and shape the product roadmap and prioritization, build data products and measure the impact on our community of players and developers. The Avatar team is missioned to power limitless player identity, expression and behavior in real-time. As a Data Scientist, you will be a key participant in helping our product and engineering teams shape the future vision of Roblox. You'll partner with data scientists, product managers, engineers and leaders across the company to better understand our players and builders, performing ad hoc analysis, creating dashboards, defining KPIs, applying models and designing A/B experiments.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-22T03:59:55.000Z"
  },
  "company": {
    "name": "Roblox",
    "link": "https://www.linkedin.com/company/roblox"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Mateo",
    "region": "CA",
    "postal_code": "94406",
    "street_address": null,
    "latitude": 37.54715,
    "longitude": -122.3144
  }
}