{
  "job": {
    "title": "Senior Power and Performance Analysis Engineer",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
    "description": "The Compute Architecture & Analytics (CAA) group under DEG will be setting, gaining, and maintaining leading competitive targets for Intel's IP and SoC portfolio. If you are excited in Architectural Power and Performance analysis, contributing to development of breakthrough technologies for future generation products, please join us. Developing technical competitive analysis across the broad portfolio takes a team of exceptionally innovative and talented individuals who work together to visualize, innovate and make the future of computing possible. Join us to do something wonderful.  As part of Architecture Power and Performance Analysis team, you will be responsible for planning, evaluating, analyzing and Influencing Intel roadmap across mobile, desktop and server segments. As Senior Power and Performance Analysis Engineer, you will be the resident expert in Silicon Power Analysis, Modeling and Power & Performance (PnP) projections. Our software engineers have the opportunity to touch the entire software ecosystem. In fact, by number of employees, we are one of the most influential software companies in the world. At Intel, you’ll be at forefront of everything from enhanced usability and security, to integrated software and hardware solutions, to seamless connectivity. We're looking for more great software engineer leaders who can help us push computing capabilities even further. Those who are passionately motivated by seeing their advanced product design creations used by millions of end users.  https://youtu.be/wY7Kl85qnqU?list=PL267DC6DEE5764F12 Minimum Master's degree in Electrical Engineering and/or Computer Engineering with 1+ year of working experience OR a Bachelor's degree in EE or CS with a minimum of 3+ years of post graduation industry working experience in power analysis of semi-conductor hardware: In the Design Engineering Group (DEG), we take pride in developing the best-in-class SOCs, Cores, and IPs that power Intel’s products. From development, to integration, validation, and manufacturing readiness, our mission is to deliver leadership products through the pursuit of Moore’s Law and groundbreaking innovations. DEG is Intel’s engineering group, supplying silicon to business units as well as other engineering teams. As a critical provider of all Intel products, DEG leadership has a responsibility to ensure the delivery of these products in a cost efficient and effective manner. All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T04:08:40.000Z"
  },
  "company": {
    "name": "Intel Corporation",
    "link": "https://www.linkedin.com/company/intel-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}