{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software",
    "description": "This Jobot Job is hosted by Maleakhi Situmorang  Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.  Salary $50,000 - $120,000 per year Our products and services target the video game, modeling/simulation, and geospatial industries! Our work ranges from full game development services to developing simulations for civil engineering companies! 3 weeks of PTO  Benefits (medical, dental, vision)  401k matching  Performance bonuses Develops information systems by designing, developing, and installing software solutions.  Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.  Develops software solutions by studying information needs, conferring with users, and studying systems flow, data usage, and work processes.  Investigates problem areas.  Follows the software development lifecycle.  Documents and demonstrates solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.  Prepares and installs solutions by determining and designing system specifications, standards, and programming.  Improves operations by conducting systems analysis and recommending changes in policies and procedures.  Obtains and licenses software by obtaining required information from vendors, recommending purchases, and testing and approving products.  Protects operations by keeping information confidential.  Provides information by collecting, analyzing, and summarizing development and service issues.  Accomplishes engineering and organization mission by completing related results as needed.  Bachelor’s degree in Computer Science, Computer Engineering or related technical discipline  2 to 5 years of professional software development experience (game development being ideal)  Proficiency in C/C++, and object-oriented design skills  Experience with Unity or Unreal Engine is a big plus!  Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-13T00:00:00.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Orlando",
    "region": "FL",
    "postal_code": "32889",
    "street_address": null,
    "latitude": 28.53833,
    "longitude": -81.378876
  }
}