{
  "job": {
    "title": "Big Data Engineer (Kafka/Hive)",
    "industry": "Information Technology and Services,Management Consulting",
    "description": "***This position is not offering sponsorship at this time. Must be capable of working for any US employer***  Roles/Responsibilities (5 - 8 day to day candidate’s responsibilities) Required Qualifications (5 - 8 bullet points on must have skills) Employee Status : Full Time Employee  Shift : Day Job  Travel : No  Job Posting : Jul 19 2021 Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.  Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.  Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.  If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T05:54:46.000Z"
  },
  "company": {
    "name": "Cognizant",
    "link": "https://www.linkedin.com/company/cognizant"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "St Louis",
    "region": "MO",
    "postal_code": "63121",
    "street_address": null,
    "latitude": 38.635357,
    "longitude": -90.20099
  }
}