{
  "job": {
    "title": "Software Engineer, Applications.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Robotics & Digital Solutions, part of the Johnson & Johnson family of companies, is recruiting for a Software Engineer, Applications located in Santa Clara, CA to join a team of hardworking engineers who are solving some of the hardest problems in medicine today.  Robotics & Digital Solutions is part of Ethicon, Inc., a global leader in surgery with products and solutions found in almost every operating room around the world. Ethicon has made significant contributions to surgery for more than 100 years from creating the first sutures, to revolutionizing surgery with minimally invasive procedures. Our continuing dedication to Shape the Future of Surgery is built on our commitment to help address the world's most pressing health care issues and improve and save more lives. Through Ethicon's surgical technologies and solutions including robotics, digital solutions, sutures, staplers, energy devices, trocars and hemostats and our commitment to treat serious medical conditions like obesity and cancer worldwide, we deliver innovation to make a life-changing impact. For more information, visit www.ethicon.com.  As a Software Engineer you will be working on the Software Applications Backend team, helping to develop the infrastructure software that controls a real-time robotics system. These are the applications that empower the clinical staff to safely and effectively interact with the medical robotic system. You will be interacting closely with Clinical and System Engineering to test and develop clinical and user requirements. We are looking for a highly motivated candidate who is interested in revolutionizing the world of medical robotics.  We are looking for a Software Engineer with a focus in C++ and Linux to join our team to work on our distributed system. The Applications Backend team manages the System Logic, Audio, Video, LED Lights, User Management and Notification Frameworks.  Core Job Responsibilities Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability.  #RADSoftwareengineers  #gia United States-California-Santa Clara-5490 Great America Pkwy Auris Health, Inc. (6267) R&D 2105901833W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T17:14:05.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 79000,
    "max_value": 128000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}