{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Hardware,Electrical/Electronic Manufacturing,Semiconductors",
    "description": "Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing.  The Smart Manufacturing and AI team at Micron Technology is looking for an ambitious Machine Learning Engineer. Are you curious, high velocity and ready to solve complex problems? Do you dream in SQL and machine learning models? If so, we want you to join us! Our mission is to enable to deliver industry winning machine learning solutions to power Micron’s dominance in the highly competitive memory solutions market. Qualified applicants will have experience in a variety of data and cloud technologies and have extensive practice modeling data, querying, and deploying scalable data pipelines to execute machine learning models. You will collaborate with Data Scientists, ML Engineers, Data engineers and expert users to build and deploy scalable AI/ML solutions that drive value and insight from Micron’s manufacturing processes and systems. We are an industry leader in innovative memory and storage solutions. Through our global brands – Micron® and Crucial® – our broad portfolio of high-performance memory and storage technologies, including DRAM, NAND, 3D XPoint™ memory and NOR, is transforming how the world uses information to enrich life. Backed by more than 40 years of technology leadership, our memory and storage solutions enable disruptive trends, including artificial intelligence, 5G, machine learning and autonomous vehicles, in key market segments like mobile, data center, client, consumer, industrial, graphics, automotive, and networking. Our common stock is traded on the Nasdaq under the MU symbol. To learn more visit micron.com/careers.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.  For US Sites Only: To request assistance with the application process and/or for reasonable accommodations, please contact Micron’s Human Resources Department at 1-800-336-8918 or 208-368-4748 and/or by completing our General Contact Form",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T08:09:22.000Z"
  },
  "company": {
    "name": "Micron Technology",
    "link": "https://www.linkedin.com/company/micron-technology"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 76900,
    "max_value": 127000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Boise",
    "region": "ID",
    "postal_code": "83712",
    "street_address": null,
    "latitude": 43.61579,
    "longitude": -116.20158
  }
}