{
  "job": {
    "title": "Senior Software Engineer - Test",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "As our co-founders transitioned from military to civilian life, they encountered barriers and inefficiencies navigating the most basic health and social services. Together, they set out to improve that experience for others. Recognizing that social care is essential for better health outcomes, they embarked on a mission to connect people to the care they need, when they need it, in communities across the country. Unite Us has developed an intuitive and seamless technology solution that goes beyond the traditional referral method. We work side-by-side with local organizations, and track data and outcomes to build coordinated care networks that support all aspects of community health. Unite Us is boldly changing the nation’s care delivery system. If you want to do well and do good, join Unite Us– we can build healthier communities together. :  Software Development Engineer in Test (SDET) at Unite Us are developers with a passion for quality. As an SDET, your role will be to act as the team’s subject matter expert in test engineering and contribute to code with a focus on testability. You will review designs and look closely at code quality and risk. On a day-to-day basis, you will work with cross functional team members to implement new automated testing solutions and diagnose problems with existing scripts, all running in Continuous Integration environment.  The Software Development Engineer in Test plays an important part in our company’s product development process. Our ideal candidate will have demonstrated success in engineering test projects that are reliable and fast, supporting an efficient and effective testing cycle. If you have a passion for quality and engineer projects that are a joy to use and maintain, we’d like to meet you. : :",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-13T17:48:43.000Z"
  },
  "company": {
    "name": "Unite Us",
    "link": "https://www.linkedin.com/company/uniteus"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}