{
  "job": {
    "title": "Software Engineer, Apple Pay",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.   Are you passionate about building massively scalable services that surprise and delight? Do you have a natural curiosity for learning new technologies? If you answered yes to both questions, the Apple Pay Server engineering team wants to hear from you. Experience with object-oriented analysis and design with languages like Java  Experience developing scalable and distributed systems  Experience authoring and supporting web services  Experience with Relational and NoSQL Databases Apple Pay brought mobile payment to millions of customers and it’s just the beginning. We are looking for engineers who are equally comfortable working at the bits and bytes level and designing state of the art objected-oriented web-services.    Imagine the freedom of a startup but with the funding and focus of the most valuable company in the world.  Job duties include the following:     Architect and implement new features for Apple Pay Write bullet-proof Java code (thread-safe, performant, object-oriented, and inherently testable)   - Work directly with the business team to collaborate on current and future initiatives   - Work directly with the iOS client team on feature definition and development   - Design specifications and protocols to tackle novel problems   - Support ongoing development efforts   - Work on overall team’s efforts to fix bugs and diagnose existing issues   - Embrace test-driven development Unit tests are not optional on this team BS degree in computer science or equivalent field plus 3-4 years software development experience or MS degree plus 1-2 years software development experience, or equivalent Nice-to-have Experience, but not required:     GlobalPlatform 2.2.1    BSI Technical Guideline TR-03111  Elliptic Curve Cryptography Version 2.0    NIST Special Publication 800-38B    EMV Tokenization    APDU/JavaCard    Asn.1   HSM (Thales)    Role Number: 200270120",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T03:16:43.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 118000,
    "max_value": 200000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}