{
  "job": {
    "title": "Software Engineer (Frontend)",
    "industry": "Computer Software",
    "description": "If you LOVE what you do, you'll never have to WORK a day in your life!  We believe that, and we hope you do too! We are doing exciting things at Universal.one, and if you are reading about us for the first time, don't be shy, check out our website also. There is an interesting story to share.  This is where it all started: https://bit.ly/3gIsey7  Where we are today: https://bit.ly/3xrviVt  Welcome to Universal Healthcare!  Though we may new to you, we have a long-standing company history across the globe. In the last 3 years in San Francisco, CA, we have built amazing products. Our goal? To be the top-performing, world-class healthcare, and technology group, and to be respected for excellence by providing access to innovative, evidence-based solutions with a caring approach. Since our mission is bold, we need a bold, forward-thinking, innovative Frontend Developer who specializes in REACT (React.js) to help us build cutting-edge software solutions to revolutionalize the healthcare industry.  Background  We're an innovative HEALTH-TECH startup in San Francisco, CA. Our parent company is in Johannesburg, South Africa. Globally, we've been an industry leader in medical aide, healthcare schemes, care management, professional billing, and corporate wellness solutions for decades. We are looking for a Frontend Developer who is nearly an expert in REACT.js and who is ready to make a difference by creating the healthcare industry’s most cutting-edge software products. You will work with a global, smart, small, but mighty team, and will have the opportunity of a lifetime to build new skills and grow existing ones, in a highly supportive environment.  We use Scrum methodology. We have daily standups. We use 2-week Sprints. We are developing on a core platform (Microservices Architecture). We have new development, deployment, and architecture (and NO LEGACY SYSTEMS to build, add, or integrate). We have stable APIs. We are in an IT GREENFIELD.  Daily to-do list! Do you possess any of these? What about the perks?",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-11T23:03:14.000Z"
  },
  "company": {
    "name": "Universal.one",
    "link": "https://www.linkedin.com/company/universal-one"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}