{
  "job": {
    "title": "Software Engineer, Web (Ecommerce)",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Battle.net & Online Products Software Engineer, Web (Ecommerce) R007607 Battle.net & Online Products is home to 400+ super-powered engineers, product managers, designers, and QA focused on the legendary gaming network, Battle.net, that brings millions of gamers together and makes our products available to our players around the world.  Battle.net currently has multiple web engineering roles available on our eCommerce group. The eCommerce group develops multiple web-based tools and web sites, that run on top of our Ecommerce Platform. In fact, our Battle.net homepage is powered by the Battle.net Ecommerce group, as is our popular Battle.net Web Shop. Our tools allow our game teams and operations teams to configure and operate the Ecommerce business and offering, from configuring thousands of digital products for sale, in our product catalog, to controlling sale events, to scheduling viewership incentives promotions, and requesting millions of keys, all for our Blizzard and Activision games.  Our web apps need to be performant, responsive, secure, localized, and deployed around the world. While we have our share of legacy tech choices, we are also using the latest and greatest web development techniques for our new apps. While we refactor and modernize our older apps, combating tech debt and maintaining technical excellence is important to us.  We use technologies like Angular, React, Java, Spring Boot, Docker, and more to provide the user-facing components and behind-the-scenes tooling of Battle.net's e-commerce experience. Our team frequently discusses emerging tech, opportunities for improvement, and ways to do better. We’ve transitioned to a work-from-home model and we’re continuing to interview and hire during this time. This role is expected to begin as a remote position. We understand each person’s circumstances may be unique and will work with you to explore possible interim options. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  Blizzard Entertainment is a global company committed to growing our employees along with the business. We offer generous benefits and perks with an eye on providing true work / life balance. We’ve worked hard to foster an intensely collaborative and creative environment, a diverse and inclusive employee culture, and training and opportunity for professional growth. Our people are everything. Our core values are real, and our mission has never changed. We are dedicated to creating the most epic entertainment experiences…ever. Join us!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:10:57.000Z"
  },
  "company": {
    "name": "Blizzard Entertainment",
    "link": "https://www.linkedin.com/company/blizzard-entertainment"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 90500,
    "max_value": 126000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Irvine",
    "region": "CA",
    "postal_code": "92717",
    "street_address": null,
    "latitude": 33.68591,
    "longitude": -117.82472
  }
}