{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "At Hookit, we help brands maximize their sponsorship investments while empowering athletes, teams, leagues, and federations to prove and increase their value to sponsors. We are growing our team to support our meteoric growth in the new media, data-driven and insight focused sports sponsorship analytics space - an industry and approach we pioneered nearly five years ago.  Overview:  We’re searching for an experienced Software Engineer to help us continue building out our platform. This is an awesome opportunity to take what you’ve successfully done with .NET Core / ASP.NET to help build new solutions and troubleshoot / restructure existing code. If you dig working with a growing team in a very cool workspace then give us a shout - we want your experience!  Responsibilities: Minimum Requirements: Our Story:  Hookit began as SponsorHouse, a game-changing service to connect amateur athletes with sponsors online. Athletes & founders Scott Tilton and RJ Kraus developed a platform that connected hundreds of thousands of athletes with millions of deals, gathering mountains of data in the process. And, as the data grew, so did the story it was starting to tell...  Today, we are a fast growing team of sports and technology experts widely recognized for solving our customer’s needs with innovative, reliable and easy to use tools.  Based on the coast in San Diego, California, our culture is rooted in ensuring our team is happy with the work they are doing, where they are doing it and who they are doing it with. We want Hookit to be the best, most fulfilling job everyone on our team has ever had.  Powered by JazzHR  47OJhuWqI7",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T19:06:04.000Z"
  },
  "company": {
    "name": "Hookit | AI-Powered Sponsorship",
    "link": "https://www.linkedin.com/company/hookit-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}