{
  "job": {
    "title": "Scientist.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Janssen R&D, department of Protein Therapeutics Development in BioTherapeutics Development is recruiting for a Scientist, Protein Purification located in Malvern, PA.  At the Janssen Pharmaceutical Companies of Johnson & Johnson, we are working to create a world without disease. Transforming lives by finding new and better ways to prevent, intercept, treat and cure disease inspires us. We bring together the best minds and pursue the most promising science. We are Janssen. We collaborate with the world for the health of everyone in it. Learn more at www.janssen.com and follow us @JanssenGlobal. Janssen Research & Development is part of the Janssen Pharmaceutical Companies.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to Diversity & Inclusion, Janssen Research & Development, LLC is proud to be an equal opportunity employer.  The scientist will lead and perform process development for the antibody purification processes within the API-Protein group. Primary responsibilities will include leading in the design of experiments, executing the planned experiments, and optimizing the process steps to the target process scale. This will include laboratory and occasional pilot-scale scale chromatography and filtration. The candidate will own the design and execution of development studies to identify and determine appropriate conditions and ranges of (critical) process parameters for chromatographic purification & separation and several types of filtration. The candidate will record and analyze experimental data, verify data integrity and accuracy, and report/summarize findings to the project team, and also draft technical documents and perform technology transfer to collaboration partners. Scientist will work in a team environment as well as contributing individually to meet project timeline and objectives. Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. United States-Pennsylvania-Malvern-200 Great Valley Parkway Janssen Research & Development, LLC (6084) R&D 2105960762W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T03:27:27.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Malvern",
    "region": "PA",
    "postal_code": "19355",
    "street_address": null,
    "latitude": 40.033436,
    "longitude": -75.51271
  }
}