{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Glossier's mission is to give voice through beauty. We are a direct-to-consumer company that leverages the power of personal narrative to own the beauty conversation on the internet. We do this by building products, growing our community, and making decisions in inclusive, customer-devoted, curious, courageous, and discerning ways.  At Glossier, we are establishing a team of talented engineers to build game-changing software for beauty commerce & community experiences online. We’re hiring talented and experienced engineers to join our growing and collaborative team to build the future of beauty e-commerce. Given our high growth, we have openings across various Engineering teams at Glossier including our Ordering Experience, Discovery, and Operations Systems teams.  We are looking for Software Engineers to build scalable and performant applications using engineering best practices. As a team member, you bring an appetite for learning new technical and non-technical skills. You will closely work with your senior engineers, managers, product, design, and operations teams to create solutions that meet business requirements. You will actively contribute to the engineering and operational excellence across Glossier. You will collaborate with other engineers to surface common pain points, develop solutions and evangelize best practices. 12+ Month Expectations: Glossier is a beauty company that lives in NYC, is sold on the internet, and promotes a skincare first philosophy that celebrates beauty in real life. November 25, 2019  This Global Job Applicant Privacy Policy (“ ”) describes how Glossier, Inc. and our subsidiaries and affiliates (collectively, “ ,” “ ” and/or “ ”) collect, use, disclose, transfer and store (collectively, “ ”) personal information about you in connection with our recruitment activities.  While this Policy is intended to describe the broadest range of our processing activities globally, those activities may be more limited in some jurisdictions based on local laws. For example, the laws of a particular country may limit the types of personal information we can collect or the manner in which we use that information. In those instances, we adjust our internal policies and practices to reflect the requirements of local law. The data controller in each case will be the Glossier entity to which the applicant submits his or her application, as specified below. This Policy does not cover our processing of information collected from you as a Glossier customer or as a visitor to Glossier-affiliated websites. To learn more about Glossier’s data collection practices in these cases, please see our Glossier Privacy Policy. We collect information in connection with your application to work with us, the categories of personal information we may process about you include Your decision to apply for a position and provide your personal information to us is voluntary. We will tell you if information is required to move forward with your application. In certain countries, where permitted by law and on a voluntary basis, we may ask questions about race or ethnicity, veteran status and disabilities for specific purposes, such as to accommodate a disability or illness and to comply with legal obligations relating to diversity and anti-discrimination. You are entirely free to decide whether or not to provide such information and your application will not be affected either way. Except as specifically requested, we ask that you avoid submitting information which may qualify as sensitive information under applicable law, including race, religion, ethnicity, nationality, age, gender identity, sexual life or sexual orientation, medical or health information, genetic or biometric data, political opinions, political party or trade union membership and judicial data such as criminal records. If you provide us with personal information of a reference or any other individual as part of your application, it is your responsibility to obtain consent from that individual prior to providing such information to us. Most of the personal data we process is obtained directly from you, such as when you submit a job application or when we conduct a phone or in-person interview. We may also receive information about you from other sources, such as from your named references, persons who referred you for a position, from background checks (if applicable), recruiting agencies, third party recruitment sources and websites and publicly available sources such as your LinkedIn profile. When you visit our sites, including our Careers webpage, we collect certain information automatically. To collect this information, we may use cookies, web beacons, and similar technologies. A “cookie” is a text file that websites send to a visitor‘s computer or other internet-connected device to uniquely identify the visitor’s browser or to store information or settings in the browser. A “web beacon,” also known as a pixel tag or clear GIF, is used to transmit information back to a web server. We may also collect information about your online activities over time and across third-party websites. We may associate this information with your Glossier account if you have one, the device you use to connect to our Services, or email or social media accounts that you use to engage with Glossier.  For more information about how we use cookies click here. We use your personal information to evaluate a potential employment relationship with you and for other business purposes. Such uses include: If we hire you, information we collect in connection with your application will become part of your employment record and used to manage the onboarding process and for other employment-related purposes in accordance with our internal employee privacy policy. : We may disclose your personal data to Glossier personnel and affiliates who need to know the information, including personnel in the recruiting, human resources and information technology departments, and in the department responsible for the position for which you are applying. We may use third party service providers acting on Glossier’s behalf to perform some of the services described above. For example, we share certain information with service providers who facilitate our applicant tracking system, video interviews, travel booking and expenses, reporting and analytics and verification/background checking services. We also may share information about you with recruitment agencies working with us in relation to your recruitment as well as with our professional advisors, including accountants, auditors, lawyers, insurers and bankers. These service providers may change over time, but we will always use trusted service providers who we require to take appropriate security measures to protect your personal information in line with our policies. We only permit them to process your personal information for specified purposes and, as appropriate, in accordance with our instructions and the provisions of this Policy and applicable law. In certain limited circumstance, we share and/or are obligated to share your personal information with other third parties, including (a) to comply with our obligations, to protect the rights and property of Glossier, our customers and the public, to cooperate with law enforcement investigations, and to detect and respond to suspected illegal activity and threats to the health or safety of any person or of our systems or services; (b) in connection with, or during negotiations of, any merger, joint venture, sale of company assets, financing, or acquisition of all or a portion of our business, assets or stock by another company (including in connection with any bankruptcy or similar proceedings); and/or (c) with your consent and at your direction.  We may also share aggregated or de-identified information, which cannot reasonably be used to identify you. If your application for employment is unsuccessful (or you withdraw from the process or decline our offer), we will retain your information for a reasonable period of time beyond the end of the application process for the purposes described above, including complying with our legal obligations, resolving disputes and as necessary for our legitimate interests, such as to consider you for other current and future employment opportunities at Glossier. If you do not want us to contact you regarding other roles, please contact recruiting@glossier.com. After this period, we will securely destroy your personal information in accordance with applicable laws and regulations.  If your application for employment is successful, personal information gathered during the recruitment process will be retained during your employment in accordance with our internal employee privacy policy and retention policies. You may have certain rights under U.S. and international privacy laws in relation to your personal information. This may include the right to access, rectify, port or erase certain personal information we have about you. You may also have the right to object to and restrict certain processing of your data. Certain information may be exempt from such requests pursuant to applicable data protection laws. You can contact privacy@glossier.com to exercise your rights in relation to your personal information. We will respond to your request consistent with applicable law. If you are a California resident, the California Consumer Privacy Act (“CCPA”) requires us to disclose the following information with respect to our collection and use of personal information. : Over the preceding 12 months, we have collected the following categories of personal information: (1) identifiers, (2) characteristics of protected classifications under California or U.S. law, (3) internet or other electronic activity information, (4) audio, electronic, visual, thermal, olfactory, or similar information, (5) professional or employment-related information, (6) education information, (7) inferences, and (8) other information that identifies, relates, to, describes, or is otherwise reasonably capable of being associated with you. For examples of the precise data points we collect, please see “Information We Collect” [link] above. : We collect each category of personal information for the business purposes in the “How We Use Your Information” section above. We will only use your personal information for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purpose. If we need to use personal information for an unrelated purpose, we will notify the relevant individual and we will explain the legal basis which allows us to do so. Where the collection or processing of personal information is based on your consent, you may withdraw your consent at any time to the extent permitted by applicable law. Due to the global nature of our business, Glossier may transfer your personal information across international borders, consistent with applicable data protection laws, including to the U.S., Canada and European Economic Area (“EEA”). Where personal information is transferred within Glossier to countries outside of the EEA that are not recognized as providing an adequate level of protection under European privacy laws, we do so through a series of intercompany agreements that implement the Standard Contractual Clauses authorized under European privacy laws. We also use a variety of safeguards to ensure that your personal information is adequately protected when processed by our third-party service providers operating in the U.S. or another country outside of the EEA including by signing EU standard contractual clauses or verifying the recipient adheres to the EU-U.S. Privacy Shield and Swiss-U.S. Privacy Shield Framework. You may request additional information concerning such safeguards from the Privacy team by contacting privacy@glossier.com. Glossier is committed to protecting the security of your personal information and ensuring a level of security appropriate to the risk our data processing presents. Taking into account the costs of implementation, the sensitivity of the data and nature of the data processing, Glossier has implemented organizational, technical and administrative measures to prevent the unauthorized access, destruction, loss, alteration or misuse of personal information. If you apply to a position in the U.S., Glossier, Inc. will be the data controller of your personal information. If you reside in the United Kingdom or EEA, or apply to a position in the EEA, Phase EU Limited will be the data controller. If you reside in Canada, or apply to a position in Canada, Glossier Canada, Inc. will be the data controller. If you have questions or concerns regarding this Policy, please contact us using the information provided below.  Glossier, Inc. Phase EU Limited  233 Spring Street 5 New Street Square  East 10th Floor London EC 4A 3TW  New York, NY 10012 United Kingdom  United States  Attn: Legal Attn: Legal privacy@glossier.com privacy@glossier.com  If European privacy laws apply to you and you have a concern about our processing of personal information that we are not able to resolve, you have the right to lodge a complaint with the relevant data privacy authority (this may be linked to where you reside, work or the place of any alleged infringement). For contact details of the relevant Data Protection Authority, please see http://ec.europa.eu/justice/data-protection/article-29/structure/data-protection-authorities/index_en.htm. We may change this Policy from time to time. The effective date of this Policy is noted in the header at the top of this page. If we make changes to this Policy that have a material impact on your rights with respect to how we process your personal information, we will post the revised version here and use other methods, as appropriate, to notify you. By continuing the recruitment process after those changes become effective, you agree to be bound by the revised Policy.",
    "employment_type": "CONTRACTOR",
    "date_posted": "2021-06-30T04:20:42.000Z"
  },
  "company": {
    "name": "Glossier, Inc.",
    "link": "https://www.linkedin.com/company/glossier"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 74000,
    "max_value": 161000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}