{
  "job": {
    "title": "Senior Data Science Machine Learning Engineer - Telecommute",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "If you want to achieve more in your mission of health care, you have to be really smart about the business of health care. Challenge yourself, your peers and our industry by shaping what health care looks like and doing We’re looking for a Senior Machine Learning Engineer to design new data infrastructures and using that infrastructure to deploy machine learning solutions. In this role, you will directly contribute to our mission by working 70% engineering and 30% machine learning/data science building AI/ML systems, models, and infrastructure that increases the quality, performance, accuracy, and effectiveness of our products. Additional responsibility is to support machine learning efforts, including tools design, pipeline maintenance and upgrades, as well identifying current and future bottlenecks of the system  As a Machine Learning Engineer on the team you will build data and tools that enable analytics to inform product and engineering teams at scale.  You’ll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. You’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in. We have modest goals: Improve the lives of others. Change the landscape of health care forever. Leave the world a better place than we found it. Such aspirations tend to attract a certain type of person. Crazy talented. Compassionate. Driven. To these select few, we offer the global reach, resources and can-do culture of a Fortune 6 company. We provide an environment where you're empowered to be your best. We encourage you to take risks. And we offer a world of rewards and benefits for performance. We believe the most important is the opportunity to do The salary range for Colorado residents is $79,700 to $142,600. Pay is based on several factors including but not limited to education, work experience, certifications, etc. As of the date of this posting, In addition to your salary, UHG offers the following benefits for this position, subject to applicable eligibility requirements: Health, dental, and vision plans; wellness program; flexible spending accounts; paid parking or public transportation costs; 401(k) retirement plan; employee stock purchase plan; life insurance, short-term disability insurance, and long-term disability insurance; business travel accident insurance; Employee Assistance Program; PTO; and employee-paid critical illness and accident insurance. Job Keywords: machine learning, machine learning engineer, data science, spark, kafka, python, pyspark, engineer, data pipeline, telecommuter, telecommute, remote, work from home",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-02T17:10:11.000Z"
  },
  "company": {
    "name": "Optum",
    "link": "https://www.linkedin.com/company/optum"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Eden Prairie",
    "region": "MN",
    "postal_code": "55344",
    "street_address": null,
    "latitude": 44.854034,
    "longitude": -93.46017
  }
}