{
  "job": {
    "title": "Senior Backend Software Engineer",
    "industry": "Financial Services",
    "description": "( ): 10 S&P Global Market Intelligence is at the heart of financial workflows when it comes to providing and analyzing data. This position in part of the Xpressfeed team in Data Management Solutions and is focused on providing clients the critical data they need to make the most informed investment decisions possible.  The Impact: As a member of the Xpressfeed Team in S&P Global Market Intelligence, you will work with a group of intelligent and visionary engineers to build impactful content management tools for investment professionals across the globe. Our Software Engineers are involved in the full product life cycle, from design through release. You will be expected to participate in application designs and design reviews; write high-quality code and code reviews; and work with a dedicated team of QA Analysts, Business Analysts, and Database Developers.  If you are a talented developer and want to help drive the next phase for Data Management Solutions at S&P Global and can contribute great ideas, solutions and code and understand the value of Cloud solutions, we would like to talk to you. Does working with a team that collaborates on industry best data solutions excited you. Do you enjoy jumping into projects and searching for issues to solve. Is Software Engineering a passion of yours. S&P Global states that the anticipated base salary range for this position is $68,300 to $155,900. Base salary ranges may vary by geographic location.  In addition to base compensation, this role is eligible for an annual incentive plan.  This role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.  If you need an accommodation during the application process due to a disability, please send an email to: and your request will be forwarded to the appropriate person.  The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.  20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning) 259839 2021-05-18 Boulder, Colorado, United States",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:38:37.000Z"
  },
  "company": {
    "name": "S&amp;P Global Market Intelligence",
    "link": "https://www.linkedin.com/company/s&amp;p-global-market-intelligence"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Illinois",
    "region": "United States",
    "postal_code": "61709",
    "street_address": null,
    "latitude": 40.12414,
    "longitude": -89.14863
  }
}