{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Hardware",
    "description": "As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. We are in a data science renaissance.  Companies that embrace data science will lead and those who do not will fall behind.  To enable IBM's clients to lead, we are building an elite team of data science practitioners to help them learn how to succeed with data science. The team will include Data Engineers, Machine Learning Engineers, Optimization Engineers and Data Journalists.  The team will engage directly in solving real-world data science problems in a wide array of industries around the globe with IBM clients and internally to IBM. As a Data Scientist with our burgeoning team, you will work with other IBMers and client data science teams to solve problems in banking, insurance, health care, manufacturing, oil & gas and automotive industries... to name just a few. Dovetailing with your background and responsibilities, we will also expand the skill sets of our Data Scientists (and sometimes others with a desire to enter the Data Scientist doctrine) to... Today’s operating environment demands a stack that’s responsive to the innovative enterprise – one that can leverage all data types & access the latest technologies. Be part of a diverse and global team of thinkers and doers - people who want to make an impact, cultivate their expertise and collaborate with some of the world’s top business and technology professionals. We’re hiring ... #statisticalanalysis @IBMCloud #DL #predictive #ML #icp4d #algorithms #XaaS #neurodiversity #modelling #hybridcloud #dslc #inclusiveibm #datapoet #neuralnet #analytics #womenintech #SCRUM @caffeinate_adam #IBMToday #CICD #SaaS #blackinstem #python #beequal #bigdata @LifeAtIBM #timeseriesanalysis #appliedmath #datascience #scala #github IBM’s Cloud and Cognitive software business is committed to bringing the power of IBM’s Cloud and Watson/AI technologies to life for our clients and ecosystem partners around the world. IBM provides you with the most comprehensive and consistent approach to development, security and operations across hybrid environments—with complete software solutions for business and IT operations, development, data science, security, and management. Our experts and software capabilities help organizations develop applications once and deploy them anywhere, integrate security across the breadth of their IT estate, and automate operations with management visibility. With IBM, you also have access to new skills and methods, governance and management approaches, and a deep ecosystem of industry experts and partners. What matters to you when you’re looking for your next career challenge?  Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.  Impact. Inclusion. Infinite Experiences. Do your best work ever. IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to  IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. We consider qualified applicants with criminal histories, consistent with applicable law. IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.  &CS",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T00:00:00.000Z"
  },
  "company": {
    "name": "IBM",
    "link": "https://www.linkedin.com/company/ibm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Raleigh",
    "region": "NC",
    "postal_code": "27699",
    "street_address": null,
    "latitude": 35.781303,
    "longitude": -78.64168
  }
}