{
  "job": {
    "title": "Software Engineer",
    "industry": "",
    "description": "Principal Software Engineer  The Data Management and Analytics Engineering team delivers next-generation application enhancements and new products for the changing storage world. Working at the cutting edge, we design and develop independent and intelligent software container services capable of deriving application level insights and recommendations for platforms, peripherals, applications and diagnostics — all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.  Join us as a Software Principal Engineer on our Engineering Development team in Santa Clara to do the best work of your career and make a profound social impact.   What you’ll achieve As a Software Principal Engineer, you will be responsible for developing sophisticated systems, independent AI/ML bas micro-services and software functionalities based on the customer’s business goals and needs  You will:  Contribute to the design and architecture of high-quality, independent and AI/ML based container services on complex management system and software/storage environments, that are capable of providing data projections, and storage level insights/recommendations. Design machine learning programs, developing deep learning systems to various use cases based on the business needs and implement suitable AI/ML algorithms  Provide technical assistance in identifying, evaluating, and developing complex and intelligent and learning based models and algorithms, and testing with wide variety of datasets, that need to be used inside these docker based services, for analytics and smart-service use-cases. Contribute to the development and implementation of test strategies for complex software products and systems/for storage products and systems Apply expertise in quantitative analysis, data mining and presentation of data to develop compelling and accurate projection models and reports to support metrics, historical data trend analysis, and identification of opportunities to drive continuous improvement Review work-in-progress and suggest corrective action to keep projects on schedule Write and maintain operating manuals and assists in preparing activity and progress reports regarding storage management and analytics functions Ensure that installed system services are working effectively and may provide direction to other engineers, customers and analysts who install and maintain systems May periodically assist in orienting, training, assigning, hiring and checking the work of less experienced team members Recognize business needs when prioritizing projects and selecting methods and techniques for solving telecommunication problems Frequently suggest solutions for problems and issues in analytics, storage and manageability areas, and programming May manage, lead and drive short term projects to successful completion Partner with the various teams within Secondary Storage to define technology, analytics needs, requirements and goals Take the first step towards your dream career Every Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:  Essential Requirements  Good knowledge of AI/ML based data modeling, NLP, REST APIs, frameworks and packages, databases (postgresql, nosql, Casandra, etc ) Ability to code/debug and guide others to code/debug flexible, scalable and complex programs, using either written or verbal design specifications Experience with multiple programming languages ( python, java, golang ), operating systems (linux), tools and hardware platforms Experience developing and testing independent, scalable and loosely-coupled docker based micro-services using one of the programming languages. Experience on docker environment, docker swarm, docker-compose, Kubernetes, K8, is a plus Experience building data pipelines and tools using python ( or JAVA, golang ) Ability to learn new tools, languages and operating systems with some training and on-the-job experience Ability to identify, prioritize, and answer the most critical areas where analytics and modeling will have a material impact. Experience in stream data processing and real time analytics of data generated from user interaction with applications. Experience building services, cloud native applications and deploying them in cloud platforms like AWS, is a plus Understanding of design and development of large scale, high throughput and low latency applications is a plus Aptitude to independently learn new technologies Excellent verbal and written communication skills is required  Desirable Requirements  Bachelor's Degree in Computer Science, Engineering or equivalent technical field; Master's degree preferred. 8+ years of related experience Bachelor’s degree  Here’s our story; now tell us yours  Dell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.  What’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.  We started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.  You can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here.  Candidates can submit their application here: https://dell.wd1.myworkdayjobs.com/External/job/Santa-Clara-California-United-States/Software-Principal-Engineer_R117105",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T16:06:13.000Z"
  },
  "company": {
    "name": "Dell EMC",
    "link": "https://www.linkedin.com/company/dellemc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}