{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Education Management,E-Learning",
    "description": "Machine Learning Engineer - ( 2109125 ) We are the world’s learning company with more than 21,000 employees operating in 70 countries. We combine world-class educational content and assessment-powered by services and technology, to enable more effective teaching and personalized learning at scale. We believe that wherever learning flourishes so do people. - location can be remote or Colorado Working closely with a small team of experts, we have a unique opportunity for you to play a leading role in migrating machine learning based solutions from R&D to product-level operational delivery.  Learn more about what we do here: https://www.pearsonassessments.com/large-scale-assessments/k-12-large-scale-assessments/automated-scoring.html The team at Pearson offers a unique environment for extremely skilled and motivated thinkers. Our culture is highly charged with people who are passionate about a cause, using technology to enhance students’ educational experiences. Our team has been building machine learning solutions for educational markets for over two decades.  The anticipated starting salary range for Colorado-based individuals expressing interest in this position is $100-130k. This position is eligible to participate in an annual incentive program.  Benefits available to eligible employees can be seen at: https://pearsonbenefitsus.com/  Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply. : US-RE-Remote :  US-Remote  Remote : Technology : Assessments School : Regular Employee : Standard : Individual Contributor : Day Job : Jun 25, 2021 : Ongoing : Full-time Regular 2109125",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-25T00:00:00.000Z"
  },
  "company": {
    "name": "Pearson",
    "link": "https://uk.linkedin.com/company/pearson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Lansing",
    "region": "MI",
    "postal_code": "48951",
    "street_address": null,
    "latitude": 42.733624,
    "longitude": -84.553925
  }
}