{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Automotive",
    "description": "Embedded in a worldwide network Mercedes-Benz Research & Development North America continuously strives to remain at the forefront of successful automotive research and development. MBRDNA is headquartered in Silicon Valley, California, with key areas of Autonomous Driving, Advanced Interaction Design, Digital User Experience, Machine Learning, Customer Research, and Open Innovation. In Redford, Michigan, the focus is on Powertrain and eDrive technology as well as in Long Beach, where the teams test durability of the latest driver assistant and telematic systems. The Digital Hub in Seattle focusses on developing a cloud architecture and building out the cloud platform for the next generation of connected car services. The Testing and Regulatory Affairs Division in Ann Arbor and the Advanced Vehicle Design in Carlsbad complete the competence center.  This center will be responsible for innovative software development for the global brand with a focus on highly available APIs and services leveraging cloud technologies. While this center is serving the US market directly, the product produced will be launched internationally, impacting the lives of millions of people.  Software engineer will design and develop large scale applications and cloud based services that will fundamentally change consumer experience with connected device worldwide. Successful candidates will operate in an agile environment, embrace DevOps practices and help mentor other team members as needed. Here at MBRDNA, you create digital ecosystems around cars, you design a language between humans and machines, you make a car even more intelligent - you make the new reality for cars. Our benefits include medical, dental and vision insurance, 401k savings plan, tuition and fitness reimbursement programs and much more. We have an open and flexible environment to allow you to push boundaries, join MBRDNA and design your future.  MBRDNA is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.  MBRDNA only accepts resumes from approved agencies who have a valid Agency Agreement on file. Please do not forward resumes to our applicant tracking system, MBRDNA employees, or send to any MBRDNA location. MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes. Mercedes-Benz Research and Development North America, Inc. This Privacy Agreement is to inform you about and governs the processing of your personal data in connection with your application for employment by a Daimler company. The information you enter will only be used for the purposes outlined in this agreement. In order to use this job-platform, you must accept the terms of the agreement as stated below.  The Daimler Company and its affiliates that have advertised the vacancy for data processing. You will find the details in the job advertisement.  The that we process in connection with your application are those you specifically choose to provide. The categories of personal data processed include in particular your name, your contact details, your qualification data, your certificates and supporting documents. We do not ask for (e.g. data concerning racial or ethnic origin, religious or philosophical beliefs, health). In addition, we may process personal data in the application process that we have legitimately obtained from publicly accessible sources (e.g. professional networks). You are responsible for ensuring that the personal data you provide is truthful, correct, and up-to-date. You may update or correct false or outdated information.  We process your personal data exclusively in connection with the application in compliance with applicable statutory provisions. The processing of your personal data serves the of personnel selection for the company to which you apply. Your data may also be processed regularly for statistical purposes. Your data will not be used for any other purposes (such as advertising).  The of your personal data within our company are the managers of the department responsible for filling the position and the relevant Human Resources colleagues. Within the Daimler group of companies, your data can be viewed by all managers of the group in search of suitable persons to fill a position if you opted in to permit unsolicited application/sharing of your data for matching positions. An IT service provider may have access to your data solely when required for relevant operation and maintenance of the Lever recruiting software. To request information from the company your personal data it has stored.  To request the company to correct any incorrect personal data concerning you and, if necessary, to complete any incomplete personal data.  To require the company to delete your personal data to the extent your personal data is no longer necessary for the application process or to comply with any legal obligations.  To object to data processing if your situation gives rise to special reasons which prevent data processing. If the company has no compelling interests worthy of protection (e.g. the exercise of or defense against legal claims), the company may no longer process your data.  To complain to the company if you believe that the processing of your personal data violates the law. The company limits the of your data to the period of time required by applicable law.  The application profile you have created remains active as long as you are in an application process. Once all application procedures have been completed, your profile will be deleted after 63 months [MB1] .  You can access your Personal Data at any time. All entered data can be accessed by persons who are involved in the application processes within the Daimler Company and its affiliated companies. These persons are under an obligation to maintain your privacy. Daimler maintains reasonable administrative, technical and physical safeguards to protect against unauthorized access, use, modification or disclosure of your information.  Liability on the part of Daimler shall be excluded except where mandatory liability applies. Daimler does not accept any liability for the availability of the Daimler websites, the correctness and accuracy of the information contained therein, or for any third-party intellectual property rights or copyrights.  The information contained in this section concerning cookies, pixel tags and log files only pertains to this job application website. Other websites maintained by Daimler entities have different policies concerning cookies, pixel tags, and log files, which should be consulted separately, if visiting those sites.  A cookie is a small data file sent by a web site to a computer's hard drive through a web browser that enables the site to recognize a visitor's web browser and to record activities on the web site. This job-platform will place session-related cookies on your computer, which don´t contain any personal data.  A Pixel Tag is a very small, graphic image on a Web page, Web-based document, or in an e-mail message that is designed to allow the site owner or a third party to monitor who is visiting a site. We do not use Pixel Tags as part of the job application process and this process.  We collect information about all visitors to this website in log files. The information inside the log files includes, but is not limited to, internet protocol (IP) addresses, type of browser, Internet Service Provider ( ISP ), operating system, browser language, date/time stamp, time spent on page and other similar information that is used in an aggregate basis to analyze trends and make improvements to the site. We do not associate IP addresses and other such information to Applicant personal information.  We do not respond to browser \"do not track\" signals at this time.  If you have agreed to permit your application information to be shared for positions other than for those for which you have applied, you consent to use of your application data for use by relevant managers and the HR department of the entire group of companies for recruiting. Additionally, by submitting your application, you represent and warrant that the information you have provided is true and correct in nature. You understand and acknowledge that providing false and/or misleading information may result in no longer being considered for employment or termination of any resulting employment relationship. When you apply for a job with a Daimler Company in the United States, we collect “personal information,” defined as any information that identifies, relates to, describes, is reasonably capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular individual. We collect the following categories of personal information from and about you:  identifiers Directly from you Determining eligibility for employment  Contacting you about future job opportunities Third party service providers who help us perform administrative employment services, such as background check providers.  Under certain circumstances we may be legally compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders. Personal information categories listed in the California Customer Records statute (Cal. Civ. Code Third party service providers who help us perform administrative employment services, such as background check providers.  Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders. Geolocation data Third party service providers who help us perform administrative employment services, such as background check providers.  Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders. Professional or employment-related information Third party service providers who help us perform administrative employment services, such as background check providers.  Under certain circumstances we may be compelled to disclose personal information pursuant to judicial or other government subpoenas, warrants, or orders. : You can ask to see the personal information that we hold about you. If you want to review, verify or correct your personal information, please submit a request via email at data.protection.mbrdna@daimler.com (please refer to in your message). When requesting access to your personal information, please note that we may request specific information from you to enable us to confirm your identity and right to access, as well as to search for and provide you with the personal information that we hold about you. Your right to access the personal information that we hold about you is not absolute. In the event that we cannot provide you with access to your personal information, we will inform you of the reasons why, subject to any legal or regulatory restrictions. Our business and the laws that regulate us change from time to time, and we therefore reserve the right to change our Privacy Agreement without prior notice. If we make a change to our Privacy Agreement, we will post the revised version on our website and mobile applications with the effective date. Any information that we collect will be used consistently with the Privacy Agreement in effect at the time of use.  This Privacy Agreement is effective on January 1, 2020.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-26T09:51:12.000Z"
  },
  "company": {
    "name": "Mercedes-Benz Research &amp; Development North America, Inc.",
    "link": "https://www.linkedin.com/company/mbrdna"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 93300,
    "max_value": 129000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}