{
  "job": {
    "title": "Manager, Solution Engineering - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Are you a seasoned leader hoping to apply your experience to the next exciting frontier in technology sales?  Now is the time to join the most exciting company in Cloud and Digital Workspace.  The Cloud is here, and everything has changed. In the age of mobile and cloud, consumer devices and application experiences are shaping how businesses drive digital transformation. This affects the ways companies engage their customers, employees, and partners, and no longer can we reliably depend on singular, heavily instrumented, on-premise applications. Instead, computing today requires a broad, multi-channel strategy that spans on-premise systems and multiple cloud service providers. Doing it right, while not forsaking traditional on-prem needs, requires longevity and experience; the very kind that VMware has.  VMware solves these cloud generation problems with a comprehensive portfolio of integrated solutions. The platform is comprised of a wide range of products and services; covering many of the capabilities required by exceptional IT operators and developers. VMware earns its seat at the table because of this broad set of capabilities, and IT executives can’t help but pay attention to the innovations that VMware brings.  Essential to our customer’s success is the role of the SE leader; to lead the Solution Engineers that guide those customers through the intricacies of VMware’s solutions, and prove technical fitness to their business needs. As a Sr. SE Manager, you will ensure proper development of the SEs across VMware technologies, domain expertise, and salesmanship. You will lead with credibility, ensuring that you are also fully developed across these categories. You will be highly engaged with customers yourself, helping to articulate VMware’s strategy at a higher level than your direct reports. You will support the company’s strategy, encouraging your team to execute the mission as it pertains to their function. And finally, you will craft a strong franchise with the Region Director(s) you map to, running the business as though you are executive leaders of a small company.  At VMware, we have the right strategy at the right time. We're a highly profitable company; increasingly rare among our peers. We benefit from insightful leadership that will carry us well into the future. We consistently place in Forbes' Best 100 Companies to Work For. We have a strong culture of diversity and inclusion, and we'd love for you to be at VMware too. This job opportunity is not eligible for employment-based immigration sponsorship by VMware Sales Systems Engineering Business Leadership Full Time 2021-06-03  Sales: VMware’s Sales team focuses on two primary goals: helping customers solve their biggest business problems and hitting our bookings targets to keep our company growing and strong. We begin by forging deep relationships with our customers, so we can truly understand their business challenges and opportunities. We help drive their digital transformation by bringing VMware solutions that provide the speed, agility, and efficiency needed to compete and grow in the Internet economy. We also try to make the world a better place by hosting and participating in community activities. Are you inspired by the chance to solve your customers’ biggest challenges? You can make that kind of difference with VMware’s portfolio of industry-leading solutions. Join our team, and you can grow your career and share in the success of an industry pioneer that’s turning companies into truly digital enterprises.  VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.  Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:35:45.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Newark",
    "region": "NJ",
    "postal_code": "07112",
    "street_address": null,
    "latitude": 40.731506,
    "longitude": -74.174385
  }
}