{
  "job": {
    "title": "Manager, Data Scientist",
    "industry": "Biotechnology,Pharmaceuticals,Research",
    "description": "Our mission to find therapies for neurological and rare diseases is a unique focus within our industry and this shared purpose is what connects us as a team. We work together to overcome obstacles and to follow the science. We are resilient as we strive to make an impact on our patients’ lives and on changing the course of medicine. Together, we pioneer. Together, we thrive. The Manager , Marketing Sciences role will be tasked with weaving structured and unstructured data together from across Biogen and working with business stakeholders to develop testable hypotheses. You will be working directly with teams across our Commercial organization, including but not limited to Marketing, Market Research, Patient Services, Field Force excellence , Multichannel Excellence, PRC and many others to answer complex business questions. This role will be responsible for deriving actionable insights for marketing and leadership teams by leveraging all available data assets. In this role, you will need to have the ability to influence decision-makers to adopt a quantitative approach when measuring impact, success and other outcomes. Ability to translate technical findings into actionable insights for business stakeholders is a key aspect of this role. Projects can range from patient finding initiatives across therapeutic areas , Marketing Mix models , all the way to AI driven models to support next best action This position is a high visibility role that will touch many aspects of the company. Bachelor's Degree Required/Master's Degree in related field preferred Or a minimum of 4 years' experience in Analysis/Data Science fields.  Additional Information  This role will be responsible for deriving actionable insights for marketing and leadership teams by leveraging all available data assets.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:50:23.000Z"
  },
  "company": {
    "name": "Biogen",
    "link": "https://www.linkedin.com/company/biogen-"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Weston",
    "region": "MA",
    "postal_code": "02193",
    "street_address": null,
    "latitude": 42.36793,
    "longitude": -71.29827
  }
}