{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Hardware",
    "description": "As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. Are you ready to lead in this new era of technology and solve some of the world's most challenging problems? If so, let's talk.  We focus on providing a world-class user experience for IBMers, and we treat security as a fundamental aspect of this user experience. We use several new security services and tools to enable our secure engineering practices. And we use the latest techniques, methods, and technology in the industry to host large-scale mission-critical infrastructure successfully. We strive to keep learning and improving, and we work to share the knowledge we have learned throughout IBM. We cultivate an open, healthy, diverse, and engaging work environment where team members continuously gain new skills that align with individual interests.  We're hiring a Data scientist to expand our team of analytics and engineering experts. Above all, we are looking for applicants who will thrive in an open, vibrant, flexible, fun-spirited, collaborative environment and desire creative freedom and an opportunity to work on high-performing teams! Office of the Chief Information Officer (CIO) owns IBM’s IT strategy and provides the tools, workstations, devices, and infrastructure that IBMers use to do their jobs every day. Put simply, our mission is to create a productive environment for IBM's 350,000 worldwide employees. Join us as we lead with design to drive simplicity and ease of use, engineering the systems that run the business, and innovating to transform the business. Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.  Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.  It's time to define your career. IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.  Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.  At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to  IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. We consider qualified applicants with criminal histories, consistent with applicable law.  IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship. IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T00:00:00.000Z"
  },
  "company": {
    "name": "IBM",
    "link": "https://www.linkedin.com/company/ibm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}