{
  "job": {
    "title": "Machine Learning Software Engineer, Computational Music",
    "industry": "Consumer Electronics",
    "description": "Apple's Computational Music team is looking for a hardworking Software Engineer to advance technologies around music understanding and analysis. We perform both exploratory and targeted algorithms research and development in a dynamic small team environment. Our projects involve significant application of Machine Learning and audio-, music- and signal-processing with an explicit goal of shipping software to support current and future products and features at the scale of Apple's ecosystem. A strong history of delivering high quality results on time  Proven ability to work collaboratively within in a multi-functional environment.  Proficient in Python  Experience with any of C++, Objective C or Swift  Deployment of machine learning models to production  Comfort working in, taking ownership of, and improving existing software projects  Interest in working on music projects  At least 3 years of full-time experience in software engineering  1 year or more experience of shipping production Machine Learning models The Computation Music team is looking for a Software Engineer with a strong track record of building and shipping significant software products, who is self-motivated and passionate about their work. The ideal candidate will be a strong Python and C++ or Objective C or Swift programmer with validated experience of crafting, prototyping, and delivering algorithmic solutions via complete performant implementations.    You will play a key role in addressing the “last mile” challenges of deploying ML models for music into production and providing feedback to other parts of the ML lifecycle.   The person in this role should be interested in staying up to date on new developments in the field, and be able to apply that knowledge to solving challenging problems across multiple domains.   We would love to see examples of prior work you are proud of; Feel free to point us at your GitHub repository or equivalent if you have one.    Role Number: 200273408",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T09:13:35.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}