{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Business Supplies and Equipment",
    "description": "PARC is incubating a new software venture in the Industrial Internet of Things (IIoT) space. We are looking for a Data Scientist who will be responsible for developing algorithms for anomaly detection, diagnostics, and prognostics of failure using machine learning techniques and hybrid machine learning/physics-based variants using streaming sensor data from industrial equipment.  The Data Scientist is expected to assist in designing and building modular, reusable models and algorithms that will be deployed as a service offering in a large number of different industrial environment. The particular service offering is in the context of Predictive Maintenance (PdM) and has the goal to reduce operational disruptions due to equipment malfunction. The Data Scientist needs to be comfortable with engaging in the end-to-end process of remote monitoring which includes all steps from data collection to analytics results presented back to customer. The Data Scientist is expected to adhere to disciplined coding guidelines and styles so that the solutions can be integrated into a software platform. Additionally, the solutions need to be robust to variations to input, minor design variations, and similar so they can be scaled across many different customer applications. The job location is Palo Alto, CA. Please note that the position will require occasional travel (up to 20%), mostly within North America.  Xerox is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity or expression, sex, marital status, sexual orientation, physical or mental disability, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. Learn more at www.xerox.com and explore our commitment to diversity and inclusion! People with disabilities who need a reasonable accommodation to apply or compete for employment with Xerox may request such accommodation(s) by sending an e-mail to XeroxStaffingAdminCenter@xerox.com. Be sure to include your name, the job you are interested in, and the accommodation you are seeking.  © 2020 Xerox Corporation. All rights reserved. Xerox® and Xerox and Design® are trademarks of Xerox Corporation in the United States and/or other countries.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T17:04:06.000Z"
  },
  "company": {
    "name": "Xerox",
    "link": "https://www.linkedin.com/company/xerox"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}