{
  "job": {
    "title": "Software Engineer, Apple Pay",
    "industry": "Consumer Electronics",
    "description": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Imagine what you could do here. Bring passion and dedication to your job and there’s no telling what you could accomplish.   The Apple Pay Server team is a rare engineering group within Apple. We provide critical services for the company across every product line. From manufacturing to customer facing, our services span across the entire lifecycle of most Apple hardware. By designing and implementing services that are tightly coupled with hardware, we support the ongoing need to improve security of customer’s sensitive data (financial or otherwise) and privacy. Many of our services are seen in the iOS Security Guide and are publicly discussed on Internet forums. 2-5+ years experience in server software programming using Java  Experienced in designing & developing highly scalable applications, RESTful web services  Detailed knowledge of relational and non-relational databases  Expertise in test-driven development  Proven track record of successful product delivery  Exceptional analytical and problem solving skills across large ecosystems  Demonstrated ability to think criticality and quickly learn new technologies  Strong communication, collaboration & interpersonal skills  iOS and macOS familiarity preferred  Experience in payment industry is a plus  Expertise in identity management is a huge plus  Experience/understanding of security & cryptography is a plus Imagine the freedom of a startup with the funding and laser focus of the most valuable company in the world.    As a Software Engineer on the Apple Pay Server team:     • You will participate in initiatives that are essential to the success of upcoming product launches and product security initiatives.    • You will get the opportunity to lead a small group of engineers working on product features.    • You will develop the next generation of cloud support that powers Apple Pay.    • You will be responsible for designing and developing large scale platforms that can support future Apple Pay functionality.    • You will have the opportunity to explore and contribute to a wide range of technologies.    • You will work collaboratively with Apple’s iOS Engineering team, NFC team, security team, and external partners to define the next hot feature of Apple Pay. BS or MS in Computer Science/Engineering or equivalent practical experience    Role Number: 200215817",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T17:09:19.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 75600,
    "max_value": 160000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}