{
  "job": {
    "title": "Software Engineer, Integrations",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Pinwheel provides an API that makes it easy for any user to connect their payroll account to any app. By building pipes that connect payroll platforms to banks, lenders, and other service providers, we hope to help underserved consumers gain equitable access to financial services when they need it most, while sparking innovation of new financial products.  Financial institutions often rely on traditional credit scoring systems that look at a consumer's past behavior and limited demographic data. More than half of Americans have a poor credit score or no score at all, and 78% live paycheck to paycheck. Without access to affordable financial products, they resort to high-interest credit cards, payday loans, and trigger overdraft fees to make ends meet — which ultimately push them into deeper cycles of debt.  At Pinwheel, we believe that unlocking API access to payroll systems helps build towards a fairer financial system. Most people's money can be traced back to a payroll system (e.g., ADP, Paychex, Gusto) — meaning those systems sit at the top of the financial stack and harbor a wealth of income and employment data, and tapping into them offers limitless possibilities. Here are just a few ways Pinwheel's solution helps our customers and their end users: We are looking for skilled engineers to join our integrations engineering team. This team is responsible for the core business function of building and maintaining code that interacts with hundreds of different platforms and payroll providers. If you're the type of person that loves to make your own tools that mash together different data sources, you'll be a good fit. - Our company is small but well-funded, meaning you get the upside of starting on the bottom floor with minimal risk. - You will have an active hand in molding the company culture and being a part of the entrepreneurial journey. - Help build the consumer data infrastructure of the future. - $90,000 - Full medical, dental and vision benefits. Unlimited vacation and sick days. 401K plan. Snacks delivered monthly. And so much more!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T05:16:02.000Z"
  },
  "company": {
    "name": "Pinwheel",
    "link": "https://www.linkedin.com/company/pinwheelhq"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}