{
  "job": {
    "title": "Software Engineer In Test",
    "industry": "Financial Services,Information Technology and Services",
    "description": "Every day, Global Payments makes it possible for millions of people to move money between buyers and sellers using our payments solutions for credit, debit, prepaid and merchant services. Our worldwide team helps over 3 million companies, more than 1,300 financial institutions and over 600 million cardholders grow with confidence and achieve amazing results. We are driven by our passion for success and we are proud to deliver best-in-class payment technology and software solutions. Join our dynamic team and make your mark on the payments technology landscape of tomorrow. Performs and participates in application development and testing to apply continuous quality and testability of code throughout the software development lifecycle. Builds quality within the software development process with automated testing suites providing a comprehensive view from code quality to functionality. Uses quality paradigms to provide real time quality with use of automation and frequent regression testing. Designs / develops and maintains automation frameworks and automation test suites and scripts with continuous integration, testing, deployment and delivery. Conducts performance, load, security and service virtualization testing. We need to replace this positions ASAP as we are working on a tight schedule to deliver on various synergy projects. This position is critical for building the Heartland Integration Team; focusing on Resiliency, Reliability, and Robustness of the ProPay Platform. It is a key position to meet current, and future product and engineering need; including: Vital, Genius, Portico, Heartland, and other initiatives that require in-depth industry knowledge around Software Engineering, DevSecOps, Continuous Integration and Delivery, Operational Intelligence, Quality Engineering, and Enterprise Toolsets for Product Lifecycles. Global Payments Inc. is an equal opportunity employer.  Global Payments provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex (including pregnancy), national origin, ancestry, age, marital status, sexual orientation, gender identity or expression, disability, veteran status, genetic information or any other basis protected by law. Those applicants requiring reasonable accommodation to the application and/or interview process should notify a representative of the Human Resources Department.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T21:48:37.000Z"
  },
  "company": {
    "name": "Global Payments Inc.",
    "link": "https://www.linkedin.com/company/global-payments"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Lindon",
    "region": "UT",
    "postal_code": "84042",
    "street_address": null,
    "latitude": 40.34469,
    "longitude": -111.72308
  }
}