{
  "job": {
    "title": "Computer Vision &amp; Machine Learning Engineer",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Telecommunications",
    "description": "Work is no longer a place. It’s what you do. And how you do it. More fluid, more flexible, powered by your imagination and by some amazing technology!  That’s where we come in. We are Poly. We outfit you with beautifully designed and engineered audio and video products so that YOU can do YOU. Wherever and whenever.  Join us as we pursue our disruptive vision to bring professional audio and video meeting technology and services to everyone. Be a part of our journey!  Poly is advancing the state-of-the-art in what is possible for communications, bringing advanced technology into every conversation. Our work enables humans to connect and communicate more effectively. As part of that effort, we have a need for a in the Office of the CTO.     The successful candidate will work with the team adding machine learning and computer vision capabilities to Poly’s video, audio, and cloud offerings.  Position is in the Austin, TX, area, relocation available. Remote work for exceptional candidates possible. At Poly, leadership principles aren't just something we talk about, they're something we live and breathe. We believe in creating a work environment where people feel empowered, supported, and included –where trust and transparency are built into the way we work - where creativity, curiosity, and continuous improvement are encouraged and nurtured every day. All qualified applicants will receive consideration for employment without regard to sex, gender identity or expression, race, age, religious creed, national origin, physical or mental disability, ancestry, color, marital status, sexual orientation, military or veteran status, status as a victim of domestic violence, sexual assault or stalking, medical condition, genetic information, accessibility needs, or any other protected class or category recognized by applicable equal employment opportunity or other similar laws.  No matter where you’re based, you’ll experience a company that believes that teamwork and collaboration drive maximum impact, seeks well-rounded talent to focused on providing the best customer experience, and understands that this is a marathon, not a sprint. And, top of mind to us is continuously and purposefully building an inclusive culture that empowers all of our team members, across the globe, to do their best work and be the best version of themselves.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T23:57:25.000Z"
  },
  "company": {
    "name": "Poly",
    "link": "https://www.linkedin.com/company/polycompany"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Greater Phoenix Area",
    "region": null,
    "postal_code": "85003",
    "street_address": null,
    "latitude": 33.44547,
    "longitude": -112.06631
  }
}