{
  "job": {
    "title": "Software Engineer, Customer Support",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Company Background  ThreatConnect, Inc. provides cybersecurity software that reduces complexity for everyone, makes decision making easy by turning intelligence into action, and integrates processes and technologies to continually strengthen defenses and drive down risk. Designed by analysts but built for the entire team (security leadership, risk, security operations, threat intelligence, and incident response), ThreatConnect’s decision and operational support platform is the only solution available today with cyber risk quantification, intelligence, automation, analytics, and workflows in one. To learn more, please visit www.threatconnect.com.  We offer a competitive benefits package with comprehensive insurance coverage, unlimited paid time off, and unique perks designed to help you meet your financial and personal goals.  We are committed to offering an employment experience and benefits package that enables you and your family to grow with us and to share in our success. We love to recognize our employees who have gone above and beyond, and offer incentives like quarterly awards, an employee bonus and referral program, and team-building outings. The Software Engineer, Customer Support will join our Customer Success team, which focuses on allowing our customers to build some of the most sophisticated Threat Intelligence operations in the world. The position will report to the Director of Customer Support and will provide top-tier customer support to the company’s growing list of important customers. In order to provide such an elite service, the ThreatConnect Customer Success team requires highly motivated individuals who love to tinker and solve problems as a team. This service requires the ability to understand and troubleshoot a wide range of customer issues, from usability questions and technical configuration issues to complex system and software-related challenges. The right individual will be able to log and update cases, inform customers of case status, and provide solutions as they become known. They will also be responsible for identifying and addressing gaps in customer understanding by growing the documentation, knowledge base, and training materials as appropriate. Support Specialists will collaborate internally across Sales, Product Management, Engineering, and Customer Success to identify timely solutions to customer problems. They must also work with customers’ analysts, engineers, management, and other staff to understand issues, troubleshoot in a variety of environments, and convey solutions effectively. You believe that strong communication skills, both written and oral, are just as vital as technical expertise and critical thinking ability.  In this role, you’ll get to... This Job is Awesome Because… 1-3-6-12 Month Plan Work-Life Balance Medical Financial",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-17T03:23:45.000Z"
  },
  "company": {
    "name": "ThreatConnect",
    "link": "https://www.linkedin.com/company/threatconnect-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}