{
  "job": {
    "title": "Software Engineer - Backend - VMware / Windows",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "VMware and Windows are the most widely used data protection and management services in Rubrik. You and the team's work will make a huge impact for our customers and for Rubrik.  Our team builds products to protect and manage Rubrik customers’ deployment of VMware and Windows hosts in both data centers and cloud. We make it easier for customers to protect their deployment, faster to recover from unforeseen events.  Our engineers are self-starters, driven, and proactive. We provide opportunities for personal growth and support for professional development. Our goal is to motivate and challenge you to do your best work. As a Software Engineer, you will be responsible for: You are passionate about working with complex distributed systems that serve business and enterprise customers: Rubrik is one of the fastest growing companies in Silicon Valley, revolutionizing data protection and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. Rubrik has raised over $553 million in venture funding, most recently at a valuation of $3.3 billion. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T22:58:52.000Z"
  },
  "company": {
    "name": "Rubrik, Inc.",
    "link": "https://www.linkedin.com/company/rubrik-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 125000,
    "max_value": 172000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}