{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
    "description": "A \"Magic Quadrant\" leader, Ivalua's solutions work in a complex global economy. Our innovative Source-to-Pay solutions include automating customized workflows to source, contract, request, procure, receive, and pay for goods and services across the enterprise, refining the procurement lifecycle while reducing cost and risk of spending on indirect goods, direct goods and services, and improving supplier collaboration.  All companies want the best and brightest. At Ivalua, we also want team members who have a global point of view and who bring customer-focused enthusiasm and ambition to the table. We are a company of doers, of problem solvers, of figure-it-outers. We have fun and we work hard. Ivalua is a truly global company with a diverse team of contributors and a set of core values that people can feel every day across all our offices. You will be part of the Support Team whose mission is to maintain customer applications, successfully deliver enhancements, updates and upgrades to customers, proactively monitor production environments and take actions to improve the overall user experience and the business value provided to our Customers. The Support Team operates with high quality standards and strong commitment to excellence and efficiency. Our team is very hands-on with a strong mindset of problem solving while also having the ability to think of the implementation holistically and provide solutions that solve the customer's long-term challenges.  Our team works hard, plays hard and enjoys all indoor and outdoor activities that the company organizes from time to time, so that you can focus, work collaboratively, and be at your creative best. This is an exciting opportunity for a Customer Application Engineer / Senior Engineer at Ivalua. You will be first point of contact for Clients who have implemented Ivalua Solution and are engaged with us in the Maintenance / Support (post go live) workstream. Watch the Ivalua Video: https://vimeo.com/363634218  Join Ivalua today and procure a great future for your career!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T05:07:22.000Z"
  },
  "company": {
    "name": "Ivalua",
    "link": "https://www.linkedin.com/company/ivalua"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redwood City",
    "region": "CA",
    "postal_code": "94064",
    "street_address": null,
    "latitude": 37.4805,
    "longitude": -122.21528
  }
}