{
  "job": {
    "title": "Software Sr Engineer",
    "industry": "Financial Services,Investment Management,Banking",
    "description": "During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application.  At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.  Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees. At Wells Fargo, the Chief Technology Office (CTO) organization is leading technology transformation in a multi-cloud technology landscape by developing and delivering innovative products that delight our customers and speed to market banking products. As part of the CTO Site Reliability Engineering (SRE), the Enterprise Observability Team is responsible for delivering innovative, scalable, stable, and secure products that provide deep business insight, operational insight, and predictive analysis. As a member of the team, you will be a key contributor to the development of products that provide full stack observability including application monitoring, logging, alerting, visualization, machine learning and artificial intelligence (AI/ML).  As part of the Enterprise Observability team, the Software Engineer will design, develop, and implement a unified logging layer with primary responsibility to roll out standard Logging Libraries integrated into the CI/CD toolchain (Artifactory). As part of the Observability team, you will integrate and assist in building logging architectures including Kafka, LogStash, Splunk, and ElasticSearch / ELK. You will be responsible for implementing unified logging layer that streams petabytes of application data and ensuring that all data including confidential data adheres to security standards and policies by implementing necessary controls as code (masking, formatting, etc.). As a Software Engineer, you will partner with internal customers, architects, engineers to gather requirements to build unified logging layer and products that are scalable, stable, and secure while leveraging Agile methodology. All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation. Visit https://www.wellsfargo.com/about/careers/benefits for benefits information. 5597506-2",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:32:06.000Z"
  },
  "company": {
    "name": "Wells Fargo",
    "link": "https://www.linkedin.com/company/wellsfargo"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chandler",
    "region": "AZ",
    "postal_code": "85226",
    "street_address": null,
    "latitude": 33.302284,
    "longitude": -111.8401
  }
}