{
  "job": {
    "title": "Senior Data Scientist (Machine Learning)",
    "industry": "Financial Services",
    "description": "Shape a brighter financial future with us.  Together with our members, we’re changing the way people think about and interact with personal finance.  We’re a next-generation fintech company using innovative, mobile-first technology to help our 2+ million members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront.  We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. The Risk Operations Data Science team is looking for a Data Scientist to develop advanced machine learning models, guide measurement, strategy, and data-driven decision making to support various credit risk and operational areas at SoFi. The Data Scientist will work closely with Credit, Risk, Product, Engineering, and Operations teams to design solutions to enhance loan processing, prevent login fraud and account take over, and support loss mitigation, etc. These tasks involve developing complex business rules to researching and applying state of the art machine learning modeling methodologies to solve complex business problems. This role is very rewarding as your work will have a direct and immediate impact on the business’ profitability. SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:13:20.000Z"
  },
  "company": {
    "name": "SoFi",
    "link": "https://www.linkedin.com/company/sofi"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}