{
  "job": {
    "title": "Enterprise Solutions Engineer",
    "industry": "Computer Software",
    "description": "GitHub helps software teams succeed by enabling them to build better software, together. We're looking for experienced Solutions Engineers in the Western US to provide pre- and post-sales support to some of the most technically advanced software organizations in the world. A Solutions Engineer is responsible for the technical relationships with customers and prospects, working as a trusted advisor with customers to remove technical objections and creatively address pain points in a customer's SDLC. Solutions Engineers at GitHub also work internally with sales and product development to identify and communicate solutions which meet customers' ever changing business needs against the capabilities of GitHub's platform.   We're extremely passionate about the quality of our work. If you are technically sharp and people oriented, you might be a fit for this role! GitHub is the developer company. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where many Hubbers work, snack, and create daily. The rest of our Hubbers work remotely around the globe. Check out an updated list of where we can hire here: https://github.com/about/careers/remote   We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.   GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!   Please note that benefits vary by country. If you have any questions, please don't hesitate to ask your Talent Partner.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:09:04.000Z"
  },
  "company": {
    "name": "GitHub",
    "link": "https://www.linkedin.com/company/github"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Spokane",
    "region": "WA",
    "postal_code": "99213",
    "street_address": null,
    "latitude": 47.659,
    "longitude": -117.425026
  }
}