{
  "job": {
    "title": "Nuuly: Lead Site Reliability Engineer",
    "industry": "Marketing and Advertising,Apparel &amp; Fashion,Retail",
    "description": "Launching a clothing rental subscription service might seem like a bit of an unusual move for a company known for experiential retail concepts, but it's right in line with our mission since 1970: encouraging customers to express themselves through their wardrobes and the spaces they keep.  Our unlike-anywhere-else curation of hundreds of designers and labels—and not just from our own brands—is designed to give you everything you need to get inspired, get creative and explore all the different aspects of your individual style, we're here so you can get dressed the way you want.  Launching a clothing rental subscription service might seem like a bit of an unusual move for a company known for experiential retail concepts, but it's right in line with our mission since 1970: encouraging customers to express themselves through their wardrobes and the spaces they keep. Our unlike-anywhere-else curation of hundreds of designers and labels—and not just from our own brands—is designed to give you everything you need to get inspired, get creative and explore all the different aspects of your individual style, we're here so you can get dressed the way you want. Urban Outfitters, Inc. (NASDAQ: URBN, www.urbn.com) is a Fortune 1000 company with $3.4 Billion in revenues offering lifestyle merchandise to highly defined customer niches through brands including Urban Outfitters, Anthropologie, Free People, Terrain, BHLDN, and Nuuly. Nuuly is the newest brand under the URBN umbrella, focusing on circular fashion and offering a subscription rental experience for women’s apparel. At Nuuly, we pride ourselves on a relaxed office culture, including flexible work from home, and campus perks, including a gym. When in the office, our employees enjoy our beautiful, dog-friendly workplace at the Philadelphia Navy Yard. Site Reliability Engineering (SRE) combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Nuuly's services—both our internally critical and our externally-visible systems—have reliability, uptime appropriate to users' needs and a fast rate of improvement. Additionally SRE's will keep an ever-watchful eye on our systems capacity and performance. Much of our software development focuses on optimizing existing systems, building infrastructure and eliminating work through automation. The above information has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.  Urban Outfitters, Inc. celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T03:56:48.000Z"
  },
  "company": {
    "name": "Nuuly",
    "link": "https://www.linkedin.com/company/nuuly"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Philadelphia",
    "region": "PA",
    "postal_code": "08051",
    "street_address": null,
    "latitude": 39.95106,
    "longitude": -75.16562
  }
}