{
  "job": {
    "title": "Software Test Engineer - 36847",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Alion is looking to put in place a team of engineers to support testing and integration of Minotaur Software program. This team would work out of the office located at Hanover, MD a in the integration labs supporting Navy Airborne SIGINT platform systems. The software test engineer would be responsible for testing and integration the Minotaur Software product. Under general supervision runs tests to evaluate the function of products and systems. Develops and implements procedures for Minotaur Software product testing and writes up defects for correction or further investigation. Reviewing software requirements and preparing test scenarios. Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree. Software Engineering (Embedded, Application, Database, User Interface, Operating System(s), Board Support Packages, Network Communications, Mobile Communications, Linux, Microsoft Windows) Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree.  2-4years of experience in software testing.  US Citizen with a current DOD SECRET clearance with the ability to get TS/SCI clearanceis required.  Previous experience working with the Minotaur Product is extremely desirable.  #CB Security Clearance: None * Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree., Bachelor's Degree in Software, Computer Engineering, Electrical Engineering, or related discipline. Years of experience could be substituted for degree. 2-4 years of experience in software testing. US Citizen with a current DOD SECRET clearance with the ability to get TS/SCI clearance is required. Previous experience working with the Minotaur Product is extremely desirable.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-01T08:32:39.000Z"
  },
  "company": {
    "name": "ClearedJobs.Net",
    "link": "https://www.linkedin.com/company/clearedjobs-net"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Hanover",
    "region": "MD",
    "postal_code": "21098",
    "street_address": null,
    "latitude": 39.19298,
    "longitude": -76.72437
  }
}