{
  "job": {
    "title": "Social Programmer I, Hockey",
    "industry": "Consumer Goods,Entertainment,Online Media",
    "description": "R000042205 WarnerMedia is a leading media and entertainment company that creates and distributes premium and popular content from a diverse array of talented storytellers and journalists to global audiences through its consumer brands including: HBO, HBO Max, Warner Bros., TNT, TBS, truTV, CNN, DC Entertainment, New Line, Cartoon Network, Adult Swim, Turner Classic Movies and others. Bleacher Report, a WarnerMedia company, makes it as easy as possible to be a sports fan by defining the moments that matter. Empowering, personal and community driven, its vision for making sports bigger than the game has led to unmatched engagement on social media, where it consistently ranks as the No. 1 digital and social brand. Bleacher Report also provides an industry-leading fan experience on mobile devices through its unparalleled app experience. This year Bleacher Report was ranked as one of the ‘World’s Most Innovative Companies’ by Fast Company.Find Bleacher Report on the web at www.bleacherreport.com and on Instagram @BleacherReport. Bleacher Report is a division of Turner Sports. The content programmer I, hockey expert, is responsible for daily programming and curation of B/R’s newly created hockey portfolio brand. He/she will assist in daily curation, caption writing, content packaging and discovery, as well as give input on editorial decision-making. SportsRecruiting2021 Warner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T18:31:08.000Z"
  },
  "company": {
    "name": "WarnerMedia",
    "link": "https://www.linkedin.com/company/warnermedia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Utica-Rome Area",
    "region": null,
    "postal_code": "13501",
    "street_address": null,
    "latitude": 43.09009,
    "longitude": -75.2616
  }
}