{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "The Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.  A day in the life As a key member of the team, you will provide machine learning expertise that helps accelerate the business. You will build various data and machine learning models that help us innovate different ways to enhance the customer experience. You will need to be entrepreneurial, wear many hats, and work in a highly collaborative environment across engineer, product, marketing and BI. We like to move fast, experiment, iterate and then scale quickly, thoughtfully balancing speed and quality. The Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.  Job responsibilities The Amazon Fire TV Team is looking for a passionate and solution oriented Data Scientist to help redefine and build new, science-driven experiences for customers enjoying Fire TV across the world.  As a key member of the team, you will provide machine learning expertise that helps accelerate the business. You will build various data and machine learning models that help us innovate different ways to enhance the customer experience. You will need to be entrepreneurial, wear many hats, and work in a highly collaborative environment across engineer, product, marketing and BI. We like to move fast, experiment, iterate and then scale quickly, thoughtfully balancing speed and quality. An ideal candidate will be an expert in the areas of machine learning and statistics who will have expertise in applying theoretical models in an applied environment. The candidate will be expected to work on numerous aspects of Machine Learning such as feature engineering, predictive modeling, probabilistic modeling, hyper-parameter tuning, scalable inference methods and reinforcement learning. We deal with HUGE volume of data, including clickstream, Alexa, Prime Video, and retail, so challenges will involve dealing with very large data sets and requirements on throughput. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. - Amazon.com Services LLC Job ID: A1627020",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T13:33:48.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 113000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}