{
  "job": {
    "title": "Senior Software Engineer, FlashBlade",
    "industry": "Computer Hardware,Computer Software",
    "description": "Since our founding in 2009, Pure Storage has empowered innovators to build a better world with data. In less than eight years, Pure reached $1B in sales, faster than nearly every enterprise company in history, and our incredible growth continues to outpace the competition.  Our mission? Give technologists their time back by delivering a modern data experience that empowers organizations to run their operations as a true, automated, storage as-a-service model seamlessly across multiple clouds.  The secret sauce? More than 3,000 team members (and growing!) around the world who join forces to invent the next big thing. And then the next one. If you, like us, say “bring it on” to exciting challenges that change the world, we have endless opportunities where you can make your mark. Since our founding in 2009, Pure Storage has empowered innovators to build a better world with data. In less than eight years, Pure reached $1B in sales, faster than nearly every enterprise company in history, and our incredible growth continues to outpace the competition.  Our mission? Deliver a simple, evergreen data platform that enables everyone to turn data into intelligence and advantage. The secret sauce? More than 3,000 team members (and growing!) around the world who join forces to invent the next big thing. And then the next one.  The world is experiencing a revolution driven by next-generation technology like AI, machine learning, virtual reality, quantum computing, and self-driving cars—all of which require unprecedented amounts of data. This sets the stage for Pure’s technology to grow exponentially in the coming years. If you, like us, say “bring it on” to exciting challenges that change the world, we have endless opportunities where you can make your mark. With the FlashBlade product, we are building a scale-out all-flash file and object store, designed for the modern world. To really understand how our customers work with data, we are deeply immersed in AI, modern backup, log analytics with Splunk and Elastic, data pipeline with Kafka, cluster computing with Spark, and many more use cases. With the ObjectEngine product we are looking to modernize data protection by driving to a new architecture of F2F2C (Flash to Flash to Cloud). If this describes you, let's talk! You can take a part in changing how the world works with data. Pure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.  Through our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.  And because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events. Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire. If you need assistance or an accommodation due to a disability, you may contact us at . If you're wondering how or why Pure collects or uses information you provide, we invite you to check out our . Some positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship. Pure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.  Through our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.  And because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events. Research shows that in order to apply for a job women feel they need to meet 100% of the criteria while men usually apply after meeting about 60%. You don't have to meet all the job requirements. If you believe you can do the job and are a good match, we encourage you to apply.  Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire.  If you need assistance or an accommodation due to a disability, you may contact us at . If you're wondering how or why Pure collects or uses information you provide, we invite you to check out our . Some positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:30:06.000Z"
  },
  "company": {
    "name": "Pure Storage",
    "link": "https://www.linkedin.com/company/pure-storage"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Mountain View",
    "region": "CA",
    "postal_code": "94040",
    "street_address": null,
    "latitude": 37.39008,
    "longitude": -122.08139
  }
}