{
  "job": {
    "title": "Senior Full-Stack Software Engineer, Machine Learning Platform",
    "industry": "Information Technology and Services,Computer Software,Automotive",
    "description": "We're Cruise, a self-driving service designed for the cities we love.  We’re building the world’s most advanced, self-driving vehicles to safely connect people to the places, things, and experiences they care about. We believe self-driving vehicles will help save lives, reshape cities, give back time in transit, and restore freedom of movement for many.  Cruisers have the opportunity to grow and develop while learning from leaders at the forefront of their fields. With a culture of internal mobility, there's an opportunity to thrive in a variety of disciplines. This is a place for dreamers and doers to succeed.  If you are looking to play a part in making a positive impact in the world by advancing the revolutionary work of self-driving cars, join us. The Machine Learning Platform team builds and supports the essential tools and frameworks for every machine learning engineer at Cruise. Our goal is to greatly accelerate the development cycle of machine learning models across the whole company, empowering machine learning engineers to focus on improving the car’s safety and performance, instead of worrying about their infrastructure. Our scope covers the whole lifecycle of machine learning at Cruise: feature processing, model training and deployment to vehicles. We care about the performance, ease of use and reliability of our products. We are driven by the success of our partner teams who rely on our work to build the most advanced driverless cars in the world. The Machine Learning Platform team is looking for a Senior Frontend Engineer to design and implement specialized ML experiment management and data visualization applications that accelerate the evaluation and improvement of machine learning models. Bonus points!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:58:04.000Z"
  },
  "company": {
    "name": "Cruise",
    "link": "https://www.linkedin.com/company/getcruise"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}