{
  "job": {
    "title": "Software Engineer, Apple Pay",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.    Are you passionate about building massively scalable services that surprise and delight? Do you have a natural curiosity for learning new technologies? If you answered yes to both questions, the Apple Pay Server engineering team wants to hear from you. Significant experience (5+ years) in designing, implementing & supporting highly scalable systems and services in Java, Scala and/or other JVM-based languages.  Experience with SQL, NoSQL or NewSQL technologies  Self-starter with strong customer and product focus  Able to communicate thoughtfully, using problem-solving skills and a learning mentality to build long-term relationships Apple Pay brought mobile payment to millions of customers and it’s just the beginning. We are looking for engineers who are equally comfortable working at the bits and bytes level and crafting state of the art objected-oriented web-services. Imagine the freedom of a startup but with the funding and focus of the most valuable company in the world.    Job duties include the following:    -  Architect and implement new features for Apple Pay   -  Write bullet-proof Java code (thread-safe, performant, object-oriented, and inherently testable)   -  Work directly with the business team to collaborate on current and future initiatives   -  Work directly with the iOS client team on feature definition and development   -  Design specifications and protocols to tackle novel problems   -  Support ongoing development efforts   -  Work on overall team’s efforts to fix bugs and diagnose existing issues   -  Embrace test-driven development   -  Unit tests are not optional on this team BS degree in computer science or equivalent field plus 3-4 years software development experience or MS degree plus 1-2 years software development experience, or equivalent Any of the following is an advantage:    Cryptography  JavaCard  EMV Payments  HSMs  Fintech experience   Payments experience    Role Number: 200265160",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:30:40.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 62600,
    "max_value": 86400,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}