{
  "job": {
    "title": "Machine Learning Engineer, Trust",
    "industry": "Hospitality,Internet,Leisure, Travel &amp; Tourism",
    "description": "Airbnb is a mission-driven company dedicated to helping create a world where anyone can belong anywhere. It takes a unified team committed to our core values to achieve this goal. Airbnb's various functions embody the company's innovative spirit and our fast-moving team is committed to leading as a 21st century company. Everyone at Airbnb thinks about trust, but our team obsesses over it daily. At the core of trust is safety, and thus we spend a significant amount of our time and energy keeping the community safe. The Trust Organization is responsible for protecting our community and platform from fraud while also ensuring our hosts, guests, homes, and experiences meet our high standards. We constantly work to fight against online fraud (such as chargebacks, compromised accounts, spam and scam in messages, fake inventory, etc.) as well as offline fraud (theft, property damage, personal safety, etc.). We also work on onboarding and screening of users, and think about complex topics like identity and reputation to ensure that every interaction with Airbnb helps build trust in us and our community. Trust Engineering is responsible for the technology vision and development of a complex stack that runs on every key interaction on the platform.  We’re looking for a seasoned Engineer to join our Foundational Modeling team that is responsible for a Machine Learning Platform, a core capability that enables the Trust product teams to build machine learning solutions to stop bad actors from doing bad things on Airbnb. As a Machine Learning Engineer, you help keep Airbnb users safe by working across diverse teams and systems to enable sophisticated safety strategies. You are eager to understand complex systems top to bottom and thrive working across technologies and codebases. Your contributions take a variety of shapes:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T00:00:00.000Z"
  },
  "company": {
    "name": "Airbnb",
    "link": "https://www.linkedin.com/company/airbnb"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}