{
  "job": {
    "title": "Cellular Software QA Engineer",
    "industry": "Consumer Electronics",
    "description": "Join the Wireless Technologies and Ecosystems (WTE) team and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product. 10+ years of validation experience in wireless and telecoms industry  Deep knowledge Cellular Radio technologies, protocols and procedures (5G NR, LTE, etc)  8+ years of hands-on experience with testing cellular technologies (5G, LTE, IMS etc)  Exposure to commercial test simulators and test systems such as: Anritsu, RS, Keysight call boxes for lab validation  Validated ability to lead a complete functional area of an application or product  Able to work independently and should be dedicated  Validated understanding of SQA methodologies & practices  Excellent communication & interpersonal skills  Comfortable with solving problems/debugging/reproducing issues  Scripting skills in any of the following: Perl, Python, Shell, JavaScript, Ruby  Thrive in a collaborative environment and can clearly communicate while expertly driving multiple projects across many teams  Obsessively hardworking and inquisitive, and seek to tackle everyday problems in innovative ways  Laser-focused on the smallest details that are important to our customers Apple’s Wireless Technologies and Ecosystems product software team is seeking a hardworking, highly motivated and focused engineer to develop new testing methodologies and establish division-wide standards for use. On this job, you will develop expertise in new domains and establish test methodology and develop test concepts to enable delivery of extraordinary quality. You will work on problem solving and evaluate solutions in different layers of the SW stack taking into account their completeness and impact to the system. As part of this team you have a very immediate impact on the user experience of Apple’s wireless devices worldwide. Bachelors in Electrical Engineering or Computer Science or equivalent    Role Number: 200262783",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T19:58:26.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 88600,
    "max_value": 142000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}