{
  "job": {
    "title": "Sr Server Software Engineer (Mobile Applications)",
    "industry": "Restaurants,Hospitality,Information Technology and Services",
    "description": "Topgolf Media is looking for a Sr Server Software Engineer to help design and develop server applications that support our mobile applications and interface with existing Topgolf technologies. You will be working with a small and close-knit team of engineers, designers and product managers to build the next generation of mobile products for Topgolf. Based in San Francisco, Topgolf Media creates and distributes advanced media content, enabling the Topgolf community to experience the best times of their lives. The division enhances in-venue golf games as well as creating experiences outside of the venues with apps, websites and virtual experiences. In addition, Topgolf Media cultivates relationships with global partners, sponsors and ambassadors to promote innovation within the Topgolf brand. Our goal is to create compelling experiences to engage Topgolf fans of all walks in new, innovative ways. www.topgolfmedia.com  Our Games  WGT Golf (www.wgt.com and mobile app stores) is the #1 free golf game with over 450 million virtual rounds played and 5+ million mobile downloads. WGT Golf features 24 famous virtual golf courses including Bandon Dunes, Pebble Beach® and St Andrews. WGT Golf runs the annual Virtual U.S. Open in partnership with the USGA, and has partnered with NBC's Golf Channel and David Leadbetter. WGT Golf offers a range of virtual golf equipment from leading manufacturers, including Callaway, Cleveland, Nike, Ping, Srixon and TaylorMade.  Equal Opportunity Employer  Topgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.  Topgolf Media does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf Media will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Media and will be processed accordingly without fee.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Topgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.  Topgolf participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:50:09.000Z"
  },
  "company": {
    "name": "Topgolf",
    "link": "https://www.linkedin.com/company/topgolf"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}