{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that . In addition, for the last five years we’ve been named in the . Experian is seeking a Data Scientist to play a key role within our Data Solutions Team in the Decision Analytics organization supporting Experian Rental Industry Solutions. Experian Rental Industry Solutions provides data and decisioning to the US rental housing market in support of the rental leasing life cycle seeking to help property management companies, leasing agents, and landlords identify the best candidates for units and properties they own and/or manage.  Examples of solutions that Experian provides currently include identity verification, credit reports and rental scores, along with data solutions such as RentBureau. The Data Solutions Team is responsible for using our extensive analytical expertise to craft the next generation of Analytics products and services as well as producing relevant thought leadership material.  If you have a passion for data, advanced analytic techniques, and problem solving then this is the role for you. In this position you’ll be able to apply your cutting-edge analytic skills to drive forward new product opportunities and to provide guidance on market trends. You will give presentations on your analytic findings to all levels at Experian and to Experian clients. You will work on and often lead cross-functional teams to achieve business objectives.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-09T23:57:46.000Z"
  },
  "company": {
    "name": "Experian",
    "link": "https://www.linkedin.com/company/experian"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Costa Mesa",
    "region": "CA",
    "postal_code": "92626",
    "street_address": null,
    "latitude": 33.663857,
    "longitude": -117.90476
  }
}