{
  "job": {
    "title": "Software Development Engineer, Telephony",
    "industry": "Consumer Electronics",
    "description": "Join Apple’s Wireless Software Engineer eSIM team and drive innovation that matters! We have shipped eSIM features in iPads, cellular watch and iPhone. We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you are passionate about writing code and would be interested in developing eSIM features for Apple’s Cellular Products, then we may have the job for you. The Wireless Technologies team is looking for a strong programmer to join our growing eSIM team. 2+ years of experience developing software in C/C++   Development experience with embedded systems   Proven experience in writing software for multi-threaded environments  Development experience of Telephony features for consumer products a plus  Thrive in a collaborative environment and can clearly connect with multi-functional teams  Hardworking and inquisitive, and seek to tackle everyday problems in innovative ways  Laser-focused on the smallest details that are meaningful to our customers  You are upbeat, adaptable, and results oriented with a positive attitude  You will join a hands-on development team that fosters creativity and generates novel solutions to deliver engineering perfection. Working as a part of an extraordinary development team, we are searching for a highly motivated software developer. In this position, you will have the opportunity to develop exciting features for Apple’s next generation products. You work will involve telephony, SIM, and protocol software. Your contributions will make a clear difference towards future iOS products. Bachelor’s degree in Computer Engineering, Computer Science or equivalent experience Experience crafting security solutions and designing quality modular software. Experience in embedded software engineering Experience with developing JavaCard applets for JavaCard OS or related software development experience for security products.    Role Number: 200237762",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:29:10.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 118000,
    "max_value": 200000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}