{
  "job": {
    "title": "Oracle Utilities Customer Cloud Solutions Sales Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Provides direction and specialist knowledge in applying the technology/application to client business. Facilitation of customer product/application understanding through presentations demonstrations and benchmarks; provision of support throughout the sell.  Join as a Principal Solution Engineer  Oracle is the #1 global provider of business software. With a market-leading presence in over 175 countries, we connect the biggest enterprises of today with the tools to compete in the digital economy of tomorrow. Join us and play an instrumental role in transforming the world of business. Description What You’ll Do  The Principal Solution Engineer provides Utility Industry expertise and credibility to the sales cycle. With a working knowledge of utilities customer engagement and Oracle Utilities Customer Experience Solutions the Solution Engineer supports solution development and demonstrations with customer, business case development and solution positioning. The ideal candidate will partner with sales executives to execute a comprehensive strategy for key deals. This person prepares and delivers compelling presentations and product demonstrations and engage with customers effectively. This person will work closely with colleagues across the company to drive complex deals to a successful result while developing relationships and processes that increase selling repeatability and scalability. Solution Engineers work at the intersection of product, marketing, sales, and delivery - where big promises become real technology deliverables for the utility industry. You have an opportunity to make a broad impact on how millions of people behave as energy consumers and how clients manage their operations and deliver for their clients. Your core responsibility is to understand customer challenges and deliver solutions leveraging Oracle’s modern Cloud platform and industry leading Utility CRM/CX (Sales, Service and Marketing), Billing and Meter to Cash applications.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T02:22:21.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}