{
  "job": {
    "title": "Remote! Principal Full Stack Developer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Are you a Remote! Principal Full Stack Software Engineer with a passion for building large scale full stack applications in React/PHP ( or Go/Node.js) ? If so please read on!  We are a SaaS company that is truly revolutionizing the way people learn in the medical space! We leverage education, technology and research to drive it all forward with the result of being one of the most widely used platforms globally. With a unique niche in EdTech we have a strong presence globally where our mission is creating technology that makes a difference in medicine and the way these individuals learn through our product!  Due to our continued success, we are seeking an experienced Principal Full Stack Developer React/PHP to join our fast growing team! If this sounds like a match for you pls apply or send your resume to Bianca.oscal@Optello.com we are actively interviewing !  Top Reasons to Work with Us What You Will Be Doing What You Need for this Position  Must Have: 5+ years of professional experience building large scale full stack applications What's In It for You So, if you are a Principal Full Stack Developer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Bianca.Oscal@Optello.com Bianca Oscal - Executive Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:26:23.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}