{
  "job": {
    "title": "Data Strategy Scientist",
    "industry": "Automotive,Consumer Goods",
    "description": "The Data Strategy Scientist role resides within the Decision Sciences & Analytics team and is a key player in providing operational support for the coordination, adoption, monitoring, and compliance of data governance standards and policies to support data science best practices. They will also develop and support methods to ensure the accuracy and integrity of data frameworks to enhance data access across the enterprise and shape future strategy for Decision Sciences & Analytics.  The Decision Sciences & Analytics team has a clear vision – use data to make better business decisions that increase customer satisfaction and loyalty. Working cross-functionally across the organization the Data Strategy Scientist will support our mission by defining data standards, ensuring the quality of our data, monitoring compliance, and ensuring the proper use of our data that positively influences business decisions and direction for Decision Sciences & Analytics.  The successful candidate will be a collaborator that is skilled in bringing insights from data to life. This is a new position, in a new team, with the unique opportunity to lay the foundation of how data and data driven decisions become a core element to VW Credit’s strategy. United States-Illinois-Libertyville United States-Virginia-Herndon – – –",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T16:22:56.000Z"
  },
  "company": {
    "name": "Volkswagen of America, Inc",
    "link": "https://www.linkedin.com/company/volkswagen-of-america-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Libertyville",
    "region": "IL",
    "postal_code": "60092",
    "street_address": null,
    "latitude": 42.282997,
    "longitude": -87.95334
  }
}