{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Position Title: Software Engineer Tapjoy is seeking a Software Engineer who will work closely with Data Scientists, Data Engineers and Ad Server Engineering teams to help productionize, scale and support Tapjoy's Optimization platform. We are looking for someone with experience working with vast amounts of data, service scaling and low-latency applications. Tapjoy is a leading mobile advertising and app monetization company. Our platform empowers advertisers to connect with over 1 billion monthly active users through value exchange advertising that drives awareness, engagement, and the metrics that matter most to their overall growth. Meanwhile, companies such as Scopely, Glu, Ludia, and many of the Top 200 grossing app publishers trust our platform to monetize their content, grow their audiences, and reward their users. Founded in 2007 and headquartered in San Francisco, Tapjoy is a global organization with offices in Santa Barbara, Boston, London, Beijing, Tokyo, and Seoul.  Tapjoy is an equal opportunity employer. We believe that diversity and inclusion lead to stronger, more innovative teams and better business results; we want to draw from the broadest talent pool possible and encourage qualified applicants. Tapjoy does not discriminate on the basis of sex, race, ethnicity, color, age, sexual orientation, gender (including identity and expression), disability (mental or physical), religion, national origin, citizenship, marital status, military or veteran status, or any other protected classification protected by applicable law; we will provide reasonable accommodations for qualified individuals with disabilities, and pursuant to applicable fair chance ordinances, we will consider for employment qualified applicants with arrest and conviction records.  For more information, please visit www.tapjoy.com",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T04:03:28.000Z"
  },
  "company": {
    "name": "Tapjoy",
    "link": "https://www.linkedin.com/company/tapjoy"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}