{
  "job": {
    "title": "Staff Software Engineer, Data Visibility &amp; Attestation (Security)",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Square builds common business tools in unconventional ways so more people can start, run, and grow their businesses. When Square started, it was difficult and expensive (or just plain impossible) for some businesses to take credit cards. Square made credit card payments possible for all by turning a mobile phone into a credit card reader. Since then Square has been building an entire business toolkit of both hardware and software products including Square Capital, Square Terminal, Square Payroll, and more. We’re working to find new and better ways to help businesses succeed on their own terms—and we’re looking for people like you to help shape tomorrow at Square. Asset management is a core tenet of Information Security, traditionally captured through hardware and software asset management. As the company grows, data increasingly becomes an important asset that requires active tracking and management in order to ensure we are building and maintaining appropriate data protection.  As a Tech Lead on the Privacy Engineering team, you will define the broad direction and future of the Data Visibility/Attestation group, which is focused on building out and continuously improving the accuracy of our data inventory as our systems continue to evolve in number and complexity. You will operate on the critical path of surfacing data risk on all Square products and business units, and will have a direct impact on the success of security and privacy of data at Square. In this role, you will closely work with many teams across Square, including other teams within security, as well as platform engineering, product engineering, data science, and counsel. Some qualifications you may have: As a bonus, you may have experience or interest in: We’re working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Square is a proud equal opportunity employer. We work hard to evaluate all employees and job applicants consistently, without regard to race, color, religion, gender, national origin, age, disability, veteran status, pregnancy, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.  We believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations to disabled applicants throughout the recruitment process. We encourage applicants to share any needed accommodations with their recruiter, who will treat these requests as confidentially as possible.  Additionally, we consider qualified applicants with criminal histories for employment on our team, assessing candidates in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. At Square, we want you to be well and thrive. Our global benefits package includes:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:07:06.000Z"
  },
  "company": {
    "name": "Square",
    "link": "https://www.linkedin.com/company/joinsquare"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 115000,
    "max_value": 218000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}