{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "Position Summary... What you'll do...  Walmart’s Centralized Data Science team is responsible for building and maintaining innovative data science solutions for Omni retail value chain . What you'll do...  Applied Business Acumen: Supports the development of business cases and recommendations. Owns delivery of project activity and tasks assigned by others. Supports process updates and changes. Solves business issues.  Data Source Identification: Understand the appropriate data set required to develop simple models by developing initial drafts. Supports the identification of the most suitable source for data. Maintains awareness of data quality.  Data Strategy: Understands, articulates, and applies principles of the defined strategy to routine business problems that involve a single function.  Analytical Modeling: Selects the analytical modeling technique most suitable for the structured, complex data and develops custom analytical models. Conducts exploratory data analysis activities (for example, basic statistical analysis, hypothesis testing, statistical inferences) on available data. Defines and finalizes features based on model responses and introduces new or revised features to enhance the analysis and outcomes. Identifies the dimensions of the experiment, finalizes the design, tests hypotheses, and conducts the experiment. Perform trend and cluster analysis on data to answer practical business problems and provide recommendations and key insights to the business. Mentors and guides junior associates on basic modeling and analytics techniques to solve complex problems.  Model Deployment & Scaling: Supports efforts to ensure that analytical models and techniques used can be deployed into production. Supports evaluation of the analytical model. Supports the scalability and sustainability of analytical models.  Code Development & Testing: Writes code to develop the required solution and application features by using the recommended programming language and leveraging business, technical, and data requirements. Test the code using the recommended testing approach.  Problem Formulation: Translates business problems within one's discipline to data related or mathematical solutions. Identifies what methods (for example, analytics, big data analytics, automation) would provide a solution for the problem. Shares use cases and gives examples to demonstrate how the method would solve the business problem.  Model Assessment & Validation: Supports model fit testing and statistical inferences to evaluate performance. Assesses the impact of variables and features on model performance.  Data Visualization: Generates appropriate graphical representations of data and model outcomes under guidance. Supports the understanding of customer requirements and designs data representations for simple data sets. Presents to and influences the team using the appropriate frameworks and conveys messages through basic business understanding.  Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by incorporating these into the development and implementation of business plans; using the Open Door Policy; and demonstrating and assisting others with how to apply these in executing business processes and practices. Minimum Qualifications... Option 1: Bachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 2  years' experience in an analytics or related field. Option 2: Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science,  Information Technology or related field. Option 3: 4 years' experience in an analytics or related field. Preferred Qualifications... Data science, machine learning, optimization models, Master’s degree in Machine Learning, Computer Science, Information Technology, Operations Research, Statistics, Applied Mathematics, Econometrics, Successful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, tensorflow, torch) Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-11T05:32:48.000Z"
  },
  "company": {
    "name": "Walmart",
    "link": "https://www.linkedin.com/company/walmart"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Bentonville",
    "region": "AR",
    "postal_code": "72716",
    "street_address": null,
    "latitude": 36.37187,
    "longitude": -94.20272
  }
}