{
  "job": {
    "title": "Data &amp; Applied Scientist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "The Modern Work & Security Insights team is looking for an experienced Data & Applied Scientist that questions prior assumptions and proactively seeks innovative solutions to meet our seller’s needs, sales leaders’ needs and executive needs - charting the story of the business in a connected way that helps drive the right behaviors from sellers, partners and leaders. The ideal candidate will have deep technical depth and experience leveraging statistics, data analysis, data science and visualization to drive business insights that lead to action and successful business outcomes. - ability to lead v-teams to work across multiple stakeholder groups with varying needs to build cohesive dashboards and tools to support our business understanding. Partnering with cross-company data and analytics teams to ensure robust and accurate data capture and continuous improvement of data available for both analytics and the wider business. - Critical to be able to listen to multiple stakeholder groups - understand sellers, partners and customers’ needs and how we can develop tools that will support how they sell and/or buy and use our solutions. - Ability to look beyond a set of individual KPIs to instead think about how we design our tools and dashboards to help guide our stakeholders through the customer journey - we need more than just a set of tables and charts, but instead, tables and charts that chart the path, tell the story of our business and give clarity to our stakeholders on the actions they need to take. - Experience working with data models to build insights in a user-friendly interface (i.e. Power BI, Tableau, etc.). A deep understanding of the structure and design elements used in building insights to create dashboard designs that support strategic business decision-making. Experience building data asset catalogs and data dictionaries to support the business. - Ability to effectively communicate business needs, dashboard/tool design and underlying data requirements to other developers and engineers to support our business goals. The ideal candidate must be dynamic, passionate, self-motivated, confident in working with multiple stakeholders and comfortable in a matrix organization. They need to be able to gain the trust and confidence of the stakeholders across the organization and be a visible driver who can drive results through influencing the work of others. Ability to work cross-functionally, building and maintaining trust with internal stakeholders.  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T11:44:30.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}