{
  "job": {
    "title": "Data Scientist - Instagram Shopping",
    "industry": "Internet",
    "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.  In this role, you will help to bring Facebook Inc.‘s Commerce strategy to life on Instagram by driving analytical work critical to informing and supporting the area’s short- and long-term success. The Instagram Shop Tab team is building a multi-brand shopping destination that is relevant and entertaining, focused on serving people who want to shop and buy on IG. The new tab (Instagram’s first new tab in its ten-year history) will be available to all users globally by the end of the year. We are looking for a candidate who is passionate about untangling complicated or ambiguous ecosystem-level problems, is ever-curious, and has a strong product sense. As an analytics leader, and given the role of the IG Shop Tab in the overall Family of Apps Commerce strategy, you would work with cross-functional partners and other data scientists on both long and short-term analyses, communicating findings and recommendations to some of the company’s executives. You will be expected to use data to provide meaningful recommendations and actionable strategies to key stakeholders, and develop best practices, including streamlining of data sources and related programmatic initiatives. Additionally, you will have a proven track record of thought leadership and impact in developing high quality analytics programs and working across functions to uncover and shape data-driven recommendations. The role will also require someone who is a strong communicator and is energized by cross-team collaboration. Previous e-commerce and/or consumer product experience preferred. Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-14T06:24:09.000Z"
  },
  "company": {
    "name": "Instagram",
    "link": "https://www.linkedin.com/company/instagram"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}