{
  "job": {
    "title": "Entry Level Data Analyst",
    "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
    "description": "wants every candidate to know we are always here to support your efforts. Indeed engagement is a priority for all Employees. No matter what issue you are facing, either it\"s a job search or upskilling your It portfolio, assistance in cracking interviews or anything, you can always count on a member of Synergistic IT to be there for you.  We at Synergistic IT understand the problem and that\"s why for the past 10 years we have helped thousands of candidates get jobs at technology clients like apple, google, Paypal, western union, bankofamerica, visa, etc to name a few. We have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, IT enthusiasts, Python/Java developers, Data analysts/ Data Scientists. Recent IT Graduates looking to make their careers in IT Industry Candidates having basic knowledge or with one or two years of experience in JAVA, C++, Core JAVA. Candidates looking to upskill/enhance their IT skills. Candidates who are serious about their future in the IT Industry and have set big goals for themselves. Candidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. Preferred skills: NLP, Deep Learning, Data visualization, Scala, Django No third party candidates or c2c candidates To apply for this position, please apply to the posting No phone calls please . Shortlisted candidates would be reached out",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:16:02.000Z"
  },
  "company": {
    "name": "SynergisticIT",
    "link": "https://www.linkedin.com/company/synergisticit"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}