{
  "job": {
    "title": "Industry Solutions Architect - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "As a Solutions Architect you will be a leader through collaborating, developing, reviewing and implementing program specific technical strategies and solutions led by you with our healthcare and life science customers and account teams. You will gather requirements to help define a “To-Be” state / solution for your Customer. You will work closely with the Account Sales Reps, Pre-Sales Solutions Engineers and members of Leadership team in developing complex and transformational technical strategies & solutions.  In the Solutions Architect role, you will use Systems Engineering / Architecture skills, knowledge of VMware’s and other Commercial Cloud solutions (e.g., AWS, Microsoft Azure, Google Cloud Platform), and knowledge of Healthcare IT Enterprise requirements to provide a program tailored technical solution. Building a solution may include activities such as executing workshops, conducting client interviews, secondary research, guidance from the Account Team, working with specialists, and product managers. In the Solutions Architect role, you will be acting as a lead technologist and expected to have a broad understanding of technology. In the Solutions Architect role, you will use Systems Engineering / Architecture skills, knowledge of VMware’s and other Commercial Cloud solutions (e.g., AWS, Microsoft Azure, Google Cloud Platform), and knowledge of Healthcare IT Enterprise requirements to provide a program tailored technical solution. Building a solution may include activities such as executing workshops, conducting client interviews, secondary research, guidance from the Account Team, working with specialists, and product managers. Sales Business Development Business Leadership Full Time 2021-07-07  VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.  Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:36:00.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}