{
  "job": {
    "title": "Senior Cloud/ Big Data Engineer",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.   Are you passionate about developing data platforms at scale? Do you love the idea of solving a new business, technical problem every other day with open source technologies? Are you passionate about big data in cloud? If so, Apple’s Global Business Intelligence (GBI) team is looking for highly motivated, detail oriented, technical savvy, ambitious professionals who like to think outside the box! We re looking for 4+ years of experience in professional programming experience   We are seeking a strong foundation in Computer Science fundamentals such as data structures and algorithms is required   We want you to have experience with Java, scala or Python programming language   We want you to have experience working in Cloud   Experience with Hadoop, Hive, Spark is a plus    Passionate about Big Data technologies   Working knowledge of the full SW development lifecycle   Proven ability to develop and ship high quality software products The GBI Big Data Engineering team in responsible for building tools and frameworks that many application depend on to analyze Apple’s big data. We use the latest big data technologies. We’re looking for someone who is passionate about working in team to build platform which can live up to Apple’s high standards. As a part of our team you’ll be responsible for designing and developing well engineered creative solutions to tackle our business needs. You’ll be working at the framework and application level.   We seek a self starter, visionary person with strong leadership capabilities.   Ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.   You will interact with many other group’s internal team to lead and deliver best-in-class products in an exciting fast-paced environment.    Dynamic, smart people and inspiring, innovative technologies are the norm here. Will you join us in crafting solutions that do not yet exist? BS CS, BS MIS or equivalent Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.   We at Apple we are committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Learn more.    Role Number: 200263540",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:29:44.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}