{
  "job": {
    "title": "System Reliability Engineer",
    "industry": "Financial Services,Information Services,Information Technology and Services",
    "description": "As a Network System Reliability Engineer, you will be part of a team that supports our global data distribution servers. You'll work closely with Software Developers, System & Network Engineers and support teams for planning, implementation and reliability of our global Network infrastructure. Key aspects of this role also include planning for compute capacity, rolling out software and using the latest automation technologies to provide standardized processes and troubleshooting tools to our operation teams. You will work with our partners to ensure that we are aligned with business strategy and best practices. Apply if you think we're a good match. We'll get in touch to let you know what the next steps are.  Bloomberg is committed to diversity. It drives our innovation. At Bloomberg, you'll have the opportunity to go above and beyond and to take risks. You'll be a part of an organization that is entering new markets, launching new ventures, and pushing boundaries. Our ever-expanding array of technology, data, news, and media services champions innovation and empowers clients -- and offers nearly limitless opportunities for career growth.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We bring out the best in each other.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T06:08:00.000Z"
  },
  "company": {
    "name": "Bloomberg LP",
    "link": "https://www.linkedin.com/company/bloomberg-lp"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}