{
  "job": {
    "title": "Software Engineer II - Data Engineering",
    "industry": "Information Technology and Services,Internet,Market Research",
    "description": ": Software Engineer II - Data Engineering : Reston, VA or Remote The Software Engineer II delivers backend software solutions to internal and external clients. This includes the design, modification, development, and implementation of software programming applications. Additionally, the Software Engineer II may lead and direct the work of others. A wide degree of creativity and latitude is expected, as well as an understanding of business needs and requirements. At Comscore, were pioneering the future of cross-platform media measurement, arming organizations with the insights they need to make decisions with confidence. Central to this aim are our people who work together to simplify the complex on behalf of our clients & partners. Though our roles and skills are varied, were united by our commitment to five underlying values: Integrity, Velocity, Accountability, Teamwork, and Servant Leadership. If you are motivated by big challenges and interested in helping some of the largest and most important media properties and brands navigate the future of media, wed love to hear from you.  Comscore (NASDAQ: SCOR) is a trusted partner for planning, transacting and evaluating media across platforms. With a data footprint that combines digital, linear TV, over-the-top and theatrical viewership intelligence with advanced audience insights, Comscore allows media buyers and sellers to quantify their multiscreen behavior and make business decisions with confidence. A proven leader in measuring digital and set-top box audiences and advertising at scale, Comscore is the industry’s emerging, third-party source for reliable and comprehensive cross-platform measurement. To learn more about Comscore, please visit Comscore.com. : We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, disability status, sexual orientation, gender identity, age, protected veteran status or any other characteristic protected by law.  To comply with federal law, Comscore participates in E-Verify. Successful candidates must pass the E-Verify process after hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T22:17:16.000Z"
  },
  "company": {
    "name": "Comscore, Inc.",
    "link": "https://www.linkedin.com/company/comscore"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Reston",
    "region": "VA",
    "postal_code": "22096",
    "street_address": null,
    "latitude": 38.960186,
    "longitude": -77.3545
  }
}