{
  "job": {
    "title": "Data Scientist- Research Technology",
    "industry": "Financial Services,Investment Banking,Investment Management",
    "description": "Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries.  As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture. Technology works as a strategic partner with Morgan Stanley business units and the world's leading technology companies to redefine how we do business in ever more global, complex, and dynamic financial markets. Morgan Stanley's sizeable investment in technology results in quantitative trading systems, cutting-edge modeling and simulation software, comprehensive risk and security systems, and robust client-relationship capabilities, plus the worldwide infrastructure that forms the backbone of these systems and tools. Our insights, our applications and infrastructure give a competitive edge to clients' businesses—and to our own Morgan Stanley Research Technology is looking for a data scientist to help with conducting advanced data analysis and develop Machine Learning and Artificial Intelligence models using various Analytical and Big Data tools. The role requires the candidate to work independently with Research business and vendors on analyzing and defining problem statements, and work closely with development teams on designing and implementing solutions and managing the delivery of various products. Jul 29, 2021 Americas-United States of America-New York-New York Master's Degree Data Management Full Time Vice President",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T16:49:44.000Z"
  },
  "company": {
    "name": "Morgan Stanley",
    "link": "https://www.linkedin.com/company/morgan-stanley"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 79100,
    "max_value": 132000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}