{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "SO, WHO ARE WE?  Patron Technology empowers event organizers to take control of their entire event experience with our technology solutions. Using our powerful ticketing, experiential marketing, mobile apps, and cashless products, organizers transform how audiences experience their events, drive nonstop engagement, and reach new audiences around the world. That’s why iconic brands like New York Comic Con, Coachella, Museum of Ice Cream, NHL, and Dreamforce use our suite of integrated event technology to power their events.  Sounds interesting? Let’s talk.  WHY DO WE NEED YOU? , a product of Patron Technology, is actively seeking a Software Engineer with a passion for solving unique problems, wearing many hats, and working in a fast paced environment. The Software Engineer's job duties will include working with a team of developers to expand the ShowClix ticketing and event management platform. EXPERIENCE & SKILLS: BONUSES: LEARN MORE!  We offer medical, dental, vision, generous PTO, 401 K Savings plan, paid parental leave (following 12 months of continuous employment), and more.  For more information on Patron Technology’s solutions visit our website at ShowClix is a product of Patron Technology. ShowClix is a fast-growing, full-service event technology company that handles ticket sales, marketing, and on-site operations for events around the world. Our partners include fandom and consumer conventions, live music venues, museums, attractions, and festivals. Each of our team members is passionate about live events and innovative technologies.  Powered by JazzHR  3odbTN0Kwx",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T07:07:05.000Z"
  },
  "company": {
    "name": "Patron Technology",
    "link": "https://www.linkedin.com/company/patron-technology"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}