{
  "job": {
    "title": "Sr. Site Reliability Engineer - Site Reliability Engineering",
    "industry": "Consumer Electronics",
    "description": "What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented. Meet the reinventors: The Apple TV Services teams created and manage the Apple TV app as well as tvOS, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, these teams also manage one of the most exciting new realms at Apple: They bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. And they’ve engineered it so Apple TV+ can be enjoyed not only on Apple devices, but also directly on many new televisions and third-party streaming devices.     To deliver Apple-level quality on a global scale, these engineers employ talent and tools to smoothly ingest and process a wide array of media assets. They work cross-functionally to handle video flow from content ingestion, playback, transcoding, and virtually everything else it takes to make the experience as seamless as possible. Join them to see what else is possible.     Areas of work include macOS/iOS Engineering, Full-Stack Engineering, Front-End Engineering, Back-End Engineering, Quality Engineering, Machine Learning Engineering, Data Science, Data Engineering, Site Reliability Engineering, Commerce Engineering, and Engineering Project Management. 2-5+ years of managing large scale web services in a *nix environment  Cloud and on-prem networking experience  Load balancer experience  Fluent in a scripting language like Python or shell  Experience with configuration management automation (Puppet, Chef, Ansible, Salt)  Monitoring and log mining experience  Container platform(s)  Cloud architecture experience  DR architecture and testing  Experience deploying and supporting java applications  Deep experience with deploying/managing Kubernetes and/or Spinnaker (Helm, OPA, Networking) * Engage with engineering team to improve services from design to deployment to operation by building in DR, security, performance and reliability    * Experience building and delivering self-healing platforms and services via automation   * Real passion for quality and automation (automate the manual stuff)    * An ability to understand large complex systems and a passion to constantly improve environments    * Set priorities and work efficiently in a fast-paced environment    * Demonstrated ability to deliver results on time with high quality and attention to detail    * Strong interpersonal skills BS in engineering, computer science or other technical disciplines (or equivalent experience) plus 2-5+ years of related experience    Role Number: 200241882",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-21T14:34:49.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 111000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}