{
  "job": {
    "title": "Software Test Engineer",
    "industry": "Hospital &amp; Health Care",
    "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries. The key to successful treatment and full recovery is often fast, accurate diagnosis. Abbott’s life-changing tests and diagnostic tools provide insights that enable smarter, faster decisions and transform the way the world is managing health.  Our pioneering technology spans the world of healthcare operations — with medical diagnostic instruments, tests, and informatics solutions for hospitals, reference labs, blood centers, emergency departments, physician offices and clinics.  Our location in currently has an opportunity for a Primary function is to test software for a blood screening system processing Immunoassays. Participates in a team-oriented environment to develop requirements and design for user interface, business rules, data management, or embedded system control applications, in addition to ensuring requirements and design are tested. At Abbott, you can have a good job that can grow into a great career. We offer: www.abbottbenefits.com  Follow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.  Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-12T00:00:00.000Z"
  },
  "company": {
    "name": "Abbott",
    "link": "https://www.linkedin.com/company/abbott-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 52100,
    "max_value": 113900,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Lake Bluff",
    "region": "IL",
    "postal_code": "60044",
    "street_address": null,
    "latitude": 42.279682,
    "longitude": -87.85427
  }
}