{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
    "description": "Eccalon provides global solutions to the most challenging technological issues of the 21st-century, and our evolving portfolio spans five major markets: Defense, Aerospace, Intelligence, Professional Sports, and Health & Life Sciences. Visit our website here. Eccalon's Executives foster a supportive work environment allowing our teams to thrive, and have a fierce dedication to innovation, security, and people. Our culture is built on inclusion, teamwork, trust, and we are committed in offering career advancement opportunities to all employees. Encouraging a healthy and balanced life, we offer an extensive benefits package to support the wellness of our employees and their families. You will be joining a team of innovators, working with cutting edge technologies, supporting mission critical projects, and making an impact. The Machine Learning Engineer will be an essential member of Eccalon's Machine Learning R&D Team, where we engineer large tailor-made systems to solve complex data-related problems from many domains. At Eccalon, the projects we support often require solutions that utilize the latest and the best from Deep Learning/Machine Learning research. We support advanced projects in both data constrained and data rich settings. Qualified candidates should be driven and be able to help craft these systems as a part of our R&D team. Candidates are expected to be familiar with the motions of a classical Machine Learning workflow, and support the team with some of the following tasks: On the engineering side of development, the Machine Learning Engineer will have the ability to be hands-on by: Prior project experience combining two or more of the following in a production setting: Eccalon provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.  This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T00:00:00.000Z"
  },
  "company": {
    "name": "Eccalon, LLC",
    "link": "https://www.linkedin.com/company/eccalon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Hanover",
    "region": "MD",
    "postal_code": "21098",
    "street_address": null,
    "latitude": 39.19298,
    "longitude": -76.72437
  }
}