{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "At Actuate, we make the world safer by turning any camera into a smart camera.  We help organizations manage the transition from traditional burglar alarms and human guards to smart AI-powered security.  Our software-only AI analyzes data from existing security cameras in real-time to detect threats such as weapons, intruders, crowds, and where people travel in any environment. The system acts as an end-to-end security camera management system that enables onboarding and management of cameras as well as instant alerts and analytics that allow organizations to pinpoint problems without collecting any personally identifiable information.  We leverage cutting-edge computer vision algorithms for object detection on a hyper-scale cloud backend, and we provide analytics to our customers without collecting any personally identifiable information.  We're looking for a Data Scientist that wants to focus on deep learning computer vision systems. The focus of the role is to deeply understand existing performance data and draw conclusions on how we can dramatically improve the performance of production AI models, proposing and executing on model improvements. You'll build and maintain cutting-edge AI systems such as intruder- and weapon-detection models and defense systems.  We're a Post-Series A company funded by Tribeca Venture Partners and Scribble VC, and we're looking for people who want to help grow the business quickly. If you want to help build a company from the ground up and develop cutting-edge technology to make the world a safer place--without invading privacy--we'd love to hear from you. New York City Powered by JazzHR  aefh28nDM7",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-28T07:17:45.000Z"
  },
  "company": {
    "name": "Actuate",
    "link": "https://www.linkedin.com/company/aegissystemsai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}