{
  "job": {
    "title": "Associate, UiPath",
    "industry": "Management Consulting",
    "description": "68936 - 31 Innovate. Collaborate. Build. Create. Solve. The KPMG Digital Lighthouse is KPMG's award-winning Analytics & AI Center of Excellence recognized by clients and leading analyst firms in the US and globally. The KPMG Lighthouse is a curation of specialized technical capabilities and domain experts working across the digital landscape: applied data science, AI, data engineering and insights, software engineering, automation, and big data. Here, you'll be an important part of our high-energy, unique, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. Our technology-agnostic approach enables us to scale up or down and integrate across leading platforms .  KPMG is currently seeking an Associate in Digital Lighthouse for our Consulting practice. KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T22:49:32.000Z"
  },
  "company": {
    "name": "KPMG US",
    "link": "https://www.linkedin.com/company/kpmg-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}