{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Embark Trucks is a leading self-driving truck company bringing autonomous freight mainstream. We have raised $117m by partnering with Tiger Global ($70m Series C) and Sequoia Capital ($30m Series B) to help grow our team and introduce our technology to the public. Currently, we move freight daily between LA and Phoenix using our purpose-built transfer hubs. We have aligned ourselves with truck manufacturers , shippers, and carriers to integrate our technology into the freight ecosystem, pursuing a business model where fleets own and operate our trucks. This is an incredibly exciting time for autonomous vehicles and our team is looking to grow.  Our deep learning team focuses on developing systems that sense and perceive the world around our self-driving truck. Within our deep learning team, you will focus on optimizing deep learning algorithms into production-ready self-driving perception systems. When you apply, address the application to Kiana and let me know why you want to join our team. CNBC - Our Partner Development Program  Forbes - The Embark Universal Interface  Navigating Highway Work Zones with the Embark Driver  Forbes - 70 Million Dollar Series C  Video - Day in the life of a self-driving truck  30 Million Dollar Series B led by Sequoia  At Embark we celebrate diversity and are committed to creating an inclusive environment for all employees. Embark provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.  San Francisco, CA /  Engineering – Perception /  Full-time",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T06:29:35.000Z"
  },
  "company": {
    "name": "Embark Trucks",
    "link": "https://www.linkedin.com/company/embarktrucks"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 94400,
    "max_value": 203000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}