{
  "job": {
    "title": "Software Engineer, Apple Pay",
    "industry": "Consumer Electronics",
    "description": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. You bring passion, and dedication to your job and there's no telling what you could accomplish.   We are building the next generation systems powering Apple Pay. Working alongside a talented team of engineers our initiative is to build the strategic elements of the Apple Pay stack, enabling first to market features that differentiate our products. 10+ years of professional development experience  Significant experience (5+ years) in designing, implementing & supporting highly scalable systems and services in Java, Scala and/or other JVM-based languages  At least 4 years experience with SQL, NoSQL or NewSQL technologies (see Additional Requirements below)  Self-starter with strong customer and product focus  Ability to communicate thoughtfully, leveraging problem-solving skills and a learning mindset to build long-term relationships We are looking for a team member with a strong foundation in computer science theory and industry experience. In this role, you will design, develop, and deliver components of a distributed system that is key to the Apple Pay stack.   You will have a proven ability to solve problems, interest in continuous learning and digging deep into the domain when necessary.    Job functions include:    -  Cross-functional collaboration throughout the entire software lifecycle  -  Scoping, design, and implementation of scalable, resilient distributed systems  -  Participating in design sessions and code reviews with peers to elevate the quality of engineering across the organization BS or MS in Computer Science or related technical field, equivalent work experience will be considered Any of the following is an advantage:  Practical experience with CockroachDB, Cassandra, FoundationDB, DynamoDB  Public cloud platforms (AWS, GCP, etc)  Deployment experience using Docker and Kubernetes  Relational data modeling & practical experience with RDBMS (Oracle, Postgres, MySQL etc)  Practical experience with Apache Kafka  Fintech experience  Payments experience    Role Number: 200266149",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-15T16:22:12.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 62600,
    "max_value": 86400,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}