{
  "job": {
    "title": "Software Engineer III",
    "industry": "Computer Software",
    "description": "RMS looking for a Software Engineer to be part of a team responsible for designing and developing the critical business applications in the Core Products suite. The Software Development group focuses on developing and building cutting edge, high-performance enterprise software solutions that deliver risk quantification tools to our 400+ clients worldwide.  You will use best-of-breed technology from both established vendors such as Oracle Java as well as open source technology. As a Software Engineer, you will have the opportunity to play a key role in designing, developing, and innovating together as you bring your considerable software engineering skills to our dynamically growing organization. There’s a 5% chance that a hurricane will cause $60 billion of insured losses next year and a 1% chance an earthquake will cause $50 billion of insured loss in the next 12 months. At RMS, we build the simulation models that allow insurers and investors to understand portfolio risks due to catastrophes: natural catastrophes (hurricane, earthquake, flood), terrorism, pandemic, and changes in life expectancy.  We are one of the most exciting firms you’ve probably ‘never’ heard of, unless you’re one of our hundreds of clients in the (re)insurance, banking or hedge fund sector. We lead an industry we helped pioneer and ultimately our work makes a true impact on the world at large. How we understand and manage risk affects everybody and our passion is nothing less than creating a more resilient world through a better understanding of catastrophic events.  We are evolving our vision by delivering future solutions in the cloud, releasing in 2016 a cutting-edge risk management platform ‘RMS(one)’ for the global risk market. RMS(one) will create a holistic and integrated view across the enterprise with one platform for all models, all points of view, and all data. All will be run as equal partners on RMS(one).  To find out more, visit Or follow us on Facebook, LinkedIn or @rmsjobs on Twitter. www.dhs.gov/E-Verify",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-11T23:42:28.000Z"
  },
  "company": {
    "name": "RMS",
    "link": "https://www.linkedin.com/company/rms"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Newark",
    "region": "CA",
    "postal_code": "94560",
    "street_address": null,
    "latitude": 37.540813,
    "longitude": -122.033394
  }
}