{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Terminus is the only account-based engagement platform built to deliver more pipeline and revenue through multi-channel account-based marketing (ABM). The platform, Terminus Engagement Hub, connects the first and third-party data needed to understand both customers and prospects, with the most robust suite of engagement channels—including ads, chat, email, and web—available. Terminus powers multi-channel ABM for thousands of brands globally including DHL, G2, Outreach, and TripActions. Terminus is proud to be a G2 leader in ABM for 13 consecutive quarters. Visit terminus.com to learn more or connect with us on Twitter and LinkedIn .  Terminus is seeking an accomplished to help us build an industry leading Account-Based Marketing platform that allows B2B marketers to do ABM at scale. This role will be pivotal in helping our teams build, scale and deliver best-in-class ABM platform on the market to our customers. This will include working with third-party data and integrations, ETL jobs, our data platform, as well as a variety of our other services which require experience in, but not limited to, APIs, messaging and automation.  Most importantly, we are looking for engineers that exemplify our core values: positive, supportive, and self-starting. Like us, we want you to be excited every day about working with this team and building great software. We are passionate about delivering high-quality code and providing our customers with features that they need and love.  As a fast growing startup, Terminus offers an incredible opportunity for a senior software engineer to learn, grow personally and professionally, and be part of building our company and culture. Diversity and inclusion are essential values at Terminus. We believe we do our best and most impactful work when we are a diverse, inclusive and equitable organization. We're proud to recruit and hire talented people from a wide variety of backgrounds and experiences. We do not discriminate on the basis of race, color, national origin, gender, religion, sex (including pregnancy, sexual orientation, gender identity or transgender status), age, or disability.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:27:53.000Z"
  },
  "company": {
    "name": "Terminus",
    "link": "https://www.linkedin.com/company/terminus-account-based-marketing"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}