{
  "job": {
    "title": "Senior Design Researcher",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At Oracle, we’re rebooting what design is for our entire company, creating a design-led culture that will put users and their needs at the center of our product development process, and transform the way our customers work on a global scale. We’re looking for a passionate Design Researcher to help us in our mission to create a state-of-the-art consumer-grade enterprise experience that reimagines and informs the future of modern work our users.  You will join a small but mighty Design Research group that is bringing deep empathy to understand what our customer and end-users need when using our products, understand the challenges people face in achieving their goals, leverage customers to learn and build confidence in the design direction we are pursuing and tell an inspiring story of the insights and opportunities we have to make our enterprise products purposeful and differentiated. In addition, the Qualitative Research group is embedded within the larger Research organization and partners closely with Data Scientists to investigate the reasons and motivations behind the behavioral patterns we see in our big data set. Our vision is to provide an integrated viewpoint of both scale and in-depth understanding of every individual using Oracle applications for their work. In short, we are starting a mini revolution of being data and customer obsessed and looking for someone who is excited to join us in this mission! Oracle Design is a team of innovators, designers, researchers, data scientists, prototypers, content creators, and technologists that have come together to take Design to the next level. We are reimagining the UX of over 300 enterprise cloud applications in the field of Human Resources, Finances, Supply Chain, Manufacturing, Marketing, Commerce, Health Care, Education, Government, and so much more. At the brink of a cultural transformation, you will have tremendous opportunities to bring your best, grow, and develop as a UX professional. While our goal is simple (make work more enjoyable for the users of our software), the process of enabling that intersects with rapidly developing areas of technology such as Artificial Intelligence, Data Science and Machine Learning, Conversational UX, and more. Oracle Design Studios are all over the world (US, Mexico, Canada, Bucharest, India); we are looking for curious and collaborative people that are passionate to work together and make work simpler and streamlined for millions of people out there. Responsible for creating, evaluating and modifying prototypes to support evolving hardware and software application development.  As a member of the User Experience team, you will develop and apply software design/usability processes in the investigation of technical problems. May develop user profiles, with emphasis on human error control, display issues, visual interaction, physical manipulation and task and objective analyses. Provide product usability, evaluation and support to product development teams, including the analysis and investigation of applications/systems including tactile methods, visual graphics, web, multimedia, voice response and conversational user interaction. May assist in developing design concept and implementation, providing input on user design considerations. May produce specifications describing user needs and internal structures for product in development.  Duties and tasks are varied and complex utilizing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. Typically four years of software engineering or related experience needed. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:12:22.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}