{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Financial Services,Hospital &amp; Health Care",
    "description": "McKesson Corporation is a Fortune 8 company and is one of the largest providers of healthcare supply chain management solutions, retail pharmacy, medical & pharmaceutical supplies, healthcare technology, community oncology and specialty care in the United States with revenues of $231 billion in 2020. The company was founded in 1833 by John McKesson and Charles Olcott in New York with a focus on importing and wholesaling pharmaceutical products. United by our ICARE shared principles, McKesson's 80,000 employees work together every day to make better care possible around the globe - one product, one partner, one patient at a time. We are seeking a to join our team in . At McKesson, we rely on data insights and intelligence to power our systems and solutions. We're seeking an experienced data scientist to understand our business and data, ask the right questions and deliver relevant insights to help the business grow and operate more efficiently.  Our ideal team member will have the mathematical and statistical proficiency, but also a natural curiosity to learn and adapt. As you mine, interpret, and clean our data, we will rely on you to ask questions, connect the dots, and uncover opportunities that lie within-all with the ultimate goal of realizing the data's full potential. The ideal candidate is adept at using large data sets to find opportunities using a variety of data mining/data analysis methods and tools, building and implementing models, leveraging ML techniques/algorithms and creating/running simulations. They must be comfortable working with a wide range of stakeholders and functional teams. Degree or equivalent and typically requires 2+ years of relevant experience. General Office Demands  Must be authorized to work in the US We take pride in our culture of connection and believe in a workplace where everyone can be their full, authentic self. We welcome and encourage veterans, individuals with disabilities and others with diverse perspectives to join our growing team. Your unique perspective and experience are valuable assets that can translate into a rewarding career path with us. Apply to join our team and help shape the future of healthcare! All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status.Qualified applicants will not be disqualified from consideration for employment based upon criminal history.  McKesson is committed to being an Equal Employment Opportunity Employer and offers opportunities to all job seekers including job seekers with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, please contact us by sending an email to McKessonTalentAcquisition@mckesson.com . Resumes or CVs submitted to this email box will not be accepted.  Current employees must apply through the internal career site.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-04T00:00:00.000Z"
  },
  "company": {
    "name": "McKesson",
    "link": "https://www.linkedin.com/company/mckesson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 97700,
    "max_value": 135000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}