{
  "job": {
    "title": "Data Scientist - Creator Business Analysis",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "The Marketplace team builds Spotify's content platform and creator products. Our content platform ingests, understands, and safeguards the world's audio. Our creator products - Spotify for Artists, Soundtrap, and SoundBetter - enable artists and their teams to create music and connect with collaborators, in an effort to grow and monetize their audiences.  As one of the teams within Marketplace, Creator Business Analysis partners closely with R&D. We are responsible for ensuring our teams build the highest value products to deliver back towards the music industry. We do this by evaluating new and emerging business ideas, business models and pricing strategies. As a Data Scientist on our team, you will help analyze economic, product and business problems using analytics. You will tackle complex problems in order to develop a behavioral understanding of customer needs, as well as to forecast and predict the value that our tools deliver. In doing so, you will have a lasting impact on bringing Spotify’s marketplace vision to life. #remote  Spotify is an equal opportunity employer. You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what’s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It’s in our differences that we will find the power to keep revolutionizing the way the world listens.  Spotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world’s most popular audio streaming subscription service with a community of more than 345 million users.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-23T21:35:26.000Z"
  },
  "company": {
    "name": "Spotify",
    "link": "https://se.linkedin.com/company/spotify"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}