{
  "job": {
    "title": "Data Scientist (AI/ML)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Who is Wyze?  Come and be a part of what GeekWire calls a top 100 “most popular and trending” Pacific Northwest tech company at one of Built-in-Seattle’s “100 Best Places to work in Seattle 2021”Wyze’s mission is to make great technology accessible to everyone because we believe that when great technology is accessible, curiosity thrives! Founded just over three years ago, Wyze started out as a smart camera company, has since branched out into the entire smart home ecosystem, and recently raised $15M in its latest funding round.  Our offices are based in Kirkland, WA, an outstanding city 10.3 miles east of downtown Seattle and nestled around beautiful Lake Washington! We also have offices in Beijing and Shenzhen, China!  At the announcement of the pandemic reaching US borders, Wyze employees quickly adapted to WFH setups and we, as well as any new hires, will continue to thrive from the safety of our homes until we can make a safe return to work in our new, COVID-conscious office space.  This role is based full-time in Kirkland, Washington and we are happy to help new folks relocate to this wonderful, tech-savvy city! If you are passionate about AI + IoT and our products and mission, and are passionate in applying your skills to solve customer problems in a fast-growing startup, this is the right opportunity for you. IoT is a perfect area for landing AI technologies, and Wyze provides the unique opportunity for landing AI technologies into products used by millions of users which is still growing at a fast pace. If you are a strong data scientist with a background in applied mathematics, statistics or computer science, and are passionate in applying your skills to solve customer problems in a fast-growing startup, then this is the right opportunity for you. IoT is a perfect area for landing AI technologies, and Wyze provides the unique opportunity for landing AI technologies into products with millions of users which is still growing at a fast pace. As a Data Scientist, you will help to solve a variety of technical challenges. Since this is an early-stage effort in a startup environment, you will play an active role of translating business requirements into elegant and beautiful solutions and dig into abundant service data and real user feedback to distillate business insights to facilitate our growth in partnership with other passionate people in the team. When you join the team, we guarantee that you will learn a ton, have fun and make a positive impact on millions of users. You will work with a team of highly skilled and motivated scientists and engineers, with the mission to build smart living for everyone, using machine learning and deep learning and solving problems in computer vision, sound detection, and speech recognition. As part of your job, you will collect the requirements, define the problems, design the algorithms, conduct in-depth data analysis and provide data-driven insights to drive our feature iteration and experience improvement. You Already Have These Qualifications and Love What You Do: Wyze has a full benefits package through Premera Blue Cross. This includes Medical, Dental, Vision, Basic Life Insurance, Voluntary Life Insurance, EAP, Short-term disability, Long-term disability, FSA, and Daycare FSA. Employee premiums will be paid 100%, and 80% paid premium for dependents.  10 Holidays - 6 set holidays and 4 Floating Holidays for you to use however you choose  15 days of PTO every year  Additional Wyze anniversary vacation days  9 sick days/mental health days per calendar year  Principal 401k Plan - there is no company match at this time  Wyze employee product perks: Wyze employees receive Wyze products as the products are released (new employees will receive a package with all of our current Wyze products)  Employees will also receive Wyze software services once they are launched  Rosetta Stone reimbursement if you'd like to learn Mandarin  $50 a month reimbursed as a technology stipend - taxes apply  If this sounds too good to be true and you are ready to be part of #teamwyze, then we want to hear from you! Please send us your resume and/or detailed LinkedIn profile and tell us a little about yourself with a cover letter that showcases some of the outstanding things you can do and how you feel they could apply to our vision and projects here at Wyze!  We will ensure individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation at recruiting@wyze.com.  Lastly, and exceptionally important to us: we are an equal opportunity employer and value diversity as well as inclusion here at Wyze. We are fully committed to providing equal employment opportunities for all employees and all applicants for employment. That’s how we do things!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T17:20:16.000Z"
  },
  "company": {
    "name": "Wyze",
    "link": "https://www.linkedin.com/company/wyzelabs"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 98100,
    "max_value": 147000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Kirkland",
    "region": "WA",
    "postal_code": "98034",
    "street_address": null,
    "latitude": 47.675507,
    "longitude": -122.20336
  }
}