{
  "job": {
    "title": "C++ Software Engineer Simulation- UE4-Unity",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a C++ Software Engineer Simulation- UE4-Unity with experience, please read on!  What You Will Be Doing  If you are a C++ Software Engineer with experience, please read on!  Based in Santa Monica, CA, we are building the best in-flight Augmented Reality flight training system in the world. What You Will Be Doing As a C++ Engineer, you will build the infrastructure and platform to support airborne-based augmented reality solutions. You will work across organizations, threading together newly developed technologies to produce and share the data needed for the UE4 team to drive intuitive experiences that enhance pilots' experience of the world around them. What You Need for this Position integration of specialized hardware acceleration blocks. What You Need for this Position So, if you are a C++ Software Engineer Simulation- UE4-Unity with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Jonathan.Gilmor@Optello.com Jonathan Gilmor - Recruiting Manager - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-22T12:38:31.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}