{
  "job": {
    "title": "Staff Software Engineer Federal - Salesforce Platform (Remote Eligible)",
    "industry": "Computer &amp; Network Security,Computer Software,Information Technology and Services",
    "description": "Okta is the leading independent provider of identity for the enterprise. The Okta Identity Cloud enables organizations to securely connect the right people to the right technologies at the right time. With over 6,500 pre-built integrations to applications and infrastructure providers, Okta customers can easily and securely use the best technologies for their business.  We are looking for an experienced who is passionate about writing the tools to integrate and build Okta’s enterprise applications and business solutions. You will share our passion for test-driven development, continuous integration and automation to produce frequent high-quality releases. Our elite team is fast, innovative and flexible; with a weekly, agile release cycle and individual ownership. We expect great things from our engineers and reward them with stimulating new projects, emerging technologies and the chance to have significant impact in a company that is changing the cloud computing landscape forever.  You will get an opportunity to scale our business solutions to the next generation; enabling Okta to be the most efficient, scalable, and best-run company. The vision is to make Okta the system of record and help customers with their journey to the Cloud, continue to automate the journey, and lower the barrier of entry to their migration journey. Okta is rethinking the traditional work environment, providing our employees with the flexibility to be their most creative and successful versions of themselves, no matter where they are located. We enable a flexible approach to work, meaning for roles where it makes sense, you can work from the office, or from home, regardless of where you live. Okta invests in the best technologies and provides flexible benefits and collaborative work environments/experiences, empowering employees to work productively in a setting that best and uniquely suits their needs. Find your place at Okta https://www.okta.com/company/careers/.  By submitting an application, you agree to the retention of your personal data for consideration for a future position at Okta. More details about Okta’s privacy practices can be found at: https://www.okta.com/privacy-policy.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:14:51.000Z"
  },
  "company": {
    "name": "Okta",
    "link": "https://www.linkedin.com/company/okta-inc-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 100000,
    "max_value": 144000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}