{
  "job": {
    "title": "Data Modeler",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "We are Accenture, a global professional services company and a leading partner to the world’s major cloud providers, including AWS, Azure, and Google. Our longstanding involvement with cloud technology (we have 34,000 completed cloud projects under our belt) was emphasized recently when we consolidated our multiple cloud teams into a single business practice called . The organization is backed by a $3 billion investment over three years.  As part of our group, you will lead technology innovation for our clients through robust delivery of world-class solutions. There will never be a typical day and that’s why people love it here. The opportunities to make a difference within exciting client initiatives are unlimited in the ever-changing technology landscape. You will be part of a highly collaborative and growing network of technology and data experts, who are taking on today’s biggest, most complex business challenges using the latest data and analytics technologies. We will nurture your talent in an inclusive culture that values diversity. You will have an opportunity to work in roles such as Data Scientist, Data Engineer, or Chief Data Officer covering all aspects of Data including Data Management, Data Governance, Data Intelligence, Knowledge Graphs, and IoT. Come grow your career in Technology at Accenture!  Basic Qualifications: Education Requirement: Bachelor's degree or equivalent (minimum 12 years work experience). If Associate’s Degree, must have equivalent minimum 6 year work experience.  Unless expressly indicated, this role is not open in the state of Colorado. $72,400 - 134,999",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:24:28.000Z"
  },
  "company": {
    "name": "Accenture",
    "link": "https://ie.linkedin.com/company/accenture"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "St Petersburg",
    "region": "FL",
    "postal_code": "33737",
    "street_address": null,
    "latitude": 27.77207,
    "longitude": -82.63849
  }
}