{
  "job": {
    "title": "IoT and Data Analytics Solution Engineer",
    "industry": "Information Technology and Services,Computer Software,Management Consulting",
    "description": "Job Description IoT and Data Analytics Solution Engineer  Position Description  Are you a driver of change with the talent to inspire clients and colleagues? Come and join us as a IoT and Data Analytics Solution Engineer within our East Emerging Technology Practice at CGI. You will help shape the digital revolution, taking responsibility for some of the world’s most ambitious transformation projects.  Architecting cutting-edge commercial and local and state government projects, your work will have a wide reach, helping make the everyday easier, for everyone. We’re a Top 100 employer so when you start your CGI story, not only will you be improving people’s lives, you can be sure we’ll do the same for you.  A compelling communicator and a natural motivator, you’ll deliver the very best solutions working with enthusiastic teams of experts. Your vision, sector expertise and professional acumen will deliver innovation with a real customer focus.  This role must be located at one of the following locations: NYC; NJ; PA  Your future duties and responsibilities  As an IoT and Data Analytics Solution Engineer you will work directly with Clients and across CGI’s US East Business Unit Leaders formulating all aspects of solution approaches and development. You will be accountable for and apply your industry-proven expertise of IoT applications, data analytics, AI/ML and innovation thereby contributing to a high level of Client satisfaction.  Your hands-on expertise with IoT platforms and data analytics will be instrumental in enabling our client to achieve their objectives. You will bring lessons learned and expertise from successful custom implementations in the cloud. complex concepts in an easy to understand way Skill Set/Years of Experience/Proficiency Level  Data Analytics  5+  Proficient  IoT  3+  Proficient  Cloud  3+  Proficient  Client Facing  3+  Proficient  Development (any language above)  5+  Proficient  ETL  5+  Expert Bachelor's or Master’s degree in Engineering, Science, Mathematics or Information/Computer related field  Skill Set/Years of Experience/Proficiency Level  AI/ML/NLP  1  Novice  Computer Vision  1  Novice  Blockchain/DLT  1  Novice  Minimum Education Required: High School Diploma/GED  #doubledown It is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this change—supporting our clients’ digital journeys and offering our professionals exciting career opportunities.  At CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create.  Be part of building one of the largest independent technology and business services firms in the world.  Learn more about CGI at www.cgi.com .  No unsolicited agency referrals please.  CGI is an equal opportunity employer.  Qualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, pregnancy, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics.  CGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com . You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. .  We make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members.  All CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. CGI will consider for employment qualified applicants with arrests and conviction records in accordance with all local regulations and ordinances.  CGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with CGI’s legal duty to furnish information.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:45:30.000Z"
  },
  "company": {
    "name": "CGI",
    "link": "https://ca.linkedin.com/company/cgi"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Plymouth Meeting",
    "region": "PA",
    "postal_code": "19462",
    "street_address": null,
    "latitude": 40.10454,
    "longitude": -75.28111
  }
}