{
  "job": {
    "title": "Senior Data Engineer - Kubernetes (Remote)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Senior Data Engineer $140,000 - $170,000 5-10+ years as a Data Engineer + Docker/Kubernetes + Python + AWS  We are a 200 person SaaS healthcare company with a mission to improve quality of life. We have experienced consistent growth for the past 6 years and are continuing to scale our engineering team.  If you are looking for a role at a technology company where you can have a positive impact on peoples lives and healthcare, please apply today!  Top Reasons to Work with Us What You Will Be Doing What You Need for this Position So, if you are a Senior Data Engineer - Kubernetes (Remote) with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Danny.Herries@Optello.com Danny Herries - Lead Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:10:37.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}