{
  "job": {
    "title": "Data Scientist Staff",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all. EY is the only professional services firm with a separate business unit (\"FSO\") that is dedicated to the financial services marketplace. Our FSO teams have been at the forefront of every event that has reshaped and redefined the financial services industry. If you have a passion for rallying together to solve the most complex challenges in the financial services industry, come join our dynamic FSO team!  The business problems our clients are facing today are not the same problems they have faced in the past. The rapid pace of development in AI and the technology that enables it has created an urgent need to innovate and adapt to the new global business paradigm. Financial institutions are looking to build smarter and more efficient ways to operate their business, create new revenue streams, and better manage risk, through new opportunities uncovered by their data. We believe that to fully unlock the potential of AI and advanced analytics we need to look not only at the application of AI, but also at the strategy level for how best to transform the enterprise into one that is technology and data focused and ready for the new age. Our clients' problems are becoming increasingly complex while at the same time the need to automate and streamline is rising. As a member of the Advanced Analytics team, we'll look to you to provide our clients with a unique business perspective on how data science and analytics can transform and improve their entire organization - starting with key business issues they face. This is a high growth, high visibility area with plenty of opportunities to enhance your skillset and build your career. We provide constant room for growth through client engagements and personal development. Our practitioners develop and lead innovative techniques and methods, supporting both business and technology leaders. This role provides the unique opportunity to build a professional network, tackle complex issues, and drive cutting edge approaches across industry leading clients and domains. You will help our clients navigate the complex world of modern data science and analytics. You'll be working with a newly created team in truly uncharted territory. You will apply your knowledge and experience to support the delivery of key projects, build valuable relationships both within EY and with clients, and develop strong capabilities through both formal training and working with senior mentors and talented colleagues.  You'll spend most of your time working with a wide variety of clients to help with designing advanced analytics solutions, undertaking proof-of-concepts, and implementing these solutions to help clients to compete effectively in this dynamic environment. We're interested in self-motivated and passionate leaders with a strong vision and desire to stay on the cutting edge of data technology and science. We are looking for individuals who aspire to build collaborative team environments and possess effective management skills while demonstrating in-depth technical capabilities and industry knowledge.  If you have a genuine drive for helping consumers achieve the full potential of their data while working towards your own development, this role is for you! We offer a competitive compensation package where you'll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, both pension and 401(k) plans, a minimum of 15 days of vacation plus ten observed holidays and three paid personal days, and a range of programs and benefits designed to support your physical, financial and social well-being. Plus, we offer: We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. If you can demonstrate that you meet the criteria above, please contact us as soon as possible.  The exceptional EY experience. It’s yours to build. EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.  Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.  Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.  EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-28T02:52:41.000Z"
  },
  "company": {
    "name": "EY",
    "link": "https://uk.linkedin.com/company/ernstandyoung"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 70300,
    "max_value": 114000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}