{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Hardware",
    "description": "As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. We live in a moment of remarkable change and opportunity. Data and technology are transforming industries, society, and even the workplace–by creating professions that did not exist before the emergence of data, cloud, social, and mobile. As the largest technology and consulting employer in the world, IBM is a leader in this global transformation and just the place to continue your career.Global Chief Data Office (GCDO) is responsible for providing governed, regulated, secure, and efficient access to enterprise data for consumption by business units, AI centric applications and researchers. The AI and data privacy groups within the GCDO, are responsible for providing effective use of platform and infrastructure for computationally expensive workloads and to decrease the time data scientist personas spend preparing data and computational pipelines. In addition, the AI and data privacy groups are tasked to accelerate cognition into internal processes, literally hundreds of processes while maintaining governance, security, privacy, and trust.The position will support existing team of AI & data privacy specialists working on enterprise use-cases, specifically tasked with the transformation of IBM's internal business practices to be more AI centric. Secondary role will be to move certain derivative works to product and work with existing enterprise clients on their own journey.  The candidates are supposed to have an in-depth knowledge of most common machine learning techniques and their application. It would be also necessary for you to understand the limitations of these algorithms and how to optimize the model parameters, or architectures to improve the performance for the given problem. IBM’s Chief Data Office works to embed data protection principles into IBM’s business processes, products, and services so that our clients can better meet their own data protection objectives. Join us to build innovative data privacy and governance solutions that can assist clients and partners with data privacy compliance around the world. Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.  Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.  It's time to define your career. IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.  Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.  At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to  IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. We consider qualified applicants with criminal histories, consistent with applicable law. IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T00:00:00.000Z"
  },
  "company": {
    "name": "IBM",
    "link": "https://www.linkedin.com/company/ibm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}