{
  "job": {
    "title": "Staff Software Engineer",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "At PayPal (NASDAQ: PYPL), we believe that every person has the right to participate fully in the global economy. Our mission is to democratize financial services to ensure that everyone, regardless of background or economic standing, has access to affordable, convenient, and secure products and services to take control of their financial lives. We’re a purpose-driven company, and our beliefs are the foundation of how we conduct business every day. We’re guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Collectively, these values inspire us to work together as One Team with our customers at the center of everything we do, and to take care of ourselves, each other, and the communities in which we live and work. We challenge the status quo, ask questions, and find solutions. Join us as we enable the hopes, dreams, and ambitions of millions of people around the world. PayPal Checkout API Team Serves $100+B in payment volumes across 200+ countries. We are creating a world where ‘payments’ is synonymous with PayPal. The PayPal Platform is a suite of web services, which are used by internal and external developers to enable payments anytime, anywhere and anyway. The Platform processes billions of requests each month, and enables PayPal and its partners to rapidly innovate on new payment scenarios and enable new experiences. Therefore, the evolution of the Platform is integral to PayPal’s long-term strategy. As an engineer in our development team you will be responsible for the development and delivery of the web services supporting PayPal APIs and user experiences on various channels (web, mobile, etc.), as well as integrations with partners. You will work closely with product and experience and/or integration teams to understand the developer needs and deliver the APIs that meets their needs. Experience in developing software for distributed systems with high performance, scalability and availability  Own and drive development and delivery of features in the API  Provide technical leadership and mentoring to engineers within the team  Familiar and comfortable with the technologies, the tradeoffs, and the design patterns emerging in web services  Thrive in a fast-paced, dynamic environment. You have a bias towards action and results Minimum 5+ years software development experience (3+ for MS)  BS in Computer Science or related degree required.  Experience in developing high performance, scalable and available web services using J2EE and frameworks such as RestEasy, Spring, Apache CXF and Jersey  Knowledge of object-oriented design and design patterns, and programming skills  Experience in designing, developing and delivering software and/or platforms used by other developers,  Good understanding of web services and SOA related standards like REST/OAuth/JSON and SOAP/WSDL.  Excellent knowledge of programming languages, especially Java.  Excellent communication and writing skills  For more than 20 years, PayPal has remained at the forefront of the digital payment revolution. By leveraging technology to make financial services and commerce more convenient, affordable, and secure, our open digital payments platform gives PayPal’s 400 million active account holders the confidence to connect and transact in new and powerful ways. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying, or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.  PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.  REQ ID R0074352",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:30:36.000Z"
  },
  "company": {
    "name": "PayPal",
    "link": "https://www.linkedin.com/company/paypal"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Scottsdale",
    "region": "AZ",
    "postal_code": "85266",
    "street_address": null,
    "latitude": 33.494907,
    "longitude": -111.92606
  }
}