{
  "job": {
    "title": "Associate Director/Director, Medical &amp; Regulatory Writing - Remote",
    "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "Regulatory Professionals, a division of Premier Research, is a consultancy firm specializing in drug, biologics and device regulatory affairs. Our purpose as a company is to support our clients by furthering the development of human therapeutics that will benefit the health and well-being of patients around the world. With a presence in the US, EU, Canada and Japan we are growing and looking for talented people to grow our business, advance the goals of our clients and contribute to our unique culture. Our focus is to provide strategic and tactical support in all aspects of regulatory affairs, including preclinical, CMC and clinical development for drugs, biologics, devices, and combination products. The Associate Director -Medical and Regulatory Writing is responsible for managing other internal or external (contract) medical/regulatory writers, assigning projects to direct reports, and assuring the quality of a direct report’s work. In addition, this individual also fulfills the role of a senior level medical/ regulatory writer: authoring, managing and providing critical oversight of clinical and regulatory documents including but not limited to clinical study reports, protocols, Investigator Brochures, non-clinical and clinical eCTD summaries and overviews, integrated summaries, meeting packages and other clinical or regulatory documents. This individual should also be a technically skilled and strategic regulatory writer with deep experience with and understanding of document development, ICH guidelines and Good Clinical Practice, a well-honed ability to convert scientific data into clear, well-structured, scientifically sound, clinical and regulatory documents intended for global health authorities and stakeholders.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:28:04.000Z"
  },
  "company": {
    "name": "Premier Research",
    "link": "https://www.linkedin.com/company/premier-research"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}