{
  "job": {
    "title": "Data Scientist",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Together we make. Come make with us. At Cricut®, we believe that we’re all born makers. When we built our first cutting machine, we saw the potential for a simple yet powerful tool to completely transform the way people craft, design, and DIY. Since then, we continue to innovate with new machines, platforms, materials, and tools, but that’s just what we do. Who we are is a bustling worldwide community, a means for connection, and an outlet for unbridled creativity. Join us as we place the power of handmade into the hands of ALL.  Life  Love your work. And your coworkers.  Our company is made up of A+ human beings. We ask tough questions, entertain ideas outside of our own, and work together to make something bigger than ourselves. With Cricut® growing in China, the U.K., Australia, New Zealand, as well as Europe and South America, we’re on an unstoppable roll, satisfying that innate creative itch around the world. We train, develop, and celebrate great work with hallway high fives and promotions within. We also throw the world’s best Halloween party.  Enjoy incredible perks.  We take care of our team. From outstanding medical, dental, vision, and retirement benefits, to pet insurance, 401K match, life insurance, incentive programs, paid time off, on-site massages, phenomenal work-life balance, and employee discounts, we offer the best benefits package in the DIY consumer electronics industry. Period.  Like what you see? We can’t wait to meet you. This position will need a hands-on Data Scientist to expand our Data Science and Machine Learning efforts. Person is accountable for executing high-impact data science initiatives, creating and driving a culture that values and understands the importance of data, building and improving adoption of data products using the best technology available.  Data team  We are looking for highly talented team members who are passionate about data, have the rigor needed to solve billion-dollar problems, and possess an innate entrepreneurial spirit to explore the uncharted. This team combines the engineering backbone of a best-in-class big data platform with the analytic expertise of advanced mining and predictive modeling. If you want to work among the very best talent in the industry, working on the most innovative products in the world, Cricut is the place to be. Desired background / skills / mindset: Please attach your resume and cover letter. If you want to show your super powers in other ways – include that information too. You can be sure that Cricut® is an employer who values individuality, equality and diversity, so tell us what you’re all about. If you are a Maker or a DIY enthusiast, whether you think you are a good one or not, we would love to hear about it when you send us your information!  At Cricut®, we celebrate inclusion and diversity. Cricut is an equal opportunity employer and makes employment decisions based on merit. Cricut prohibits discrimination based on race, color, religion, sex, sexual identity, gender identity, marital status, veteran status, nationality, citizenship, age, disability, medical condition, pregnancy, or any other unlawful consideration. All your information will be kept confidential according to EEO guidelines. Cricut participates in E-Verify.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T09:30:31.000Z"
  },
  "company": {
    "name": "Cricut",
    "link": "https://www.linkedin.com/company/cricut"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "South Jordan",
    "region": "UT",
    "postal_code": "84095",
    "street_address": null,
    "latitude": 40.559307,
    "longitude": -111.93867
  }
}