{
  "job": {
    "title": "Data Science Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.  We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!  The Team  We are a group of storytellers, technology innovators, and change agents. Adobe 3D revolution is here! We are on a mission to deliver the best 3D ecosystem of tools and services in the globe, smart creative apps and high-end content to empower creatives with everything they need to make inspiring art. Join us in building a new creativity platform that will help define Creative Cloud and Adobe’s Digital Media business!  The Opportunity  Are you interested in defining the future of 3D creativity by making it frictionless, connected and powerful? Passionate about understanding workflows and customer patterns to drive innovation and business growth? We are seeking a hands-on Data Scientist and Product Analytics Leader to help define and improve the adoption and utilization of Adobe's Substance 3D suite of products. You’ll be working across all of 3D&I's product and marketing functions to understand and optimize all parts of the product. This role is a strategic role, working with product managers, growth marketers and the leadership team, to make key decisions about the direction of our products. We are looking for an experienced specialist with a passion for using data to drive the decision-making process.  Challenges Nice to have Pursuant to the Colorado Fair Pay Act, below is a summary of compensation elements for this role at the company if based in Colorado.  At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).  In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T22:01:44.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Oregon",
    "region": "United States",
    "postal_code": "97350",
    "street_address": null,
    "latitude": 43.938683,
    "longitude": -120.558105
  }
}