{
  "job": {
    "title": "New Grad Software Engineer, Backend",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Circle is a global financial technology firm that enables businesses of all sizes to harness the power of digital currency and public blockchains for payments, commerce and financial applications worldwide. Circle platforms and products provide a suite of internet-native financial services for payments, treasury infrastructure and capital formation. Circle is also a principal developer of USD Coin (USDC), which has become the fastest growing dollar digital currency in the world. USDC has grown to over 23 billion in circulation and supported over $640B in transactions in the past year. Circle's payments and treasury infrastructure services available through the Circle Account and APIs helps bridge the legacy financial system and digital currency and blockchain based finance. Circle's SeedInvest service brings internet-native fundraising and capital formation to startups and growth companies. Combined, Circle's suite of services helps companies to participate in a more open, global and inclusive financial system. With the mission \"To raise global economic prosperity through the frictionless exchange of financial value,\" Circle was founded on the belief that the internet, blockchains and digital currency will rewire the global economic system, creating a fundamentally more open, inclusive, efficient and integrated world economy. We envision a global economy where people and businesses everywhere can more freely connect and transact with each other with new technologies for digital money and internet-native finance. We believe such a system can raise prosperity for people and companies everywhere. Our mission is powered by the values we espouse and which we expect all Circlers to respect. We are Multistakeholder, serving the needs of our customers, our shareholders, our employees and families, our local communities and our world. Furthermore, we are also Mindful, Driven by Excellence, and High Integrity. In 2020, Circle unveiled Circle APIs: a set of solutions and smarter technology to help businesses accept payments in a more global, scalable and efficient alternative to traditional banking rails (spoiler: we're using USD Coin under the hood).  Over the next 12 months, we're going to rapidly grow our API customer base and enable even more businesses to easily integrate and benefit from the breakthrough of programmable money on the internet.  If you're data-driven, interested in building something meaningful and would love to work in an entrepreneurial environment, we can't wait to hear from you.  You will aspire to our four core values: Principal Software Engineer (V)  Staff Software Engineer (IV)  Senior Software Engineer (III)  Software Engineer (II)  Software Engineer (I) As a Software Engineer on the Circle Platform Services team, you will build scalable microservices that are responsible for reliable and secure APIs that transfer value & assets across all blockchain protocols (think Bitcoin and Ethereum, for example) as well as traditional banking protocols (think credit cards, bank transfers etc). We are an and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:23:03.000Z"
  },
  "company": {
    "name": "Circle",
    "link": "https://www.linkedin.com/company/circle-internet-financial"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Ithaca",
    "region": "NY",
    "postal_code": "14850",
    "street_address": null,
    "latitude": 42.468765,
    "longitude": -76.48568
  }
}