{
  "job": {
    "title": "Software Engineer",
    "industry": "Retail,Health, Wellness and Fitness,Hospital &amp; Health Care",
    "description": "Peachy is seeking a Software Engineer to join the team! Peachy is a fast-growing, wrinkle prevention brand based in New York City. We offer the three scientifically demonstrated ways to prevent and treat facial wrinkles in our studios. It's our mission to make wrinkle prevention and treatment approachable, but also clinically excellent.  We are looking for a Software Engineer that is excited about building a technology infrastructure to scale with a growing business. This opportunity will report directly to our Engineering Lead, and will be an instrumental hire to expand our Technology department. Pay & Perks: Peachy is an equal opportunity employer and does not discriminate against any applicant or employee because of race, color, religion, sex, national origin, disability, genetic information, age, or military or veteran status in accordance with federal law. In addition, the Company complies with applicable state and local laws governing non‐discrimination in employment in every jurisdiction in which it maintains facilities. The Company also provides reasonable accommodation to qualified individuals with disabilities, pregnant individuals, and individuals with sincerely held religious beliefs, in accordance with applicable laws.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T17:10:37.000Z"
  },
  "company": {
    "name": "Peachy",
    "link": "https://www.linkedin.com/company/peachystudio"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}