{
  "job": {
    "title": "Senior Software Engineer, Search",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology In Tableau we help people understand data. We do so by enabling people to transform data into something visual and understandable, helping them make important decisions based on those insights. If you are passionate about technology, but also care deeply about doing something meaningful, Tableau is the place for you.  With large deployments of Tableau, containing millions of visualizations, we need to provide people with tools to find the data that is important to them. No matter how good our platform is at showing meaningful and beautiful visualizations, they can’t have an impact if they cannot be found. The search team’s mission is to create a unified content discovery and search experience for all of Tableau’s products. We do so by combining advanced search algorithms with machine learning to provide consistent and meaningful results appropriate to the users context and workflow to help them find relevant data and insights  available within their organization to answer their business questions.  As an engineer on the search team, you will develop and deploy UI components and services at scale building on top of Elasticsearch powering search across various Tableau products. We follow a service oriented design, and use technologies such as React, JavaScript, Java, Python, Spring framework, docker, New Relic, Splunk, PagerDuty, Elasticsearch , Kubernetes, Octopus, and AWS. Currently we are looking for a full stack developer to join our fast growing search team. You are well-versed in a variety of technologies and languages, and are in particular experienced in React and Java with at least 4+ years relevant experience. You have experience building scalable services in Java with common frameworks and libraries popular in Java shops. You’ve worked with a variety of database technologies with large datasets and understand how to optimize for maximum performance and scale. You should understand microservice design patterns well and how to create loosely coupled SaaS systems to find the right balance. You have experience with agile development methodologies and testing. You are interested in solving the search problem but prior experience in search is not a must. Your personal software practices ensure you deliver high quality codes. You believe in automation and writing tests for your own code as a way of maintaining high quality in your products. You understand what it takes to write software that is used by millions of people. You love writing things that \"just work\" - things that are reliable, scalable, and secure. You think far enough ahead to avoid tech debt, but know how to avoid over-engineering. You are agile and can prototype, learn, adapt, and pivot as needed. You are familiar with DevOps practices. You treat operational issues as they are software problems. As you write your code you are already thinking about how to operate them efficiently in production. You enjoy collaborating with, learning from, and teaching others (including across disciplines) so we all become better. You enjoy fostering a continuous learning environment and champion technical excellence within the team. Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring onboard to help us continue to build one of the best companies in the world! If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. and are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. and do not accept unsolicited headhunter and agency resumes. and will not pay any third-party agency or company that does not have a signed agreement with or .  Salesforce welcomes all.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T05:53:51.000Z"
  },
  "company": {
    "name": "Salesforce",
    "link": "https://www.linkedin.com/company/salesforce"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}