{
  "job": {
    "title": "Sr Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Are valued and empowered, collaborative and team oriented, innovative in their approach and passionate about their work. They are reliable, trustworthy and open with a high level of integrity. We value diversity, are inclusive and are committed to a global approach! Are you looking to be an integral part of a team delivering high-quality features for exciting next-generation products? Do you want to contribute to the cutting-edge technology and products we are known for worldwide? The System Performance and Solution Group is looking for an experienced Software Engineer with a software testing background to join us.  On our team, you will be responsible for the design and execution of solution and system-level software test plans for BIG-IP products. This includes automating test cases and contributing to test tools and infrastructure. You will also be responsible for documenting test results and validating product defects. The Job Description is intended to be a general representation of the responsibilities and requirements of the job. However, the description may not be all-inclusive, and responsibilities and requirements are subject to change. Please note that F5 only contacts candidates through F5 email address (ending with @f5.com) or auto email notification from Yello/Workday (ending with f5.com or @myworkday.com). It is the policy of F5 to provide equal employment opportunities to all employees and employment applicants without regard to unlawful considerations of race, religion, color, national origin, sex, sexual orientation, gender identity or expression, age, sensory, physical, or mental disability,marital status, veteran or military status, genetic information, or any other classification protected by applicable local, state, or federal laws.This policy applies to all aspects of employment, including, but not limited to, hiring, job assignment, compensation, promotion, benefits, training, discipline, and termination. Reasonable accommodation is available for qualified individuals with disabilities, upon request.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:29:36.000Z"
  },
  "company": {
    "name": "F5",
    "link": "https://www.linkedin.com/company/f5"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 92300,
    "max_value": 165000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}