{
  "job": {
    "title": "Software Engineer",
    "industry": "Internet,Information Technology and Services",
    "description": "LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We are much more than a digital resume – we transform lives through innovative products and technology.  Creating economic opportunity for every member of the global workforce is a responsibility we all share. To truly transform the global economy, we must evolve the way we hire and enable our talent to serve people of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer.  Responsibilities: • You will design and execute user-facing features for the native LinkedIn app on iOS devices by leveraging mobile operating system frameworks for multi-threading, persisting data, and managing user experience and graphics across multiple screen sizes. • You will use the latest cutting edge technologies and libraries suggested by Apple for building responsive native apps for iOS. • You will build scalable native mobile apps using LinkedIn’s internal libraries. • You will make architectural trade-offs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality. • You will produce high-quality software that is unit tested, code reviewed and checked in regularly for continuous integration. • You will provide technical leadership, driving and performing best engineering practices to initiate, plan, and execute large-scale, cross-functional, and company-wise critical programs. • You will identify, leverage, and successfully evangelize opportunities to improve engineering productivity.  Basic Qualifications: • BS in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent technical experience. • 1+ years of industry experience.  Preferred Qualifications: • 2+ years of relevant work experience. • MS or PhD in Computer Science or related technical discipline. • Experience in designing and building infrastructure and web services at large scale. • Extensive programming experience in Java, Objective-C and/or C++. • Expansive technical knowledge and experience with iOS application development. • Deep foundation in computer science with a strong understanding in data structures, and algorithms. • Experience developing multi-tier scalable and user-centric reliable applications that operate 24x7. • Knowledge of UI and animation frameworks, touch user interface, and MVP application design. • Experience with relational databases (transactional and non-transactional), database architecture, and distributed transaction management. • Experience building services for information delivery from server to mobile clients working with relevant tools (IDEs, ant, junit, etc.). • Strong object-oriented skills including design, coding, and testing patterns.  You will Benefit from our Culture: We strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels.  Equal Opportunity Statement LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.  LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.    If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.    Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:    -Documents in alternate formats or read aloud to you  -Having interviews in an accessible location -Being accompanied by a service dog -Having a sign language interpreter present for the interview   A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.  LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.  Pay Transparency Policy Statement As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.  Global Data Privacy Notice for Job Candidates This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T20:15:47.000Z"
  },
  "company": {
    "name": "LinkedIn",
    "link": "https://www.linkedin.com/company/linkedin"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 125000,
    "max_value": 156000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Sunnyvale",
    "region": "CA",
    "postal_code": "94085",
    "street_address": null,
    "latitude": 37.389164,
    "longitude": -122.01792
  }
}