{
  "job": {
    "title": "Senior Site Reliability Engineer (Remote)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Innovate, Grow and Do Extraordinary “Together”, is at the core of everything we do at Karsun!  At Karsun we defy assumptions and enable transformation as IT modernization experts. Our people and client-first focus, innovation and performance driven culture empowers and encourages our employees with the autonomy to innovate, and be accountable to take ownership and seek advancement opportunities for personal growth.  Karsun is looking for a Systems Reliability Engineer based out of our Herndon, VA office (Remote is an option as well). You would be joining a stealth and cutting-edge team within Karsun, charged with helping to build and perform within a larger team delivering Cloud Modernization solutions to our Federal Agency clients such as; The GSA, DHS-FEMA, FAA and others. At Karsun, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Karsun believes that diversity and inclusion among our teammates is critical to our success, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.”  The , and all recognize Karsun Solutions among the fastest-growing companies in the Washington, D.C. region. Its teams deliver modern software development, cloud solutions, and data and analytics solutions to customers at government agencies including the Department of Homeland Security, Federal Aviation Administration, and General Services Administration. It possesses a DCAA Approved Accounting System, CMMI Level 5 - DEV appraisal, and AWS Government Competency.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T14:50:04.000Z"
  },
  "company": {
    "name": "Karsun Solutions, LLC",
    "link": "https://www.linkedin.com/company/karsun-solutions-llc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}