{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Site Reliability Engineer 3+ years of professional work experience. Fully Remote Depending on experience, competitive compensation.  We are a Cybersecurity leader in our field. Our team leads the fight in securing important data and applications wherever they reside. Our solutions identify, evaluate, and eliminate new and upcoming threats so you never have to worry about delivering your product or service to your customers. We provide security on all fronts for thousands of enterprises and millions of people daily. You can focus on what you do best and leave us to securing your data.  What You Will Be Doing What You Need for this Position What's In It for You So, if you are a Site Reliability Engineer with experience, please apply today! Or Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Marcus.Quigley@Optello.com Marcus Quigley - Executive Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T13:20:02.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}