{
  "job": {
    "title": "AI/ML - Software Engineer, Home Automation",
    "industry": "Consumer Electronics",
    "description": "An opportunity to join the Siri Home Automation engineering team in Seattle, and contribute to the platform that is redefining conversational computing for our homes.   We are seeking a *Senior Software Engineer* who brings a passion for connected home technology to help us advance Siri’s capabilities in the Home whilst delivering intuitive and delightful experiences to millions of customers.   We have an amazing space and exciting road map in which to innovate, be challenged, and have impact.    Our team is developing the next bold revolution of Siri in the home. Would you like to join us? BS/MS in Computer Science or equivalent  8+ years of professional engineering experience  Proven track record of architecting performant scalable distributed services  Demonstrated ownership of large cross-functional and multi-team projects  Proven technical leadership, education, and team mentorship  Solid fundamentals in OO design, patterns, data structures, and algorithms Are you interested in being responsible for innovating, implementing, delivering new features for the Siri Home Automation Domain? Than this may be the role for you!   As a Siri engineer, you will blend the latest machine learning technologies with conversational and product design to deliver exceptional experiences to millions of homes globally.   You will join a hands-on development team that fosters creativity and generates outstanding solutions to deliver engineering perfection by partnering with a variety of multi-functional teams cross the company.   You will prioritize tasks with rapid development cycles, remain flexible and calm in the face of uncertainty, and collaborate to deliver excellent results for time-critical issues within given specifications.   You will work to improve the performance and reliability of all Siri experiences.   You will create tools and frameworks that the entire Siri product can benefit from.   You will be a technical leader to engineers in your team and across the organization. BS/MS in Computer Science or equivalent Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.   Join the Siri team at Apple.    Role Number: 200144886",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:15:41.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}