{
  "job": {
    "title": "Data &amp; Applied Scientist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "Are you looking for an opportunity to solve business-critical problems for Fortune-500 customers globally using cutting-edge AI and ML technology? Do you enjoy tackling technical challenges and producing innovative solutions to real-world problems? Then come join the AI Platform team in Microsoft. You will be working along the best AI/ML engineering, science, and product talent in the industry and engaging with the largest, most complex customers and ISVs in the world.  Artificial Intelligence (AI) and Machine Learning (ML) is the next explosive growth area in technology relevant to every business in every industry on the planet. The data economy is already booming, and in 2021 there will be a projected 35 zettabytes of data generated by 50 billion connected devices. From these mountains of data, AI and ML will harvest valuable predictive signals and patterns that will fundamentally transform the face of business. With our own already existing volumes of data and research assets, Microsoft is investing to be a key player and a market leader in this industry.  The AI Platform organization at Microsoft has the charter to bring the best of our AI & Research assets, tools and cloud infrastructure, rich data, and trusted position together, to deliver AI and ML services and solutions to customers. The mission of the AI Commercial Engineering team within the AI Platform Product Management organization is to co-innovate, incubate, and improve our core AI platform from scenarios utilizing Azure Cognitive Services and Azure ML. We do so by building and infusing AI technologies in real world solutions and extending the signals from real world patterns to building robust, scalable AI platform services and products. To achieve this, we are co-innovating AI and ML powered solutions (rich APIs, ML models and end to end services) with our strategic ISVs and Enterprise customers, leveraging many other Azure technologies, including Azure Data Analytics (Synapse, ADF, SQL and ADB) and Python/C# microservices, Azure Functions and AKS. We are looking for a passionate, highly motivated, and innovative Data and Applied Scientist to help us build world class AI and ML solutions for our customers and partners. This role is for an experienced data scientist who is passionate about building complete, highly performant, intelligent, software solution, with a scalable and sustainable architecture and implementation while incorporating data privacy capabilities.  The role involves a fair amount of customer engagement and solving complex problems with the customer/partner. The ideal candidate is someone is self-motivated to drive the creation of great enterprise products and who can collaborate and partner with other product teams, data scientists and engineers, and deal with ambiguity and complexity.  Knowledge transfer to partners and community may be required, as well presenting to customers or a public event. Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T05:06:38.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}