{
  "job": {
    "title": "Medical Laboratory Scientist or Medical Laboratory Technician",
    "industry": "Hospital &amp; Health Care",
    "description": "Are you passionate about the patient experience? At HCA Healthcare, we are committed to caring for patients with purpose and integrity. We care like family! Jump-start your career as a Medical Laboratory Technician or Medical Laboratory Scientist (MT) today with Mission Hospital. We are committed to providing our employees with the support they need. At Mission Hospital, we offer eligible colleagues an attractive benefit package that includes medical, wellbeing, dental and vision benefits along with some unique benefits including: Come join our team as a Medical Laboratory Technician or Medical Laboratory Scientist (MT). We care for our community! Just last year, HCA Healthcare and our colleagues donated $13.8 million dollars to charitable organizations. Apply Today! Job Summary: Performs both routine and complex lab analyses and/or identification procedures on blood, tissue, and body fluids with minimal supervision. Assists management in monitoring quality control data to ensure results or procedures are accurate and precise. This position supports Transfusion Services. Work Schedule: 230PM-11PM, rotating holidays and weekends. Eligible for 2nd Shift Differential and Weekend Differential incentives!  Mission Hospital, located in Asheville, North Carolina, serves as the regional referral center for tertiary and quaternary care in western North Carolina and the adjoining region. Mission Hospital is licensed for more than 800 beds and houses the region’s only dedicated Level II trauma center. It also includes Mission Children’s Hospital - the region’s only children’s hospital. The flagship hospital of Mission Health, Mission Hospital has been consistently ranked as one of the nation’s Top 100 Hospitals by Truven Health Analytics. Mission Hospital, a member of Mission Health, is an operating division of HCA Healthcare.  HCA Healthcare has been named one of the World's Most Ethical Companies by Ethisphere Institute for over a decade. In recent years, HCA Healthcare spent an estimated $3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.  \"Good people beget good people.\"- Dr. Thomas Frist, Sr. HCA Healthcare Co-Founder  If you are looking for an opportunity that provides satisfaction and personal growth, we encourage you to apply for our opening. We promptly review all applications. Highly qualified candidates will be contacted for interviews. Unlock the possibilities and apply today!  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:15:17.000Z"
  },
  "company": {
    "name": "HCA Healthcare",
    "link": "https://www.linkedin.com/company/hca"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Asheville",
    "region": "NC",
    "postal_code": "28805",
    "street_address": null,
    "latitude": 35.595913,
    "longitude": -82.55004
  }
}