{
  "job": {
    "title": "Data Scientist (Remote)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "MachineMetrics was founded by a small group of software and manufacturing professionals unified by a mission to deliver meaningful products that can change the manufacturing world. MachineMetrics has simplified Industrial IoT to digitize the shop floor and enable teams to drive decisions with machine data.  Manufacturing impacts almost every aspect of how we interact with the physical and virtual world today, from the technology we use at work to the way we communicate with each other in our daily lives. Today is the internet moment for manufacturers and MachineMetrics is a pioneer in empowering a more sustainable, resilient, automated factory of the future.  To accomplish this we've combined world-class talent in both advanced manufacturing and cutting edge technology to build a company focused on solving real manufacturing problems. Our work environment is busy, non-political, and comfortable. People that do well here can self-manage but aren't afraid to reach out for guidance and thrive in a creative problem-solving environment. We are proud to be recognized as one of the top workplaces in the tech industry.  MachineMetrics was named by and voted one of ! Data Science's mission at MachineMetrics is to provide advanced analytics to the organization, employing predictive modeling skillsets not otherwise found in the company, manifesting ultimately in a predictive machining product. The predictive machining product allows MachineMetrics to deploy algorithms to edge devices and actuate commands remotely to machines - all the way from creating an alarm to stopping the machine. We employ methods such as physics modeling, machine learning, and big data analysis with cross-company data to achieve our goals. We work heavily with Engineering to productize our work - with Data Science focusing largely on the creation of effective algorithms, which are then handed over to the Edge team for deployment.  The Data Scientist will be tasked with key aspects of data science and data analytics development, guided by engineers with significant development experience. You'll help discover new ways to look at the information being collected and assist in designing solutions that address customer needs, including large-scale anomaly detection on manufacturing data and physics-based models to help discern various errant phenomena on machines before failure. You should be familiar with time-series analysis and signal processing, and have a working knowledge of machine learning methods.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-19T05:36:09.000Z"
  },
  "company": {
    "name": "MachineMetrics",
    "link": "https://www.linkedin.com/company/machinemetrics"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 78500,
    "max_value": 147000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}