{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services",
    "description": "Here at Lenovo, we believe in smarter technology for all, so we spend our time building a society that’s brighter and more inclusive.  And we go big. No, not big—huge.  We’re not just a Fortune 500 company, we’re one of Fortune’s Most Admired. We’re in 180 countries, working with 63,000 brilliant colleagues and counting. And we’re known for the world’s most complete portfolio of smart technology, from devices to software to infrastructure.  With our ingenuity, we help millions—not just the select few—experience our version of a smarter future.  The one thing that’s missing? Well… you... About The Company Motorola Mobility (a Lenovo company) is one of the world's fastest growing smartphone providers, creating groundbreaking, affordable, high-quality products designed and built with the global customer in mind. And it's our people who make this all happen. We are thinkers, risk-takers and problem solvers, working together to constantly challenge the status quo. If you share our commitment to ingenuity, creativity and innovation, we want you to help us define our world of tomorrow. Explore the opportunities and apply today! About Our Team You will be joining a driven team focused on providing the very best camera performance for millions of mobile phone customers. The team is curious, dedicated, diverse, and passionate about working together to make the very best mobile phone cameras. What You Will Do You will create innovative AI solutions for Motorola phones to enhance camera performance and create new user experiences. You will drive all phases of development: define datasets, implement architectures, train, evaluate, and optimize for mobile devices. You will be given the opportunity to learn what you don't know and teach what you do. Responsibilities - Research the state-of-the-art in Machine Learning and Computer Vision including architectures, techniques, and datasets. - Lead the creation of datasets, define collection requirements, techniques, and procedures, apply data augmentation, and evaluate coverage. - Code, test, and debug model architectures, training pipelines, loss functions, and evaluation tools. - Train solutions, analyze progress, and iterate based on quantitative and qualitative analysis. - Engineer solutions to achieve the optimal tradeoff between model performance and runtime costs. - Deploy commercial-quality solutions to a wide portfolio of mobile devices. Qualifications - Bachelor’s degree or higher in Computer Science, Computer Engineering, or related quantitative discipline - 5+ years of experience developing complex solutions - Thorough understanding of Machine Learning - Demonstrated ability to apply engineering principles at all stages of development - Significant experience with Python and an ML framework (TensorFlow, PyTorch, etc.) - Experience developing ML solutions for systems with limited resources (for example mobile devices) is a plus. We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any federal, state, or local protected class. - Bachelor’s degree or higher in Computer Science, Computer Engineering, or related quantitative discipline - 5+ years of experience developing complex solutions - Thorough understanding of Machine Learning - Demonstrated ability to apply engineering principles at all stages of development - Significant experience with Python and an ML framework (TensorFlow, PyTorch, etc.) - Experience developing ML solutions for systems with limited resources (for example mobile devices) is a plus.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-17T00:43:50.000Z"
  },
  "company": {
    "name": "Motorola Mobility (a Lenovo Company)",
    "link": "https://www.linkedin.com/company/motorola-mobility"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}