{
  "job": {
    "title": "Data Scientist.",
    "industry": "Nonprofit Organization Management,Financial Services,Hospital &amp; Health Care",
    "description": "Department Information  About Legislative Council Staff Colorado Legislative Council Staff, the nonpartisan research agency of the Colorado General Assembly, is seeking a skilled and highly motivated professional to join our team. This position will be housed in our economics section, which is comprised of a team of economists, other social scientists, and data scientists performing policy analysis and revenue forecasting for the state legislature. Legislative Council Staff is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. We are committed to increasing the diversity of our staff. Therefore, we encourage responses from people of diverse backgrounds and abilities. Since 1953, the Colorado Legislative Council Staff (LCS) has provided nonpartisan products and services to the legislature and the public to support and inform the policy making process, preserve the legislative institution, and promote transparency. You will be joining an organization with a rich history that is driven by our mission, vision, and values.  As a nonpartisan staff organization, our work is guided and informed by our commitment to: Service the Legislative Institution Excellence Integrity Respect Innovation When you join LCS, you can expect: to fill a vital role in supporting Colorado’s lawmakers to serve our state and uphold the democratic process; to join a supportive and collegial culture that is driven by our shared mission, vision, and values; to work for an organization committed to balancing our important work for the state legislature with employees’ lives outside of work; to be supported in your continual professional development and growth; and to work for an organization that recognizes the unique talents, backgrounds, and contributions of our individual employees.  Additional information about Legislative Council Staff can be found at: http://leg.colorado.gov/agencies/legislative-council-staff. The salary range for this position is $60,000 to $70,000 per year, with salary level within this range commensurate with experience.  Legislative Council Staff employees are not members of the state personnel system. Legislative Council Staff is committed to providing employees with a strong and competitive benefits package that supports you, your health, and your family.  Our benefits package includes: PERA retirement benefits, including PERA Defined Benefit Plan, PERA Defined Contribution Plan, plus 401K and 457 plans;  Medical, dental, and vision insurance coverage; Automatic short-term and optional long-term disability coverage; Life and AD&D insurance; Flexible Spending Accounts (FSAs); A variety of discounts on services and products available through the State of Colorado's WorkLife Employment Discount Program; and Credit Union of Colorado membership eligibility A minimum of three weeks of annual leave, based on tenure, and accrued on a monthly basis; Ten annual paid holidays; Sick leave; Flexible work schedules during the legislative interim; and A generous compensation time policy.  The ongoing COVID-19 pandemic has impacted how and where we do our work. We currently work on a hybrid model, with work required in the office on certain days of most weeks, and the rest of the time remote. We anticipate that this position will work in the office full time beginning in January 2022.  Description of Job Primary responsibilities of the position include supporting development of a database of economic and other indicators, updating and maintaining an interactive school finance model, and streamlining and improving data visualization, data collection, and data analysis processes. This position may also support other key functions of Legislative Council Staff including forecasting state and local government revenue sources, caseloads, and other items of importance to the General Assembly; writing economic or policy-related reports; analyzing and writing fiscal analyses (“fiscal notes”) on proposed legislation; and responding to questions from legislators, lobbyists, government officials, and the public. A successful candidate will: have experience using the R programming language and related software, including building scripts for statistical or other modeling or programming, and accessing, analyzing, or visually displaying data; have the ability to work in a nonpartisan manner in a partisan environment, and to provide objective information regardless of the issue or one’s personal opinions; have strong analytical, data analysis, and research abilities; have excellent time management skills and be able to work well under time pressure; be able to work independently as well as with a team; have effective oral and written communication skills; and be proficient in word processing and Excel. The ideal candidate will have experience: building interactive models or graphics using R Shiny; using other program languages in addition to R, such as Python or SQL; using data management software, such as a SQL server, and/or other data analysis and visualization software, such as Tableau; and conducting economic and/or public policy analysis. Minimum Qualifications, Substitutions, Conditions of Employment & Appeal Rights  The minimum educational requirement is a Bachelor’s degree from an accredited college or university and/or a degree or certificate in data science or a related field. The preferred candidate would have three or more years of experience with data analysis and management.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T17:17:00.000Z"
  },
  "company": {
    "name": "State of Colorado",
    "link": "https://www.linkedin.com/company/state-of-colorado"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 58800,
    "max_value": 111000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Denver",
    "region": "CO",
    "postal_code": "80247",
    "street_address": null,
    "latitude": 39.738453,
    "longitude": -104.984856
  }
}