{
  "job": {
    "title": "Software Engineer, CDA",
    "industry": "Marketing and Advertising,Nonprofit Organization Management,Insurance",
    "description": "CDA is searching for an experienced software engineer to help our transition to a cloud-based IT ecosystem. We are aggressively moving from older, siloed, on-premises solutions to Azure and AWS hosted systems that integrate with each other in real time.  This position will be responsible for applying software development skills and methodology to fill gaps in our overall solution portfolio. Rather than performing extensive ground up development of systems, our efforts will center on creatively integrating disconnected systems while filling in functional gaps as needed. The primary development languages used at CDA are C#, Java, PowerShell, and bash. However, our software engineer should be comfortable with leaning on a solid understanding of core web technologies like HTML, CSS, JavaScript, HTTP, XML and Json to adapt their solution approach given a variety of runtime environments and components.  The Software Engineer analyzes, designs, develops, modifies, writes, edits, and implements software programming applications. The primary responsibility of the position will be to execute on the design, development and delivery of technology that enables great customer experiences that deliver on desired functionality on behalf of the organization. This will include developing production grade code through vision, definition, planning, execution, deployment and sustainment as well as performing unit testing to ensure conformance to specifications. Occasionally (1-33%) Frequently (34-66%) Constantly (67-100%) Over our 150-year history, the California Dental Association (CDA) has become a leader in oral health throughout California and the country. Today, we continue to support our community of over 27,000 dentists through our family of companies, which include The Dentists Insurance Company (TDIC), TDIC Insurance Solutions, Rotunda Partners and the CDA Foundation. At CDA, we value individual talents, encouraging a diverse, collaborative, and innovative work environment fueled by new ideas. As our organization continues to grow, we invite you to be a part of what’s next.  CDA is an equal opportunity employer and is committed to the principle of equal employment opportunity for all employees and providing a safe work environment. CDA does not tolerate discrimination or harassment and all employment decisions are based on job requirements and individual qualifications, without regard to race, color, religion, national origin, age, gender, gender identity or expression, sex, ancestry, citizenship status, mental or physical disability, genetic information, sexual orientation, veteran or military status. If you have a disability or special need that requires accommodation, please contact us at humanresources@cda.org.  Powered by JazzHR  p7XadMKbyx",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-14T07:42:43.000Z"
  },
  "company": {
    "name": "California Dental Association",
    "link": "https://www.linkedin.com/company/california-dental-association"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 81900,
    "max_value": 177100,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Sacramento",
    "region": "CA",
    "postal_code": "95820",
    "street_address": null,
    "latitude": 38.576935,
    "longitude": -121.49495
  }
}