{
  "job": {
    "title": "Data Scientist (Remote- US Based)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Aquicore was founded in 2013 in the early hours of the morning on the belief that smarter and more connected buildings will have a global impact in curbing our climate challenges and make buildings technologically ready for the next century.  We create global impact by bettering the built environment every day.  Our next generation of software facilitates smarter building operations used by the largest real estate owners and operators around the world. We are changing the industry from the ground up and we’re looking for the right people to achieve our mission!We’re amped by the work we do and driven to constantly propel our values and culture. While awards aren’t the goal, we are humbled to be recognized as one of the coolest places to work by organizations such as DC Inno. Our people come first and it’s the combination of our culture and our mission that has been our greatest differentiator. We take our core values as a company seriously and aspire to level-up our Aquicorians in their careers and professional growth. We are seeking a Data Scientist who will continually find ways to make Aquicore innovative. This individual will generate creative solutions to the hardest problems in CRE sustainability while making product improvements in a scalable way. You will work with cutting-edge technology to improve the commercial real estate industry to be more efficient, intelligent, and sustainable by bringing in smart machine learning products. You will generate meaningful insights for customers to run their buildings more efficiently and keep them excited about Aquicore. You will automate processes to multiply value to customers and develop tools to assure high data quality which is the backbone of Aquicore. You will help the team make intelligent decisions with data-driven insights. Data scientists collaborate with industry experts from many disciplines: software engineers, data engineers, and product managers. You will also work closely with domain experts across the company such as building systems engineers or customer service specialists to understand the core problems and customer needs. You will be expected to report and present to senior leadership on team initiatives. Sign up to stay in touch. We have new positions regularly and we’d love to reach out to you first when it opens up!  We are committed to equal opportunities and creating an inclusive environment for all our employees. We welcome applicants regardless of ethnic origin, national origin, gender, race, religious beliefs, disability, sexual orientation or age. Aquicore is an EEOC.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-19T18:15:32.000Z"
  },
  "company": {
    "name": "Aquicore",
    "link": "https://www.linkedin.com/company/aquicore"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}