{
  "job": {
    "title": "Senior Human Factors Researcher",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "Cerner’s UX team is looking for a Senior Human Factors Researcher. Human Factors Researchers assist internal development teams on user interface design and usability through application of human factors principles, standards, and methodology to identify and mitigate design induced end-user performance issues. In this role you’ll be responsible for understanding the vision of Cerner domains and using this knowledge to communicate user research findings to engineering and solution owners. You’ll be responsible for collaborating with other members of the User Experience team to solve complex design challenges and understand the end-user requirements at each stage of the development process. You’ll conduct quantitative and qualitative usability research studies in terms of efficiency, effectiveness, acceptability, training impact, and error tolerance for a project. You’ll interpret and analyze the results of usability research to validate the success of a design based on established usability goals and common heuristics. You’ll present and communicate your usability research findings to project teams and stakeholders. As a Human Factors Researcher, you will help to define participant requirements for human factors researcher studies, advise internal development teams on user interface design and usability, and facilitate the most effective method to elicit and represent user-centered design across all Intellectual Property domains.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:20:42.000Z"
  },
  "company": {
    "name": "Cerner Corporation",
    "link": "https://www.linkedin.com/company/cerner-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Kansas City",
    "region": "MO",
    "postal_code": "64113",
    "street_address": null,
    "latitude": 39.099792,
    "longitude": -94.57856
  }
}