{
  "job": {
    "title": "Machine Learning Engineer - Apple Media Products",
    "industry": "Consumer Electronics",
    "description": "Apple Media Products (AMP) first delighted users with downloadable music in April 2003 with the opening of the iTunes Store. Since then, AMP has delivered countless innovations around the digital delivery of audio and video, and in 2008 revolutionized smartphone app distribution with the launch of the App Store. Being the source for so much digital content requires maintaining relationships with a vast number of providers, from record labels to movie studios to app developers. The Digital Supply Chain Engineering team (DSCE) is tasked with ensuring that new content is uploaded, processed, cataloged, and available on our storefronts when the provider expects it to be top notch quality   AMP Media Workflow Engineering team is seeking a forward-thinking self-starter to join our team. AMP is an increasingly vital and central component of Apple’s ecosystem, and continues to rely heavily on processing of media at ever more massive scale, at a level of quality unmatched in the industry. Join us in building Apple’s platform for audio and video ingestion and processing at the heart of Apple TV+, and participate in the innovation that will drive the next generation of media features services at Apple. At least three years of relevant experience in ML and CV algorithms.  Skilled in deep learning for image/video classification, recognition, object detection, segmentation, OCR, and etc.  Knowledge and experience on processing sequential data, such as audio and video. Familiar with models that deal with sequential data, such as RNN, LSTM, BERT, or sequence-to-sequence model.  Practical understanding of the mathematics behind modern machine learning, linear algebra, and statistics.  Good publication record in machine learning/deep learning/computer vision desirable.  Knowledge and experience with popular deep learning frameworks (e.g. Pytorch, Tensorflow, Keras, Caffe).  Strong programming and debugging skills in: Python, C/C++, or equivalent.  Experience in collaborating with infrastructure engineers to deliver final products or services.  Attention to detail, data accuracy, and quality of output.  You bring passion and dedication to your job and are committed to our vision. We are in search of a Software Engineer to provide new and enhanced tools in order to support its fast paced growth. Join our exciting team that is dedicated to providing the highest quality media products services to our customers. Our team is responsible for the software that drives workflows for encoding all audio and video content for the our Apple TV store, including movies, music, audio books, TV shows, Apple TV+, and more. We are looking for a standout colleague who is able to tackle problems under tight deadline constraints and deliver imaginative solutions.  Responsibilities include: Building tools and workflows to support new media-related, customer-visible features services across Apple’s ecosystem. Optimization of existing workflows to improve throughput and utilization of massive server farm across multiple data centers. Creating internal tools to support quality control of our media content. To achieve this, the ideal candidate will have experience developing large-scale server-side systems using object-oriented languages. MS or Ph.D in computer vision, machine learning, computer science or equivalent industry experience. 5 years of relevant Machine Learning experience with MS degree preferred or 3 years of related ML work experience with Ph.D degree.    Role Number: 200255224",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T17:09:24.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 115000,
    "max_value": 155000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}