{
  "job": {
    "title": "Data Scientist / Economist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "HP is a Fortune 100 technology company with $58+ Billion in revenue, with over 50,000 employees operating in more than 170 countries around the world. We provide technology and services that help people and companies address their problems and challenges, and realize their possibilities, aspirations, and dreams. We apply new thinking and ideas to create simpler, more valuable, and trusted experiences with technology, continuously improving the way our customers live and work  As Data Scientist in the Pricing Analytics team you will shape HP’s future of how we set prices. We are a very dynamic, highly skilled and diverse global team consisting of data scientists, economists, statisticians, computer scientists and engineers, who are pushing the innovation frontier in the way HP sets prices for its products. Working with us you will combine your modelling skills, economic/business thinking, experimentation and optimization methods to build complex pricing algorithms for most popular Printers and PCs in the market. At HP, we believe in the power of ideas. We use ideas to put technology to work for everyone. And we believe that ideas thrive best in a culture of teamwork. That is why everyone – at every level in every function, is encouraged to think big, have original ideas and express and share them. We trust anything can be achieved if you really believe in it, and we will invest in your ideas to change lives and the way people work. This vision is what sets us apart as a company. At HP, we work across borders and without limits. Global virtual teams share resources, pool their big ideas to solve our biggest business opportunities. Everyone is valued for the unique skills, experiences and perspective they bring. That’s how we work at HP. And this is how ideas and people grow. You’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.  So are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.  HP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.  Our history: HP’s commitment to diversity, equity and inclusion - it's just who we are.  From the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T14:01:56.000Z"
  },
  "company": {
    "name": "HP",
    "link": "https://www.linkedin.com/company/hp"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Spring",
    "region": "TX",
    "postal_code": "77387",
    "street_address": null,
    "latitude": 30.079731,
    "longitude": -95.41769
  }
}