{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 392 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Decision Scientists are on the front line of identifying and targeting fraud to keep our millions of users secure and engaged. Risk Decision Scientists apply their analytical and technical skills to researching data, monitoring, and creating logics that stop fraudulent activity on Venmo’s platform. They analyze existing loss trends and define logics, solutions, and operational processes that prevent them - while delivering best-in-class customer experience for Venmo users. Risk Decision Scientists work closely with one another, with Venmo Risk Operations and with Venmo’s Customer Support, in order to keep learning about current fraud. They also partner closely with the Venmo Product teams to define features and integrate risk prevention tools to support business goals. As Venmo is a subsidiary of PayPal, this role also involves working closely with PayPal Risk teams to align on fraud-prevention methodologies and tools. Our team members are excited about solving analytical problems. They are bright, they are responsible, and they know how to follow through. If you’re also like that, we’d love to hear from you. We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.  PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.  REQ ID R0075748",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T13:13:19.000Z"
  },
  "company": {
    "name": "PayPal",
    "link": "https://www.linkedin.com/company/paypal"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}