{
  "job": {
    "title": "Data Quality Analyst",
    "industry": "Market Research",
    "description": "ClearCut Analytics is a leading provider of retail analytics for CPG brands. With over $50B in eCommerce and Amazon sales data analyzed, our intelligence delivers actionable insights into today’s complex retail marketplace to power successful product innovation, optimize cross-channel performance, and outmaneuver an expanding set of competitors. Beyond ClearCut’s technology, our team of experts ensure companies are equipped with a roadmap and partner for success in the digital era for consumer goods.  For 20+ years, SPINS’ mission has been to increase the presence and accessibility of natural and organic products to encourage healthier and more vibrant living. By leveraging SPINS’ industry-leading proprietary data and analytics, our technology enables deeper, more engaged relationships between Retailers, Brands and Consumers through our platform, web, and mobile products. At the core of our work lies a passion to create a culture of sustainable health & wellness.  ClearCut has chosen SPINS as a strategic partner to drive market acceleration, in-market execution, and product development. This is a highly strategic investment to accelerate SPINS’ omnichannel e-commerce strategy. We are looking for dynamic and passionate individuals to join our Data team as a to help develop and grow our data and insights offering. The team focus is on the complete data quality cycle, from logging and auditing the receipt and processing of data to ensuring data deliverables are of the highest quality. You will be responsible for the execution of data quality routines. This individual will proactively monitor, measure, analyze, execute, track and report on data quality issues. The Data Quality Analyst will interact with other teams to resolve data quality related issues. This position reports to the VP Data and Insights. Undertake and Conduct Data Quality Management activities such as (but not limited to): When we began working remotely a year ago due to COVID, we committed to keeping our healthy and active SPINS culture. This remained a high priority for us as we grew our employee population by nearly 20% while we worked remotely. We listen to employee feedback as we plan when and how we will return to the office in the future.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:12:34.000Z"
  },
  "company": {
    "name": "SPINS",
    "link": "https://www.linkedin.com/company/spins"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}