{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Financial Services",
    "description": "( ): 11  S&P Global Platts is seeking a Sr Software Engineering to work with technical leadership for all stages of software design, development and maintenance of Platts and Realtime Platform The ideal candidate must be have strong technical skills and speak to the technical architecture and collaborate with engineering teams. S&P Global states that the anticipated base salary range for this position is $83,200 to $190,100. Base salary ranges may vary by geographic location.  In addition to base compensation, this role is eligible for an annual incentive plan.  This role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.  If you need an accommodation during the application process due to a disability, please send an email to: and your request will be forwarded to the appropriate person. The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.  20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.2 - Middle Professional Tier II (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning) 260287 2021-04-30 New York, New York, United States",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:40:43.000Z"
  },
  "company": {
    "name": "S&amp;P Global Platts",
    "link": "https://www.linkedin.com/company/spglobalplatts"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 104000,
    "max_value": 151000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}