{
  "job": {
    "title": "Entry Level Artificial Intelligence / Machine Learning (Engineer)",
    "industry": "Research",
    "description": "Riverside Research is adding a Junior or Entry Level AI/ML Engineer to our team in Beavercreek, OH. You will have the opportunity to support existing contracts and prototype & develop automation solutions for NASIC's most difficult Scientific & Technical Intelligence problems. You will be part of a highly skilled and integrated team that analyzes intelligence data to discover opportunities for automated solutions. You will be mentored and gain responsibilities that will really impact our customers success.  All Riverside Research opportunities require US citizenship. Riverside Research strives to be one of America's premier providers of independent, trusted technical and scientific expertise. As we continue to add experienced, technically astute staff, we are looking for highly motivated, talented team members that can help our DoD and Intelligence Community (IC) customers continue delivery of world-class programs. As a not-for-profit, technology-oriented Defense Company, we believe service to customers and support of our staff is our mission. Our goal is to serve as a destination company by providing an industry-leading, positive, and rewarding employee experience for all who join us. We aspire to be a valued partner to our customers and to earn their trust through our unwavering commitment to achieve timely, innovative, cost-effective, and mission-focused solutions.  All positions at Riverside Research are subject to background investigations. Employment is contingent upon successful completion of a background investigation including criminal history and identity check.  Our EEO Policy  Riverside Research is an equal opportunity employer. We recruit, employ, train, compensate and promote without regard to race, religion, sex, color, national origin, age, gender identity, sexual orientation, marital status, disability/veteran, status as a protected veteran, or any other basis protected by applicable federal, state and local law.  If you need assistance at any time in our application or interview process, please contact Human Resources at 937-427-7074 or email HR. A member of the HR team will be available to assist.  This contractor and subcontractor shall abide by the requirements of 41 CFR 60-741.5(a). This regulation prohibits discrimination against qualified individuals on the basis of disability and requires affirmative action by covered prime contractors and subcontractors to employ and advance in employment qualified individuals with disabilities.  This contractor and subcontractor shall abide by the requirements of 41 CFR 60-300.5(a). This regulation prohibits discrimination against qualified protected veterans and requires affirmative action by covered contractors and subcontractors to employ and advance in employment qualified protected veterans.  For more information on \"EEO is the Law\", please visit:  http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf  https://www.dol.gov/sites/dolgov/files/ofccp/regs/compliance/posters/pdf/eeopost.pdf",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-26T17:15:24.000Z"
  },
  "company": {
    "name": "Riverside Research",
    "link": "https://www.linkedin.com/company/riverside-research"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Beavercreek",
    "region": "OH",
    "postal_code": "45314",
    "street_address": null,
    "latitude": 39.73277,
    "longitude": -84.06587
  }
}