{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Chewy is looking to hire in Bellevue, WA, Boston, MA, Fort Lauderdale, FL or Minneapolis, MN locations. Site Reliability Engineers are a cross between system and software engineers who are responsible for all operational aspects of Chewy’s e-commerce platform. The team is responsible for designing, building, monitoring, and maintaining the infrastructure of our internet-facing and internal services. We're looking for engineers who want to be a part of developing infrastructure software, maintaining it, and scaling Chewy’s technology stack. Come help us build a bigger and better Chewy as a Site Reliability Engineer. You will be part of a small family within Chewy that has a huge impact on our incredible growth. Ideal candidates will possess the ability to discuss complex technical concepts with a diverse audience across all areas of the organization. They will remain calm under pressure and always strive to add structure to high-pressure, fast paced tasks or projects. Chewy is committed to equal opportunity. We value and embrace diversity and inclusion of all Team Members.  If you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at Chewy, please contact HR at chewy dot com  To access Chewy’s Privacy Policy, which contains information regarding information collected from job applicants and how we use it, please click here: https://www.chewy.com/app/content/privacy).",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T11:13:49.000Z"
  },
  "company": {
    "name": "Chewy",
    "link": "https://www.linkedin.com/company/chewy-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}