{
  "job": {
    "title": "AI Machine Learning Engineer",
    "industry": "Electrical/Electronic Manufacturing,Mechanical or Industrial Engineering,Consumer Goods",
    "description": "It takes great people to achieve greatness. People with a sense of purpose and integrity. People with a relentless pursuit of excellence. People who care about making things better For Those Who Make The World™. Sound like you? Join our top-notch team of 54,000+ professionals in 60 countries who are making their mark on some of the world’s most beloved brands, including DEWALT, CRAFTSMAN, STANLEY, BLACK+DECKER, IRWIN, LENOX and more .  The mission of the AI group is to create and use the best-possible AI technologies, systems, algorithms and models for delivering outsized value and radically accelerating SBD’s businesses and vision. AI is used for improving performance of people and machines by using models and insights generated from automated processing of big data. It’s a broad area encompassing , data science (DS), machine vision, natural language processing (NLP), data analytics (DA), data mining, mathematical optimization, and related technologies from fields such as computer science, robotics, statistics and operations research. This group provides AI leadership, coordination, standards and shared services to all other corporate and business groups across the company. We work with business partners in order to identify existing business problems and emerging value-creation opportunities to which AI techniques can be applied. The AI group is led by the Chief AI Officer (CAO) of SBD. As an you’ll be part of our Artificial Intelligence team located remotely. You will build, deploy and maintain AI/ML systems and explore conceptually new solutions in a fast-paced environment. You will be at the heart of a growing and exciting focus area for Stanley Black & Decker and work with variety of its business units (including manufacturing, security services, industrial equipment and engineering products, as well as other units) to apply artificial intelligence techniques to our most difficult problems. You always strive to do a good job…but wouldn’t it be great if you could do your job and do a world of good? You care about quality – at every level. You love to learn and grow and be acknowledged for your valuable contributions. You’re not intimidated by innovation. In fact, you embrace it. You’ll receive a competitive salary and a great benefits plan: We want our company to be a place you’ll want to be – and stay. Being part of our team means you’ll get to: What’s more, you’ll get that pride that comes from empowering makers, doers, protectors and everyday heroes all over the world. We’re more than the #1 tools and storage company and #2 security solutions provider, with a leading presence in engineered fastening. We’re visionaries. Industry 4.0 innovators. As successful as we’ve been in the past, we have so much further to go. That’s where you come in. Join us! 78090BR US - Global IT 1 All qualified applicants to Stanley Black & Decker are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran’s status or any other protected characteristic. Engineering Services Engineering, Technology & Data",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T05:11:04.000Z"
  },
  "company": {
    "name": "Stanley Black &amp; Decker, Inc.",
    "link": "https://www.linkedin.com/company/stanley-black-decker-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New Britain",
    "region": "CT",
    "postal_code": "06051",
    "street_address": null,
    "latitude": 41.667526,
    "longitude": -72.78344
  }
}