{
  "job": {
    "title": "Java Software Engineer (EE Knowledge A MUST!)",
    "industry": "Oil &amp; Energy",
    "description": "If you are a Java Software Engineer (EE Knowledge A MUST!) with 3+ years of INDUSTRY experience, please read on!  Based in the hustle and bustle of some of the nation's emerging markets is a renewables Hardware and Software company building out their office in Herndon, VA. We are a green tech company that has been around for 100+ years and is seeking to tackle energy storage. We have partnered with leading professionals in the Renewables space and are starting to grow a great deal in our Software division.  For the Softare division, we are looking for top professionals to help us on our next project. We are building software to make data-driven decisions in the Green Tech space. These Engineers will be building software that will directly impact the scale of our power plants. Let's build a greener world, together.  What You Need for this Position 3-5 Years of Professional Experience with some of the following: What's In It for You So, if you are a Java Software Engineer (EE Knowledge A MUST!) with 3-5 years of INDUSTRY experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Meaghan.Curran@CyberCoders.com Meaghan Curran - Associate Manager - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-25T16:19:40.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Herndon",
    "region": "VA",
    "postal_code": "22092",
    "street_address": null,
    "latitude": 38.96973,
    "longitude": -77.38387
  }
}