{
  "job": {
    "title": "Data Engineer",
    "industry": "Information Technology and Services,Computer Software,Insurance",
    "description": "Derex Technologies Inc specializes in providing IT consulting, staffing solutions and software services. Globally headquartered in Harrison New Jersey since 1996 Derex delivers the highest quality technology professionals and an array of customized IT talent solutions designed to improve productivity and drive results to global clients throughout North America.  With over two decades of unparalleled experience, Derex provides supports to its clientele, across such industries as Systems Integration, Banking and Finance, Telecommunications, Pharmaceutical and Life Sciences, Energy, Healthcare, Technology, Transportation, and local and federal Government agencies. As a Data Engineer III, you will be responsible for designing, maintaining, and optimizing large-scale automated ELT processes. Working actively with analysts and customer teams specializing in enterprise data warehousing, you will leverage industry-standard data orchestration tools as well as in-house proprietary scheduling and automation tools to create efficient and reliable ELT jobs which support product offerings and data warehousing needs for our customers. As we incorporate more cloud technologies into our processes, you will be at the forefront of exploring and defining best practices and helping us transition our products to be more scalable. Additional Information  All your information will be kept confidential according to EEO guidelines.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T00:00:00.000Z"
  },
  "company": {
    "name": "Derex Technologies Inc",
    "link": "https://www.linkedin.com/company/derex-technologies-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 88400,
    "max_value": 151000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}