{
  "job": {
    "title": "Lead Developer SalesForce Vlocity",
    "industry": "Information Technology and Services,Insurance,Financial Services",
    "description": "Join a team that puts its People First! Since 1889, First American (NYSE: FAF) has held an unwavering belief in its people. They are passionate about what they do, and we are equally passionate about fostering an environment where all feel welcome, supported, and empowered to be innovative and reach their full potential. Our inclusive, people-first culture has earned our company numerous accolades, including being named to the Fortune 100 Best Companies to Work For® list for six consecutive years. We have also earned awards as a best place to work for women, diversity and LGBTQ+ employees, and have been included on more than 50 regional best places to work lists. First American will always strive to be a great place to work, for all. For more information, please visit www.careers.firstam.com. We are looking for smart people to help us imagine, design, and build great software solutions leveraging the ( ) platform to help our business partners succeed by solving challenging problems in a fast paced and results driven setting. #techreferral First American invests in its employees' development and well-being, empowers them to provide superior customer service and encourages them to serve the communities where they live and work. First American is committed to diversity and inclusion. We are an equal opportunity employer.Based on eligibility, First American offers a comprehensive benefits package including medical, dental, vision, 401k, PTO/paid sick leave and other great benefits like an employee stock purchase plan.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T01:58:49.000Z"
  },
  "company": {
    "name": "First American Title",
    "link": "https://www.linkedin.com/company/first-american-title"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Ana",
    "region": "CA",
    "postal_code": "92703",
    "street_address": null,
    "latitude": 33.749737,
    "longitude": -117.86978
  }
}