{
  "job": {
    "title": "Site Reliability Engineer (SRE), Information Security",
    "industry": "Consumer Electronics",
    "description": "This position can be location in Santa Clara Valley (CA) or Seattle (WA).     Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.    We are seeking a SRE who is passionate about security, and can thrive in a fast-paced environment where both individual drive and team collaboration are the keys to success. The SRE will configure, tune, and troubleshoot multi-tiered systems to achieve optimal application performance, stability and availability. The SRE will work closely with software developers, infrastructure and network engineers to deploy, maintain, and support applications and services. The SRE will work with users to analyze and resolve issues reported against services and applications. A positive and respectful attitude  Linux/Unix system administration experience along with a working knowledge of common Linux and macOS file systems  Background using container and container orchestration technologies (Docker, Kubernetes)  At least 3 years of experience supporting RESTful applications using technologies such as Java, Ruby, Rails, Python, NginX, etc.  Knowledge and experience with software version control systems and source code management (Git/GitHub)  At least 3 years of experience deploying, configuring, and supporting software in the cloud (AWS)  Experience working with Atlassian tools (Confluence, Jira, Jira servicedesk)  Familiarity with log aggregation and visualization tools such as Zabbix/Splunk  Experience creating and using SQL queries to diagnose problems  An understanding of CI/CD technologies such as Jenkins  Familiarity with Agile development methodology  Excellent written and verbal communication skills, ability to work effectively with technical and non-technical users  The desire to provide a great customer experience The successful candidate will be highly self-motivated with a passion for excellence, quality, and attention to detail. The SRE will be responsible for operating and supporting application environments, working on deployments and automation, and working closely with the development engineers to assist with implementation and deployment of features. Responsibilities of the DevOps engineer will include:   -  Determine optimal configurations for application software, servers, database connections  -  Environment monitoring and task automation  -  Set up and manage monitoring tools  -  Measure and optimize system performance  -  Work with users to gather technical details and better understand issues Bachelors Degree or equivalent work experience -  Knowledge and experience using one or more programming languages including Swift, Objective-C, Golang, Python, Shell, Java, Ruby/Rails for scripting and/or development  -  Familiarity with Networking concepts (e.g. Open Systems interconnection (OSI) model)    Role Number: 200259709",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-16T16:25:57.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 81200,
    "max_value": 209000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}