{
  "job": {
    "title": "Data Scientist-HomeKit",
    "industry": "Consumer Electronics",
    "description": "The HomeKit team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and crafting experiences that revolutionize the way people harmonize with the accessories around them.  The team is seeking a hardworking Data Scientist to push the boundaries of data collection, processing and visualization and building a foundation of data driven decision-making for a growing team. Foundation in data science, machine learning, and analytics, including statistical data analysis and A/B testing.   5+ years of proven experience building data science driven solutions to tackle business problems.  Ability to dive into the details on product features and underlying architecture in order to help define success criteria and the ways we can measure that via metrics and other approaches. This will involve close collaboration with the engineering teams that develop those features.  Conceive and design end-to-end optimized data modeling pipelines and customer analytic scripted solutions.  Strong programming skills, including data-querying skills (SQL and/or Spark, etc.) and experience with a scripting language for data processing and development (e.g., Python, R, or Scala).  Proven experience working with Tableau or other data visualization technologies.  Ability to work multi-functionally with other Apple organizations including Marketing, Data Analytics, User Studies, Siri and application development teams.  Strong interpersonal skills and the ability to naturally explain difficult technical topics to everyone from data scientists to engineers to business partners and leaders. The HomeKit organization is looking for an experienced and highly motivated data scientist! You will partner across engineering groups building extraordinary home related products, and promote a culture of using data to measure, understand, and improve our products and features. You have a background that fuses data science, engineering, and product thinking. You have years of practical experience building measurement, evaluation, and insights to improve products.   IN THIS ROLE, YOU WILL:   Work closely with leadership and engineering teams to help define and prioritize the insights we need to make the very best products  Drive the generation of insights from raw, unstructured data to improve existing features and explore strategic directions. Develop extensive knowledge of existing metrics, advocating for changes where needed.   Work closely with engineering teams to guarantee the consistency and validity of metrics across platforms, modalities and languages.  Conduct analysis that includes data gathering and requirement specifications, processing, analysis, and report generation.   Drive regular insights reports and presentations with Apple’s leadership teams.   Tackle difficult, non-routine analysis problems, applying advanced analytical methods as needed.   Partner with your peers to build and prototype analysis pipelines that provide insights at scale.   Promote adoption of best practices and build greater awareness of common data analysis pitfalls. BS or MS in Computer Science, Electrical Engineering, Software Engineering or Systems Engineering    Role Number: 200241919",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:38:17.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 120000,
    "max_value": 218000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}