{
  "job": {
    "title": "Lead Software Engineer -REMOTE",
    "industry": "Computer Software",
    "description": "We are an online waiver solution for businesses large and small. Customized, legally binding waivers created with Smartwaiver can be signed online, or at your location on a computer, tablet, or smartphone. Signed smart waivers are stored in our secure, searchable database, eliminating the need for paper waivers and filing cabinets.  We're a small, nimble team in Bend, OR obsessed with customer service since 2012. Millions of smart waivers are signed each year by organizations like the NFL, VANS, and the U.S. Army.  We are looking for a purposeful, results-oriented, and capable Engineering Lead to guide and mentor scrum teams with Developers and QA resources who support legacy system maintenance and new application development. The ideal candidate will possess a good balance of technology and people management skills, leads with empathy, and has a keen desire to deeply understand our products and services to push our technology forward for functionality, performance, reliability, and scalability and fully own the delivery of the product.  What You Will Be Doing What You Need for this Position  BSCS and 5+ years of development experience and knowledge of: = Knowledge and experience working in the payments industry preferred.  What's In It for You  Competitive base salary ($120,000-$140,000/year) and overall compensation package So, if this sounds like yourself, we'd love to hear from you! Or Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Patrick.Solano@CyberCoders.com Patrick Solano - Lead Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:48:55.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Deschutes County",
    "region": "OR",
    "postal_code": "97707",
    "street_address": null,
    "latitude": 44.058086,
    "longitude": -121.31515
  }
}