{
  "job": {
    "title": "Software Engineer",
    "industry": "Computer Software,Computer &amp; Network Security,Computer Networking",
    "description": "WeWork is hiring a frontend software engineer to build and maintain the services that power our internal and member-facing applications. Hundreds of thousands of members around the world rely on these services to book spaces at WeWork locations, get support, learn about and gain entry to their building, invite guests, and work efficiently while in our spaces. WeWork is adapting to the realities of COVID-19 and seeking to support new members and new flexibility in co-working space, and our technology must rapidly adapt to support the business. This role will be working on an established team of experienced engineers responsible for multiple services and will have a direct impact on executive level initiatives. WeWork is the platform for creators, providing hundreds of thousands of members around the world with space, community, and services that enable them to do what they love and create their life’s work. Our mission is to create a world where people work to make a life, not just a living, and our own team members are central to that goal.  Our mission doesn’t end with the small businesses and entrepreneurs that call us home. We believe in empowering our team to create their own life’s work. We move fast and we challenge each other, but we look after each other and care about our culture, which makes working here extremely rewarding. There’s a lot of work left for us to do, and we couldn’t do it without a single member of our team.  We are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  WeWork will not cover the cost of relocation for this position. Should your application be successful, you would be responsible for your own relocation expenses.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-08T02:06:52.000Z"
  },
  "company": {
    "name": "WeWork",
    "link": "https://www.linkedin.com/company/wework"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 118000,
    "max_value": 206000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}