{
  "job": {
    "title": "Edge Solutions Architect - Retail - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At VMware, we are committed to helping our people grow professionally. Our talented employees exemplify our shared values and continue to drive our company to new heights.  VMware Edge Compute Solutions is looking for a Retail focused Solution Architect who will be responsible for developing early customer environment architectures for VMware’s Edge Compute Solutions. Edge Compute is a newly formed group in the Service Provider and Edge BU (SEBU), responsible for taking to market Edge Compute products and services for Enterprises and Service Providers.  The Edge Solution Architect works autonomously and as part of a dynamic and specialized sales team that is responsible for engaging with clients to understand their business challenges and IT priorities in an effort to design customized Edge solutions, that meets their needs. We are seeking an individual who has a real passion for technology - someone with social intelligence, enthusiasm and a collaborative ambitious mentality with a ‘can do’ attitude. Someone who can demonstrate integrity and independence yet have a huge desire to give back to your team. This is a highly visible role, at the forefront of VMware’s strategy, working in a highly collaborative and fast-growing environment.  As an Edge Solution Architect, you will be crafting a solution that may include activities such as running strategy & discovery workshop, conducting client interviews, conducting secondary research and soliciting guidance from VMware Account Team. This team works with product specialists, product managers, public cloud partners, and other stakeholders in the design and validation of offerings and alignment for a customer’s edge architecture. Your primary responsibility is to work with customers, however there will be a strong linkage to VMware’s partner ecosystem in order to design & prove out transformational strategies spanning private, public cloud and Communication Service Provider (Telco) architectures. You are expected to contribute to those strategies, develop reusable domain IP, and mentor internal & external partners on the use of the tools & technologies.  As an Edge Solution Architect you should have excellent listening and discovery skills, strong interpersonal skills, ability to solve complex problems, be a big picture thinker and be able to visualize and articulate the proposed solution. With a clear and agreed upon client vision, you will be responsible for crafting the solution to realize the customer vision during the sales process and retain client ownership through to implementation. Services and Consulting Solutions Architect Business Leadership Full Time 2021-05-06  VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.  Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:35:49.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 180,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Columbus",
    "region": "OH",
    "postal_code": "43272",
    "street_address": null,
    "latitude": 39.96276,
    "longitude": -82.99629
  }
}