{
  "job": {
    "title": "COMPUTER VISION / MACHINE LEARNING ENGINEER",
    "industry": "Consumer Electronics",
    "description": "Be a part of the Machine Vision team! We develop defect detection and metrology solution of display, camera and touch technology for iPhone, iPad, Mac, and future products. You will design and develop computer vision (CV) and machine learning (ML) based solutions, for automatic optical inspection of displays and cameras in large volume manufacturing. Be one of the first people in the world to witness new Apple products being crafted for the first time! 3+ years of related professional experience.  Deep knowledge and hands-on experience in image processing and computer vision, such as spatial/frequency domain analysis, geometric transform, feature detection, registration, segmentation, object detection and classification, etc.  Experience in developing and deploying supervised and unsupervised machine learning algorithms, such as CNN, GAN, for object detection/ image segmentation/classification.  Proficient in C++/OpenCV with familiarity of MATLAB   Proficient in Keras /TensorFlow with familiarity of Python  A positive outlook towards stepping into uncharted technology space and working hard to deliver solutions in a timely fashion.  Excellent written and interpersonal skills; clear communication with diverse teams.   ADDITIONAL QUALIFICATIONS  Familiarity with ML optimization and acceleration platforms would be a plus, eg. coreML tools and CUDA.  Domain expertise in color science, human visual system would be a plus  Experience with characterizing imaging/optical systems would be a plus  Experience in mathematical modeling and simulation for imaging applications would be a plus. You will be directly responsible for developing defect detection and automatic optical inspection of Apple products, with a team of talented engineers and scientists.   -  Design, develop and optimize CV and ML based solutions, for defect detection.   -  Collaborate closely with optical instrumentation scientists, software engineers and system design engineers, to develop and deploy mass-production friendly metrology solutions for Apple products.   -  Work with cross-functional teams to define metrology coverages and specifications. Develop and validate corresponding CV and ML algorithms during new product introduction (NPI) cycle.   -  Study and improve the correlation between algorithm and visual inspection   -  Analyze large amounts of NPI data to qualify/improve algorithm design.   -  Review/optimize algorithms from cross functional teams and third parties. MS/PhD in CS/EE/Imaging Science + 3 years experience.    Role Number: 200271339",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-28T07:47:36.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}