{
  "job": {
    "title": "DevOps/Site Reliability Engineer - REMOTE",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Based just West of Boston, we are a leading provider of cloud-based applications for governance, risk and compliance (GRC) solutions provider. Our software as a service (SaaS) platform gives organizations the control to assess, measure, and mitigate risk and to ensure the optimal performance of key business processes. Our clients include the 10 ten largest banks in the world, the largest credit card companies and massive mortgage companies as well.  We are an organization where work/life balance is a real thing. In fact right now we are all working remotely, but as life gets back to normal you will need to come into our Concord , MA office every couple months for strategic meetings. As we continue to grow we really need someone who can lead the efforts for two critical initiatives: site reliability and DevOps.  What You Will Be Doing What You Need for this Position We are a great team that is missing this important resource. If you'd like to be part of a great organization and get to work remotely, this is a great role, and we would love to talk. Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Paul.Miller@Optello.com Paul Miller - Lead Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-16T15:21:36.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Concord",
    "region": "MA",
    "postal_code": "01742",
    "street_address": null,
    "latitude": 42.45904,
    "longitude": -71.355034
  }
}