{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Work at the intersection of data science and economics.  Amazon's Advertising Impact Team is looking for a Data Scientist to help and be part of a team to put cutting-edge economic and data science advertising research into production. We are looking for a unique individual who is interested in bigger picture strategic thinking and the passion for making business impact through building science and analytical solutions.  This team is responsible for modeling short-term and long-term customer behavior in relation to advertising using state of the art econometrics and machine learning techniques as well as sizing and running experiments. This role requires strong business and science acumen to translate the business requirements into research prototype, hands-on ability to partner with engineers and implement changes in production, and excellent communication skills to present results to some of the most senior leaders of the company.  If you have a background in economics, statistics, or mathematics and have a passion for solving large, impactful problems, this is the job for you. Amazon is investing heavily in building a world class advertising business and we are responsible for defining and delivering a collection of self-service performance advertising products that drive discovery and sales. Our products are strategically important to our Retail and Marketplace businesses driving long term growth. We deliver billions of ad impressions and millions of clicks daily and are breaking fresh ground to create world-class products. We are highly motivated, collaborative and fun-loving with an entrepreneurial spirit and bias for action. With a broad mandate to experiment and innovate, we are growing at an unprecedented rate with a seemingly endless range of new opportunities.  Sponsored Products helps merchants, retail vendors, and brand owners succeed via native advertising that grows incremental sales of their products sold through Amazon. The Sponsored Products Ad Marketplace team optimizes the systems and ad placements to match demand with supply using a combination of machine learning, big data analytics, ultra-low latency high-volume engineering systems, and quantitative product focus. Our goals are to help buyers discover new products they love, be the most efficient way for Advertisers to meet their business objectives and continue to build a big, sustainable business that helps Amazon continuously innovate on behalf of all customers. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. - Amazon.com Services LLC Job ID: A1664254",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T09:22:26.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 108000,
    "max_value": 150000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}