{
  "job": {
    "title": "Quantitative Engineer",
    "industry": "Investment Management",
    "description": "Vise is an investment management platform built for financial advisors. Founded in 2016, Vise gives advisors the tools and technology they need to grow their business and help clients achieve their goals. By empowering advisors, Vise advances its mission of creating financial freedom for everyone. Vise is backed by Sequoia Capital, Founders Fund, Bond Capital and Ribbit Capital, and recently completed a Series C funding round.  We’re looking for a top Quantitative Engineer to join our talented team. You'll help us build a new future for wealth management. You will partner closely with our engineering team and work with our Chief Investment Officer to build sophisticated investment models to shape our portfolio construction and portfolio insights.  You will be responsible for writing production ready models (in Python) and work with our team to apply quantitative techniques like machine learning and sentiment analysis to a vast array of data sets. You should also expect to stay up to date on the latest research papers and techniques in your field. You should feel comfortable reimagining investment management and questioning every market assumption.  You should thrive in a creative, inventive, and fast-paced startup environment and want to work with people who are passionate about our work and mission. The problem we’re trying to solve as an organization is dynamic and each day brings fresh and exciting challenges. We're interested in people who will react quickly and efficiently when called upon to change or pivot.  Our HQ office is located in One World Trade in NYC, which is now open for anyone who chooses to go in. We will continue to be remote-optional until September 30, 2021. We will monitor Covid-19 trends to ensure the safety of our employees. Vise celebrates and embraces diversity and is committed to building a team that represents a variety of experiences, backgrounds, and skills. We do not discriminate on the basis of race, color, religion, marital status, age, gender identity, gender expression, sexual orientation, non-disqualifying physical or mental disability, national origin, veteran status, or other applicable legally protected characteristics.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:18:34.000Z"
  },
  "company": {
    "name": "Vise",
    "link": "https://www.linkedin.com/company/viseinc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}