{
  "job": {
    "title": "Machine Learning Engineer - Radar (TOP SECRET Clearance rqd)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "If you are a Machine Learning Engineer with active Top Secret Clearance, please read on!  Top Reasons to Work with Us  We have a small company culture and offer extremely competitive compensation packages, including generous retirement package, company-paid PPO health insurance, generous vacation policy, and a company-wide bonus plan.  We have exciting contracts and projects with US government agencies, working on the bleeding edge of Deep Learning and Machine Learning technology.  You will work closely with a small team of leading Engineers and Scientists in this space, solving complex challenges and delivering solutions that ensure out country's security!  What You Will Be Doing  The core challenges of this role revolves around Machine Learning and Deep Learning applied to Synthetic Aperture Radar data  You'll be doing Object Detection and Classification, as well as Geolocation  What You Need for this Position At Least 3 Years of experience and knowledge of some of the following: What's In It for You So, if you are a Machine Learning Engineer with a current Top Secret Clearance, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Richard.Marion@Optello.com Richard Marion - Recruiting Manager - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:12:24.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "El Segundo",
    "region": "CA",
    "postal_code": "90245",
    "street_address": null,
    "latitude": 33.92086,
    "longitude": -118.41595
  }
}