{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Are you a Data Scientist ready to help a dynamic, security-focused SaaS and IoT company in Bethesda, MD execute our ambitious data analysis roadmap on our security-oriented IoT solutions? The data science team uses AI and ML to develop new value propositions for the Brivo platform.  Are you someone who has a love for applying statistical techniques to data and a talent for finding nuances and trends in large datasets? With a 15+ years record of innovation and industry leadership, Brivo is a self-sustaining high-growth company that develops both the software and connected device components for our service offerings. We are currently serving over 40,000 B2B clients worldwide with a significant push towards further expansion.  In this role you will also be expected to: Brivo is the global leader in mobile, cloud-based access control for commercial real estate, multifamily residential, and large distributed enterprises. Our comprehensive product ecosystem and open API provide businesses with powerful digital tools to increase security automation, elevate employee and tenant experience, and improve the safety of all people and assets in the built environment. Having created the category over twenty years ago, our building access platform is now the digital foundation for the largest collection of customer facilities in the world, trusted by more than 25 million users occupying over 300M square feet of secured space in 42 countries.  Our dedication to simply better security means providing the best technology and support to property owners, managers, and tenants as they look for more from buildings where they live, work, and play. Our comprehensive product suite includes access control, smart readers, touchless mobile credentials, visitor management, occupancy monitoring, health and safety features, and integrated video surveillance, smart locks, and intercoms. Valued for its simple installation, high-reliability backbone, and rich API partner network, Brivo also has the longest track record of cybersecurity audits and privacy protections in the industry.  Brivo is privately held and headquartered in Bethesda, Maryland. Learn more at Powered by JazzHR  fIARV8h0J4",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-17T07:07:40.000Z"
  },
  "company": {
    "name": "Brivo",
    "link": "https://www.linkedin.com/company/brivo-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 180,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Bethesda",
    "region": "MD",
    "postal_code": "20894",
    "street_address": null,
    "latitude": 38.984856,
    "longitude": -77.09269
  }
}