{
  "job": {
    "title": "Embedded Software Development Engineer",
    "industry": "Mechanical or Industrial Engineering,Aviation &amp; Aerospace,Airlines/Aviation",
    "description": "The Software Developer is responsible for designing , developing and testing Embedded Software (Firmware), platforms and systems that control and runs on devices that need to be tailored to the needs of the hardware that it has to control and run on (i.e. directly controls the real time functions of a physical device such as motors, alternators, engines, valves, fans, and other devices and products). Typically requires a deep understanding of the characteristics of the physical device being controlled, the real-time functions it is expected to perform and the ability to design, develop, implement, and test the logic and software required to realize the real-time functionality. Experience with C programming language  Experience in a development role for a DO-178B/C project  Strong oral and written communication skills.  Experience in full life cycle software development  Ability to document, plan, market, and execute programs. Established project management skills.  Real-time Operating Systems and Hypervisor technologies knowledge. Xilinx Standalone operating environment experience .  Network driver experience applied to different commercial embedded real-time operating systems.  Experience in a development role for a DO-178B/C project  Lean Six Sigma Green Belt or higher (GE Employees only)  Experience in full life cycle software development  Experience in working with a global development team including both GE and Preferred Suppliers  Proven track record of accomplishments and meeting cost / schedule targets  Ability to interface effectively with all levels of the organization Legal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job opening  Ability & Willingness to obtain and maintain DoD Security Clearance  This role is restricted to U.S. Citizens due to access to export-controlled technology. GE will require proof of status prior to employment  Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable). GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer . Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.  GE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable). Yes",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T02:05:04.000Z"
  },
  "company": {
    "name": "GE Aviation",
    "link": "https://www.linkedin.com/company/geaviation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 71000,
    "max_value": 113000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Grand Rapids",
    "region": "MI",
    "postal_code": "49516",
    "street_address": null,
    "latitude": 42.96546,
    "longitude": -85.67017
  }
}