{
  "job": {
    "title": "Senior Data Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "52966 Our client is hiring a Senior Data Engineer for their team in Beaverton, Oregon. They are looking for strong experience in Python, AWS, Machine Learning/Data Science, CI/CD integration and the ability work with cross functional team. The work will also involve building and incorporate automated unit and integration tests into the Data science platform. Programming: Python.  AWS: at least 2 years.  Experience building Machine Learning/Data Science applications.  Understanding of data structures, data modeling and software architecture on cloud based infrastructure.  Experience with technologies like Kubernetes, Docker, Jenkins, Terraform.  Big Data / Hadoop: 2 years, experience with Spark.  Agile/Kanban/Scrum experience.  Demonstrated communication and interpersonal skills.  Ability to work well and thrive in a fast-moving culture with complex technology applications.  BS in Computer Science or related field Benefits are available to eligible VanderHouwen contractors and include coverage for medical, dental, vision, life insurance, short and long term disability, and matching 401k. VanderHouwen is an award-winning, Women-Owned, WBENC certified professional staffing firm. Founded in 1987, VanderHouwen has been successfully placing experienced professionals throughout the Pacific Northwest and nationwide. Our recruitment teams are highly specialized in either Technology and IT, Engineering, or Accounting and Finance career markets. Our recruiters value building meaningful, professional relationships with each candidate as well as developing honed knowledge of companies' staffing needs and workplaces. Partner with us to land your next exciting career.  VanderHouwen is an Equal Opportunity Employer and participates in E-Verify. VanderHouwen does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or any other characteristic protected by applicable local, state or federal civil rights laws.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T23:42:33.000Z"
  },
  "company": {
    "name": "VanderHouwen",
    "link": "https://www.linkedin.com/company/vanderhouwen"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Beaverton",
    "region": "OR",
    "postal_code": "97007",
    "street_address": null,
    "latitude": 45.486595,
    "longitude": -122.795616
  }
}