{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Infosys is seeking a . We are looking for a candidate who is DevOps professional with relevant experience in system administration and software engineering. The candidate will be helping to build and operate complex systems, which are huge, mission-critical n-tier, and microservice architecture. (SRE) with a robust and diverse background will be responsible for managing applications and infrastructure for our client. Designing and implementing the Software and Infrastructure Development Lifecycle (SDLC and IDLC) with a focus on automation, reliability, high availability, and system integration. The location for this position is . This position may require travel. Infosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation.  With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T16:25:27.000Z"
  },
  "company": {
    "name": "Infosys",
    "link": "https://in.linkedin.com/company/infosys"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 132,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Evansville",
    "region": "IN",
    "postal_code": "47744",
    "street_address": null,
    "latitude": 37.975708,
    "longitude": -87.56991
  }
}