{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Consumer Goods,Retail",
    "description": "Purple is a digitally-native vertical brand with a mission to help people feel and live better through innovative comfort solutions. To us, comfort means more than great products, it means empowering every employee to feel comfortable being themselves. We believe your career at Purple will be a one-of-a-kind “Career in Comfort” because our workforce is one-of-a-kind. We are committed to a culture of collaboration where every voice is heard and understood. As an innovation company at our core, we believe a diversity workforce brings better insights, solutions and products and serves as the backbone to bettering our company. Join with us as we add to our team of exceptional individuals who will help us take over the world — one mattress at a time. We are the Purple Innovations Team. We are a fast-growing group of technical experts, product innovators, and creative problem solvers. Our mission is simple; drive measurable business value by iterating designs, testing hypothesis, and delivering complete product definition to deliver compelling and truly innovative products that create Purple customers for life. We are looking for an experienced software engineer who is organized in thought and process and well experienced in electronics IoT products. In this role, you will design applications that run on AWS backend for Purple products, as well as additional custom software applications to support Purple products. You will be working closely with embedded electronics engineers. You will work on multiple projects in parallel.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T03:55:43.000Z"
  },
  "company": {
    "name": "Purple",
    "link": "https://www.linkedin.com/company/purple-innovation-llc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Tallahassee",
    "region": "FL",
    "postal_code": "32308",
    "street_address": null,
    "latitude": 30.44074,
    "longitude": -84.27833
  }
}