{
  "job": {
    "title": "AP Researcher",
    "industry": "Marketing and Advertising,Computer Software,Hospital &amp; Health Care",
    "description": "Apex System has an immediate need for an AP Researcher. Our client is seeking interim support to support its Procure to Pay process, with primary focus in managing Accounts Payable Function. The AP Researcher is responsible for solving complex problems preventing the payment of invoices through the application of broad knowledge of theories and principles utilized to solve Accounts Payable backlog, SOX requirements and business process optimization. Late evenings and/or weekend work is required at times. If interested or would like more information please send your updated resume to kgubler@apexsystems.com Manage and track unpaid supplier invoices Understand and ensure all accounting interdependences such cost accounting, customer billing and CIP Manage supplier communication and statement validations Coordinate with the vendor and Purchasing to ensure required PO changes are implemented in a timely basis Identify, design and coordinate implementation of business process optimization by leveraging best practices and automation Requires flexible workhours, weekend and nights may be required to meet deadlines Reconcile required balance sheet reconciliations Coordinate within AP Team to ensure supplier invoice payment process is consistently followed Ensure SOX requirements for 3-way and 2-way matching requirements are consistently being followed Provide audit support as needed Coordinate with Cost Accounting, CIP and Customer Billing to ensure all interdependences are communicated Coordinate with AP Manager on specific supplier payments as needed Coordinate with Supply Chain, Purchase Requesters, Procurement on PO to invoice research findings Have excellent understanding and knowledge Procure to Pay process Experienced with suspension and adherent cell cultures Bachelor's Degree in accounting required CPA preferred 7 plus years of Senior Accountant level experience ERP implementation experience a plus Advanced excel & strong analytical skills requried Ability to juggle multiple competing priorities Experience in Accounts Payable management/oversight desired Proven ability to work both independently and collaboratively with different levels of employees and management Effective communication EEO Employer Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystemsinc.com or 844-463-6178. VEVRAA Federal ContractorWe request Priority Protected Veteran & Disabled Referrals for all of our locations within the state.We are an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other protected characteristic. The EEO is the Law poster is available here.PDN-93e75733-6bdb-4712-8b63-8085421e3a26",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:43:14.000Z"
  },
  "company": {
    "name": " Professional Diversity Network",
    "link": "https://www.linkedin.com/company/prodivnet"
  },
  "education": {
    "required_credential": "high school"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Harmans",
    "region": "MD",
    "postal_code": "21077",
    "street_address": null,
    "latitude": 39.159916,
    "longitude": -76.698814
  }
}