{
  "job": {
    "title": "Software Delivery Software Engineer",
    "industry": "Wireless,Information Technology and Services,Telecommunications",
    "description": "At AT&T we’re redefining the future of connectivity. At our core is a passion to serve our customers with products and services that create connections, improve lives and allow millions to share the stories and experiences that matter. Our Corporate teams are fueled by innovation and a desire to connect the world in meaningful ways. Join our team and bring your bold ideas, supporting and transforming our business across areas like engineering, marketing, finance and more.  As a Software Engineer on our Software Delivery Services (SDS) team, you’ll oversee the delivery process of software applications and services as well as the design, development, testing, and deployment. You’ll collaborate to gather and review software requirements and user stories, provide estimates, create software design specifications and work with engineers and architects to assess and test hardware and software interactions. In this role, you’ll also support applications, the software deployment process and solve both configuration and environment issues. Have 5+ years of experience? Our Software Delivery Services team has additional opportunities based on previous experience. A career with us, a global leader in communications and technology, comes with big rewards. As part of our team, you’ll lead transformation surrounded by trailblazing industry leaders like you. You’ll be empowered to go above and beyond – making a difference through company-sponsored initiatives or connecting and networking through one of our many employee groups. And regardless of where you’re at in your career trajectory, you’ll be rewarded by the impact that comes with making a difference in the lives of millions. With AT&T, you’ll be a part of something greater, do incredible things and be rewarded with a chance to change the world.  Ready to join our team? Apply today!  JobCategory:Technology",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:36:13.000Z"
  },
  "company": {
    "name": "AT&amp;T",
    "link": "https://www.linkedin.com/company/att"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}