{
  "job": {
    "title": "Lead Innovative Software Engineer - Innovation Labs",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "Are you passionate about applying emerging technologies to solve customer problems? Lowe’s Innovation Labs is what’s next for home improvement retail. With a focus on emerging technologies – ranging from 3D visualization to mixed reality to robotics to things we can’t talk about right now – our team accelerates the experiences that customers expect today and develops the capabilities that power tomorrow.  We are seeking experienced Full Stack Software Engineers to focus on solving unique and complex technical problems that face our internal and external customers. Software Engineers on our team prototype new ideas, build innovative experiences at scale, and enhance existing products. Our team is building the next-generation of products that empower home improvement customers and transform home improvement retail. Join us!  This position is full-time and based in our Kirkland, WA office. The primary purpose of this role is to provide consultation and technical direction on translating business requirements and functional specifications into logical program designs. This includes facilitating the implementation and maintenance of complex business and enterprise software solutions to ensure successful deployment of released applications. This role serves as a technical expert for project teams throughout the implementation and maintenance of business and enterprise software solutions. In addition, this role personally develops and delivers code modules, stable application systems, and integrated enterprise software solutions within various computing environments. Lowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 18 million customers a week in the United States and Canada. With fiscal year 2019 sales of $72.1 billion, Lowe’s and its related businesses operate or service more than 2,200 home improvement and hardware stores and employ approximately 300,000 associates. Based in Mooresville, N.C., Lowe’s supports its hometown Charlotte region and all communities it serves through programs focused on creating safe, affordable housing and helping to develop the next generation of skilled trade experts. For more information, visit Lowes.com. As a FORTUNE® 50 home improvement company, Lowe’s is committed to creating safe, affordable housing and helping to develop the next generation of skilled trade experts through nonprofit partnerships. Across every community we serve, Lowe’s associates donate their time and expertise through the Lowe’s Heroes volunteer program. For the latest news, visit Newsroom.Lowes.com or follow @LowesMedia on Twitter.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:39:23.000Z"
  },
  "company": {
    "name": "Lowe's Companies, Inc.",
    "link": "https://www.linkedin.com/company/lowe%27s-home-improvement"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Kirkland",
    "region": "WA",
    "postal_code": "98034",
    "street_address": null,
    "latitude": 47.675507,
    "longitude": -122.20336
  }
}