{
  "job": {
    "title": "Azure Data Scientist, Senior, Tech Consulting",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all. EY delivers unparalleled tech consulting services in data strategy, big data engineering, business intelligence, digital, machine learning and Artificial Intelligence. We help clients understand, architect, select and implement leading-edge solutions to drive their business. We leverage leading practices and a high degree of business acumen that has been compiled over years of experience to deliver the highest level of execution and satisfaction for our clients. Our approach is focused on analyzing business needs and making sure that the solutions delivered meet our client’s goals. EY is investing significantly in the build out of Data and AI services that leverage Microsoft Azure. This is a rapidly growing area, and you will have the opportunity to lead and develop your skill set to keep up with the ever-growing demands of the data science landscape. As a key leader within the firm, you will help our clients navigate the complex world of modern data science and analytics. You will provide our clients with a unique perspective on how data science and analytics can transform & improve their entire organization – starting with key business issues they face. This is a high growth, high visibility area with plenty of opportunities to enhance your skillset and build your career. As an Azure Data Scientist, Senior, you will be focusing on developing solutions and working in client engagement teams, working with a wide variety of clients to deliver tech consulting services with a focus on designing and building machine learning models. We’re interested in passionate leaders with strong vision and a desire to stay on top of trends in the Data and AI industry. We want a customer-focused professional who is motivated to drive the creation of great enterprise products and who can collaborate and partner with other product teams, and engineers. If you have a genuine passion for helping businesses achieve the full potential of their data, this role is for you. We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. If you can demonstrate that you meet the criteria above, please contact us as soon as possible.  The exceptional EY experience. It’s yours to build. EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.  Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.  Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.  EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:19:34.000Z"
  },
  "company": {
    "name": "EY",
    "link": "https://uk.linkedin.com/company/ernstandyoung"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10011",
    "street_address": null,
    "latitude": 40.74102,
    "longitude": -73.99956
  }
}