{
  "job": {
    "title": "Software Development Engineer - Test (SDET)",
    "industry": "Electrical/Electronic Manufacturing",
    "description": "We’re looking for a to join our Philips Hue Partnerships & Entertainment Engineering Team in Palo Alto, California.  Working for Signify means being creative and adaptive. Our culture of continuous learning and commitment to diversity and inclusion creates an environment that allows you to build your skills and career. Together, we’re transforming our industry.  As the world leader in lighting, we’re constantly ahead of the curve. Through our leadership in connected lighting and the Internet of Things, we’re breaking new grounds in data analytics, AI, and smart homes, offices, cities and more!  Signify is one of the few companies in the world to achieve carbon neutrality and our next sustainability goals are even bolder: doubling our positive impact on the environment and society by 2025.  As a Software Development Engineer - Test, you’ll be responsible for End2End CI/CD (Continuous Integration and Continuous Delivery/Deployment) and test automation of these products, with a focus on API-based integration testing of the device firmware and Cloud backends.  By joining the global Philips Hue business, you’ll be working on the world’s leading internet connected home lighting system, which is changing the way people interact and experience lighting. The Hue ecosystem is expanding rapidly through new lights, accessories, and exciting new use-cases such as using lighting to make your home more secure or create an immersive home theater experience.  We are a small fast-growing multi-disciplinary engineering team in the Bay Area with the large responsibilities to create and maintain Philips Hue partnership integrations and Hue Entertainment products. We develop first-of-a-kind products that can synchronize lighting with games, movies, and music, and we build integrations with products from other leading Smart Home and Entertainment companies.  We’re on the lookout for forward-thinking innovators with a passion for IoT, Smart Home and Entertainment, who are excited to help us build the next level home lighting experience. If you match this description, get in touch!  What you’ll do Who we are  Signify is the world leader in lighting. We provide professional customers and consumers with quality, energy-efficient LED lighting. And our lights, when connected, bring data to devices, apps and people – redefining what light can do and how you use it. Today, our innovations, such as Philips Hue, LiFi – internet connectivity through light – and UV-C, solar and horticultural lighting, contribute to a safer, smarter, more sustainable world. Signify is one of the few companies in the world to achieve carbon neutrality and our next sustainability goals are even bolder: doubling our positive impact on the environment and society by 2025. We’re operating in 74 countries with 32,000 people worldwide.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:11:20.000Z"
  },
  "company": {
    "name": "Signify",
    "link": "https://nl.linkedin.com/company/signifycompany"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}