{
  "job": {
    "title": "Staff Software Engineer",
    "industry": "Information Technology and Services,Telecommunications",
    "description": "At Nokia, we create technology that helps the world act together.  As a trusted partner for critical networks, we are committed to innovation and technology leadership across mobile, fixed, and cloud networks. We create value with intellectual property and long-term research, led by the award-winning Nokia Bell Labs. Adhering to the highest standards of integrity and security, we help build the capabilities needed for a more productive, sustainable, and inclusive world.  Watch our video to discover how we create meaningful interactions to drive human progress. The mission of the Network Infrastructure (NI) Business Group is to be the most trusted partner for the world’s most critical network infrastructure. NI will respond to the ever-increasing demand for networks with higher capacity, greater reliability, faster speeds, and lower costs. At Nuage Networks we shape the transformation of Enterprise and Telecommunications networks through Software Defined Networking (SDN). The candidate will be responsible for full life cycle development of features associated with future releases of the Nuage VNS SD-WAN solution. Imagine creating technology that has the potential to change the world. Working with us, you will have a positive impact on people’s lives and help to overcome some of the world’s most pressing challenges. We act inclusively and respect the uniqueness of people.  Nokia is an equal opportunity employer that is committed to diversity and inclusion. At Nokia, employment decisions are made regardless of sex, gender identity or expression, sexual orientation, race, ethnic origin, color, creed, religion, national origin, citizenship, age, marital status, physical or mental disability, genetic information or ancestry, protected Veteran or military status, or other characteristics protected by law. Nokia culture welcomes people as their true selves. Come create technology that helps the world act together. Software - Applied R&D Engineer North Americas-United States-North Carolina-Raleigh Full-time",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:08:47.000Z"
  },
  "company": {
    "name": "Nokia",
    "link": "https://fi.linkedin.com/company/nokia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Raleigh-Durham-Chapel Hill Area",
    "region": null,
    "postal_code": "27603",
    "street_address": null,
    "latitude": 35.817448,
    "longitude": -78.27004
  }
}