{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Hardware",
    "description": "As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. The Data Scientist is a role for quantitatively adept people with accompanying business skills. A solid foundation typically in statistics, modeling, operations research, computer science and applications, and math. What sets the data scientist apart is strong business acumen, coupled with the ability to communicate findings to both business and IT leaders in a way that can influence how an organization approaches a business challenge. Data Scientists will not just address business problems, they will pick the right problems that have the most value to the organization.  The Data Scientist is effective at deploying an analytics solution, thereby realizing business value. Whereas a traditional data analyst may look only at data from a single source – a CRM system, for example – a data scientist will most likely explore and examine data from multiple disparate sources. They will extract, transform, and combine all incoming data with the goal of discovering a previously hidden insight, which in turn can provide a competitive advantage or address a pressing business problem.  The Data Scientist does not simply collect and report on data, but also builds statistical models, determines what it means, then recommends ways to apply the data. Data scientists are inquisitive: exploring, asking questions, doing \"what if\" analysis, questioning existing assumptions and processes. Armed with data, modeling expertise, and analytical results, a top-tier data scientist will then communicate informed conclusions and recommendations across an organization's leadership structure.  The Data Scientist will help transform clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. They will be responsible for expanding and optimizing data models, prediction algorithms correlation algorithms as well as text analytics models. The right candidate will be excited and self directed in teaming and providing solutions to business problems. Minimum 5-7 years of experience manipulating data sets and building statistical models.  Using statistical computer languages (R, Python, SQL, etc.) to manipulate data and draw insights from large data sets.  Creating and using advanced machine learning algorithms and statistics such as regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.  Leveraging open-source distributed data processing frameworks.  Utilizing Information Retrieval and relevant tools Conducting projects from requirements generation, annotation, and modeling, through NLP output deliverables and management of internal/external clients  Exploiting visualizing and narration in presenting data to stakeholders  Presenting complex data science processes/information to non-data scientists. In October 2020, IBM announced its intention to separate the IT Infrastructure Services unit of its Global Technology Services division into a new, separate public company, creating two industry-leading companies – IBM and Kyndryl. The spin-off is expected to be completed by the end of 2021. To find out more about Kyndryl, including information relating to privacy, please visit Kyndryl.com. Our world has never been more alive with opportunities – we need to be ready to seize them. At Kyndryl, we are committed to the health and continuous improvement of the systems at the heart of the digital economy. Our people are at the center, discovering, co-creating, and strengthening. We push ourselves and each other to seek better, to go further, and we carry this energy to our customers. We work flexibly, side-by-side, listening and learning at every step. A healthy digital ecosystem doesn’t just benefit our customers and partners; it provides oxygen to innovation and energy to change the world over, furthering human progress every day. Together, let’s make sure our world thrives. In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to  IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. We consider qualified applicants with criminal histories, consistent with applicable law. Kyndryl is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. Kyndryl is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:00:00.000Z"
  },
  "company": {
    "name": "IBM",
    "link": "https://www.linkedin.com/company/ibm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}