{
  "job": {
    "title": "Site Reliability Engineer (SRE) - Cloud Technologies",
    "industry": "Consumer Electronics",
    "description": "Apple Cloud Technologies is centralized organization to enable 3rd party cloud access and adoption across Apple. You will partner with developers, system and site reliability engineers and adopters to understand their challenges, work through their issues and provide solutions that can be adopted widely.  The ideal candidate is someone with a proven track record, sound technical knowledge and skills in delivering large scale complex software solutions deployed on 3rd party cloud (e.g. AWS, GCP).   This role will be responsible for designing, building, running, and monitoring public cloud infrastructure to support a variety of mission critical services. This is a highly technical, hands-on role that requires expertise supporting systems at enterprise scale. The candidate will deliver innovative solutions in key areas:   Engineering - Continuously optimize secure, scalable and performant security tools and service.   Reliability - Drive fault detection and correction, performance and uptime at global scale.   Monitoring - Instrument systems to gain visibility and understanding of how they are performing at any time   Automation and orchestration to enable       * Accelerated infrastructure, application and software configuration deployment      * Automated response to alerts or indicators of performance issues      * Infrastructure as code 5+ years of experience in Software Engineering and Systems Engineering to manage operations.  Experience supporting infrastructure and services in public and private cloud environments (AWS, GCP, OpenStack).  Proficient with various programming languages such as Python/Java/Ruby/Perl/Go/Makefile for building automation or integration with APIs.  Experience with common formats such as JSON, YAML and compression utilities.  Expertise with monitoring or log aggregation tools (Prometheus, Grafana, Splunk, ELK)  Expertise in key SRE Skills (Scalability, Reliability and Observability).  Familiarity with CI/CD tools and deployment processes.  Solid understanding and experience with centralized configuration management, coordination and provisioning technologies, such as Ansible, Chef, Puppet.  Experience implementing and working with open source frameworks.  Excellent communication skills, must be capable of working with cross functional technical and business teams and varying levels of management.  Understanding of Agile methodologies like Scrum and be able to work in fast-paced environment.  Strong project management skills, including excellent presentation skills,  Must be capable of writing detailed solution specifications, diagrams, best practices/standards documentation, operating procedures, test plans/test reports.  Solid understanding Linux/Unix system internals, including kernel tuning.  Failure Testing and Chaos Engineering.  Working knowledge of network protocols and network based services, including routing and network load balancing.  Experience with virtualization technologies.  Solid understanding of storage systems, including network filesystems.  Experience building and supporting containerized applications on various platforms like GKE, EKS, ECS. Be part of an engineering team scaling the core cloud platform for thousands of applications in a secure manner, focusing on automation of operations and high availability.    You will be a proactive hands-on engineer automating operations, improve platform features and observability and strategist in key design and architecture initiatives with a broad knowledge in cloud and operational excellence.    Responsibilities include:   * Engineer and support cloud platform IaaS and PaaS services.   * Partner with application teams to provision scalable workloads reliably across distributed compute resources.   * Provide engineering and operational support for distributed systems and network based information security tools, including for configuration management and provisioning.   * Implement and maintain security controls.   * Work closely with development teams to understand application performance and behavior patterns to proactively monitor, tune and correct issues before they occur.   * Identify opportunities to improve security tooling reliability, performance and security.   * Develop tools and automation to eliminate manual and repetitive efforts. Bachelor of Science in Computer Science or equivalent experience 4+ years    Role Number: 200259685",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-21T14:50:01.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 80100,
    "max_value": 157000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}