{
  "job": {
    "title": "Sr Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Tustin, CA - Are you looking to grow with a company? Are you looking for a team with great collaborative culture? Here at Zigzy, we value culture and team dynamics that will be able to help you advance in your career, while you explore all the different technologies we offer here. Our developers focus on developing our Zigzy mobile apps and web technology solutions. By having a clear understanding of product requests, collaborating with our product team and designers, and provide solutions to our business problems, this role will provide insights in our development efforts. We're expecting this candidate to be able to make independent decisions, and use their creativity to solve different problems, and most important of all, have fun with the team here! Must be able to verify identity and employment eligibility to work in the U.S. This job profile is not intended to be an all-inclusive list of job duties and responsibilities, as one may perform additional related duties as assigned in order to meet the needs of the organization. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Must be able to lift up to ten pounds. Primary functions require sufficient physical ability and mobility to work in an office setting; to stand or sit for prolonged periods of time; to occasionally stoop, bend, kneel, crouch, reach, and twist; to lift, carry, push, and/or pull light to moderate amounts of weight; to operate office equipment requiring repetitive hand movement and fine coordination including use of a keyboard; and to verbally communicate to exchange information. VISION: See in the normal visual range with or without correction. HEARING: Hear in the normal audio range with or without correction.  [EOE/M/F/D/V. Drug-free workplace.]",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T02:58:24.000Z"
  },
  "company": {
    "name": "Zigzy",
    "link": "https://www.linkedin.com/company/zigzy"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Tustin",
    "region": "CA",
    "postal_code": "92781",
    "street_address": null,
    "latitude": 33.742073,
    "longitude": -117.81977
  }
}