{
  "job": {
    "title": "Backend Software Development Senior/Lead/Principal Engineer",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology Note: By applying to the Software Backend Development posting, recruiters and hiring managers across the organization hiring Software Engineers will review your resume. Our goal is for you to apply once and have your resume reviewed by multiple hiring teams.  Salesforce has immediate opportunities for talented software developers who want their lines of code to have significant and measurable positive impact for users, the company's bottom line, and the industry. You will be working with a group of world-class engineers to build the breakthrough features our customers will love, adopt, and use while keeping our trusted CRM platform stable and scalable. The software engineer role at Salesforce encompasses architecture, design, implementation, and testing to ensure we build products right and release them with high quality.  We pride ourselves on writing high quality, maintainable code that strengthens the stability of the product and makes our lives easier. We embrace the hybrid model and celebrate the individual strengths of each team member while cultivating everyone on the team to grow into the best version of themselves. We believe that autonomous teams with the freedom to make decisions will empower the individuals, the product, the company, and the customers they serve to thrive.  Your Impact Salesforce information  We are Salesforce Engineering  Salesforce Ohana Culture  Salesforce Engineering behind the cloud and are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. and do not accept unsolicited headhunter and agency resumes. and will not pay any third-party agency or company that does not have a signed agreement with or .  Salesforce welcomes all.  Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:23:48.000Z"
  },
  "company": {
    "name": "Salesforce",
    "link": "https://www.linkedin.com/company/salesforce"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Rhode Island",
    "region": "United States",
    "postal_code": "02893",
    "street_address": null,
    "latitude": 41.628292,
    "longitude": -71.51881
  }
}