{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Banking,Financial Services,Information Technology and Services",
    "description": "61943 Tulsa Tulsa OK Digital Technology; Commercial Banking Headquartered in Tulsa, Oklahoma, BOK Financial Corporation (NASDAQ: BOKF) is a top 25 U.S.-based financial services holding company with operations in ten states – Oklahoma, Texas, Arkansas, Arizona, Colorado, Kansas/Missouri, New Mexico, Nebraska and Wisconsin. The company began more than 100 years ago in Tulsa and has successfully diversified into a variety of industries, businesses and geographies. . Discretionary At BOK Financial, our success starts with our incredible talent. We need an experienced problem solver like yourself to join our DevOps group as a Site Reliability Engineer. We're building a culture where amazing people (like you) can bring their best, be their best, and work for the best. The Site Reliability Engineer combines software and systems engineering to design, build, and maintain large scale systems within our Digital Solutions group. You will be responsible for the health of our digital applications in production. You will lead the organization within the five pillars of IT: 1) Strategy, 2) Project Execution, 3) Financial Planning/Non-Stop Operations, 4) Process Improvement/Governance, and 5) Talent. Your goals and objectives will tie back directly to these pillars. You will be part of an exciting and ongoing digital transformation within BOK Financial with a long-term focus. Your role will be to solve problems, empower others, envision and achieve change, and positively impact the organization. Additionally, you can continue to develop as a technical expert across various roles by leveraging internal career advancement opportunities or prepare for a transition into management. The decision is yours! Our mission is to “Enable Business Success and Create Raving Fans.” We do this through our shared quest to continuously improve while finding ways to optimize our applications and processes. Team members support one another and jump in to help when necessary. We are a committed, intelligent, and collaborative group that is eager to welcome you to the team. ANALYTICAL SKILLS: You must have experience developing tools, systems and processes aimed at product supportability.  TECHNICAL SKILLS: You must be able to employ RDBMS principles in the design of complex data structures and preferred proficiency with Java, Python, Linux, scripting, network monitoring, SSIS, MS SQL Server, Tomcat, IIS, and AWS.  RELATIONSHIP BUILDING: You must be able to relate to any audience and build trust by leveraging strong interpersonal skills and a high level of integrity.  PROJECT MANAGEMENT: Effectively prioritizing tasks is a must. Experience in project management is essential. Knowledge of Scrum and Agile methodologies will set you up for success.  COMMUNICATION: You’ll need exceptional verbal and written communication to express yourself clearly and concisely to internal and external audiences. This level of knowledge is normally acquired through completion of a Bachelor’s Degree in Business, Computer Technology/Science, or a related field and 8+ years of directly related professional experience or equivalent combination of education and experience. is a stable and financially strong organization that provides excellent training and development to support building the long term careers of our employees. and take the first step towards your next career opportunity!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T05:10:06.000Z"
  },
  "company": {
    "name": "BOK Financial",
    "link": "https://www.linkedin.com/company/bok-financial"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Tulsa",
    "region": "OK",
    "postal_code": "74116",
    "street_address": null,
    "latitude": 36.155327,
    "longitude": -95.99208
  }
}