{
  "job": {
    "title": "DevOps/Site Reliability Engineer",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Instana, Cloudwatch, ELK, Prometheus, Influx, Grafana Pagerduty Terraform, Cloudformation Lambda, EKS, ECS, EC2, DynamoDb, AuroraDb, Kinesis, SNS, SQS, Redshift, API Gateway, Cloudfront, S3, IAM Cloudflare GitHub Actions, Jenkins, Teamcity GitHub JIRA, Confluence, GitHub uShip’s Site Reliability Engineers integrated with software agile teams, solving challenging problems in the logistics e-commerce space. We are looking for an engineer to help ensure the reliability of our next wave of products. Ideal candidates want to deeply understand how our systems work from the infrastructure level, their dependencies to other systems, how to mitigate risk, and develop strategies for service failover. You’ll be building the foundation that enables us to empower the logistics landscape and help customers all over the world. uShip offers big-company benefits in a small-ish sized company because we really value and are committed to our people. There are even some extras that will surprise you. uShip is the world’s first and largest shipping marketplace, making it quicker, easier, and more affordable to ship large or bulky items. Consumers and businesses can compare and book bids from hundreds of thousands of customer-reviewed transportation service providers, ranging from independent owner-operators to the largest freight carriers and brokers. From cars to cranes and furniture to freight, our straightforward and transparent platform helps people, businesses, e-commerce sellers, and multinational logistics companies ship with greater speed and efficiency. Customers save money and service providers make money using their empty cargo space – everyone wins! We welcome diversity in all its forms, and believe we’re better collaborators, strategizers, and thinkers because of it. We show pride in our community by giving back and working with local charities. uShip is an equal opportunity employer. We are inspired to find candidates who embody our Core Values. uShip prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, gender identity, age, parental status, national origin, disability, or veteran status. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-27T00:00:00.000Z"
  },
  "company": {
    "name": "uShip",
    "link": "https://www.linkedin.com/company/uship"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}