{
  "job": {
    "title": "Tech Data Engineer - Automation &amp; Data Prep",
    "industry": "Banking,Financial Services,Investment Banking",
    "description": "237234BR Weehawken, United States - New Jersey Full Time Are you passionate about technology? Do you have a curious nature, always interested in making improvements and how to innovate? We’re looking for someone with: You’ll be part of the WMA Technology Metrics & Reporting Team in Weehawken, NJ. You'll be an integral part of efforts related to creating dashboards that provide transparency across WMA Technology.  Diversity helps us grow, together. That’s why we are committed to fostering and advancing diversity, equity, and inclusion. It strengthens our business and brings value to our clients. Expert advice. Wealth management. Investment banking. Asset management. Retail banking in Switzerland. And all the support functions. That's what we do. And we do it for private and institutional clients as well as corporations around the world.  We are about 60,000 employees in all major financial centers, in more than 50 countries. Do you want to be one of us? We're a truly global, collaborative and friendly group of people. Having a diverse, inclusive and respectful workplace is important to us. And we support your career development, internal mobility and work-life balance. If this sounds interesting, apply now. UBS is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:01:37.000Z"
  },
  "company": {
    "name": "UBS",
    "link": "https://ch.linkedin.com/company/ubs"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Weehawken",
    "region": "NJ",
    "postal_code": "07086",
    "street_address": null,
    "latitude": 40.770782,
    "longitude": -74.01762
  }
}