{
  "job": {
    "title": "Tax Manager",
    "industry": "Financial Services",
    "description": "Are you interested in joining one of the fastest growing public accounting firms?  Would you like the ability to focus on one industry sector and further become an expert for your clients?  If yes, consider joining Baker Tilly (BT) as a ! This is a great opportunity to be a valued business advisor delivering industry-focused tax advisory and compliance services to middle market clients. You will work side-by-side with firm leadership to serve clients and build the business, having a direct impact on the firm’s success. Additionally, you will be a mentor and coach to a group of talented staff, utilizing your expertise to help develop their technical and professional skills. If you are invigorated by these exciting challenges, then this could be the right opportunity for you! As one of the fastest growing firms in the nation, BT has the ability to offer you upward career trajectory, flexibility in how and where you get your work done and meaningful relationships with clients, teammates and leadership who truly care about you and your development. Baker Tilly US, LLP (Baker Tilly) is a leading advisory, tax and assurance firm, providing clients a genuine coast-to-coast and global advantage with critical mass and top-notch talent in major regions of the U.S. and in many of the world’s leading financial centers - New York, London, San Francisco, Los Angeles and Chicago. Baker Tilly is an independent member of Baker Tilly International, a worldwide network of independent accounting and business advisory firms in 148 territories, with 36,000 professionals and a combined worldwide revenue of $4.0 billion.  Many of Baker Tilly’s roles have the opportunity to work remotely. Please discuss with your talent acquisition professional to understand the requirements for an opportunity you are exploring.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:27:57.000Z"
  },
  "company": {
    "name": "Baker Tilly US",
    "link": "https://www.linkedin.com/company/bakertillyus"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 95800,
    "max_value": 129000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "91371",
    "street_address": null,
    "latitude": 34.167614,
    "longitude": -118.604515
  }
}