{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Internet,Information Technology and Services",
    "description": "SurveyMonkey (Nasdaq: SVMK), is a leader in agile software solutions for customer experience, market research, and survey feedback. Our mission is to power the curious and enable organizations, including 98% of the Fortune 500, to transform feedback into action. Our brand is beloved and well known throughout the world—over 6 billion people have taken a SurveyMonkey survey! Today, more than 17 million active users rely on our platform to measure and understand feedback from employees, customers, website and app users, and the market. And our enterprise-grade products and solutions enable 335,000+ organizations globally to solve daily challenges—from delivering better customer experiences to increasing employee retention. As a member of the new SRE team at SurveyMonkey, you will automate away toil, help teams in AWS, and build tools to make development seamless. The SRE team is embedded amongst several developments that are responsible for some of the most trafficked applications within SurveyMonkey. The SRE team will be fully remote across North American time zones. This role presents a prime opportunity to ensure reliability, maintainability, performance, scalability, and security are at the forefront of our teams’ products. The Senior Site Reliability Engineer will partner with the application development and main infrastructure teams to architect and operate reliable, scalable, and performant services. You will have a huge impact on how we do things and help take our engineering excellence to the next level. You will report to the Senior Manager of Site Reliability Engineering. SurveyMonkey is a place where the curious come to grow. By embedding inclusion into our processes, policies, and culture for our 1,000+ employees across North America, Europe, and APAC, we're building a workplace where people of every background can thrive. We've won multiple awards and received recognition for our forward-looking policies, including extended parental and bereavement leave, vendor benefits standards, unlimited personal time off, flexible work locations, and Take 4 sabbaticals.  SurveyMonkey was recognized by Great Place to Work® and FORTUNE as a top workplace in 2018 and 2019, and we have also won numerous awards as a leader in global survey software, including being named among CNBC's Disruptor 50 and the Forbes Cloud 100. SurveyMonkey is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. Accommodations are available for applicants with disabilities.  Learn more about our diversity, equity, and inclusion efforts here.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T04:14:31.000Z"
  },
  "company": {
    "name": "Momentive.ai",
    "link": "https://www.linkedin.com/company/momentive.ai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}