{
  "job": {
    "title": "Software Developer 3",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Oracle Cloud Infrastructure  OCI Developer Tools  Seattle, WA  Oracle Cloud Infrastructure (OCI) provides the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment. OCI is committed to providing the best in cloud products that meet the needs of our customers who are tackling some of the world’s biggest challenges.  We offer unique opportunities for smart, hands-on engineers with the expertise and passion to solve difficult problems in distributed highly available services and virtualized infrastructure. At every level, our engineers have a significant technical and business impact designing and building innovative new systems to power our customer’s business critical applications  Oracle’s Cloud Infrastructure Group (OCI) is building a new suite of developer tools that operate at scale in a broadly distributed multi-tenant cloud environment. Our customers run their businesses on our cloud, and our mission is to provide them with best in tools to build, test and manage their services in this environment.  We are looking for a Software Development Engineer with cloud services experience to join our Developer Tools team. In this role, you will define, design, implement and support software solutions to enable client teams to build, test and deploy software to the Oracle Cloud. You will partner with other engineering development teams responsible for architecting, designing and managing systems that support our platform. Ultimately, your work will ensure our developer tools are built to exceed our customers’ expectations on quality, security, performance, and fault tolerance.  As an ideal candidate you will have implemented production java services. In addition, you will have an understanding of Linux/Unix fundamentals and will combine this knowledge with your hands on experience in software development - you will champion creating an engineering environment that embodies the best development and testing practices for delivering a high quality service.  These are exciting times in our space - we are growing fast; we are still at an early stage where an individual can have a significant impact. We are working on ambitious new initiatives. If you are passionate about taking ownership of big technical challenges and producing software solutions that have broad, significant impacts - come join our team! As part of Oracle's employment process candidates will be required to complete a pre-employment screening process, after a conditional offer has been extended.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.  Send your resume to Katie.clayman@oracle.com  Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.  As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.  Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:13:17.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}