{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Marketing and Advertising,Computer Software,Financial Services",
    "description": "At Zillow Group, we believe that home matters, and we are on a mission to help everyone get into a home where they can thrive. The process of buying, selling, or renting a home should be easy!  The NLP Applications and Experiences Team is building next-generation AI algorithms and platforms to transform the way real estate works by reducing friction in the home buying, selling and renting process. These algorithms and platforms ingest large volumes of data and process it to build and deploy production models at scale that improve the home buying/selling and renting experience. Our team handles machine learning tasks across the multiple business lines including Premier Agent, Shopping, Rentals and Zillow Offers, absorbing significant amounts of data and building ML and deep learning models to drive transactions and revenue. We are seeking a Machine Learning Engineer to operate in a novel space and craft the next generation of NLP solutions that will lead our vision. In this role, you will be encouraged to think creatively and challenge established assumptions and expectations, not by building on what we already have, but coming up with new insights that fuel innovation. You will build models and insights from data to guide the future of Zillow's businesses and develop highly engaging user experiences.  This role has been categorized as a Remote position. “Remote” employees do not have a permanent corporate office workplace and, instead, work from a physical location of their choice which must be identified to the Company. Employees may live in any of the 50 US States, with limited exceptions. In certain cases, an employee in a remote-designated job may need to live in a specific region or time zone to support customers or clients as part of their role.  In Colorado, the standard pay range for this role is $132,400.00 - $211,600.00 Annually. This range is specific to Colorado and may not be applicable to other locations.  Who you are As a Machine Learning Engineer, you are a roll-up-the-sleeves and get it done practitioner in machine learning or natural language processing. In addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location.  Get to know us  Zillow is reimagining real estate to make it easier to unlock life’s next chapter.  As the most-visited real estate website in the United States, Zillow® and its affiliates offer customers an on-demand experience for selling, buying, renting or financing with transparency and nearly seamless end-to-end service. Millions of people visit Zillow and its affiliate sites every month to start their home search, and now they can rely on Zillow to help them finish it — and no matter what job you're in, you will play a critical role in making this vision a reality.  At Zillow, we're powered by our innovative and inclusive work culture, where everyone has the flexibility, support and resources to do the best work of their careers. Our efforts to streamline the real estate transaction is supported by our passion to redefine the employee experience, a deep-rooted culture of innovation, a fundamental commitment to Equity and Belonging, and . But don't just take our word for it. Read our reviews on and recent recognition from multiple organizations, including: Bloomberg Gender-Equality Index 2021, Human Rights Campaign (HRC) Corporate Equity Index and HRC’s Best Place to Work for LGBTQ Equality 2021, Fortune Best Workplaces for Technology 2020, Fortune Best Workplaces for Millennials 2020, Fortune Best Workplaces for Parents 2020, and the Deloitte Technology Fast 500.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-06T22:56:55.000Z"
  },
  "company": {
    "name": "Zillow",
    "link": "https://www.linkedin.com/company/zillow"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}