{
  "job": {
    "title": "Machine Learning Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "IMPROVE THE RELEVANCE OF THE RETRIEVED DOCUMENTS TO THE INFORMATION NEEDS FOR ATLASSIAN CUSTOMERS UTILIZING ATLASSIAN’S CONFLUENCE, JIRA, JSD, BITBUCKET AND TRELLO PRODUCTS AND PLATFORMS. RESPONSIBLE FOR GROWING ALL ASPECTS OF SEARCH RELEVANCE, QUERY AND INTENT UNDERSTANDING, NATURAL LANGUAGE PROCESSING, DEVELOPING AND DEPLOYING RANKING ALGORITHMS, AND SEARCH RANKING QUALITY EVALUATION. INVOLVED IN END TO END DEVELOPMENT, DEPLOYMENT AND EVALUATION OF RANKING ALGORITHMS THAT WOULD IMPROVE THE SEARCH EXPERIENCE OF THE END CUSTOMERS. UTILIZE KNOWLEDGE OF JAVA TO WORK ON AN IMPORTANT PORTFOLIO OF MACHINE LEARNING PROJECTS WITH A SIGNIFICANT IMPACT ON THE BOTTOM LINE. COMMUNICATE COMPLEX TECHNICAL ISSUES TO A RANGE OF TECHNICAL AND NON-TECHNICAL AUDIENCES. DEVELOP SOFTWARE THAT EMPOWERS THE USERS FROM SMALL STARTUPS TO BIG TECH COMPANIES. BUILD TOOLS LIKE JIRA, CONFLUENCE, BITBUCKET, AND TRELLO TO HELP TEAMS ACROSS THE WORLD BECOME MORE NIMBLE, CREATIVE, AND ALIGNED. WORK DIRECTLY WITH SEARCH RELEVANCE/INFORMATION RETRIEVAL. PERFORM TEXT MINING, INFORMATION RETRIEVAL, KNOWLEDGE EXTRACTION AND BUILD KNOWLEDGE GRAPHS FROM LARGE TEXTS CORPORA. CREATE NEW DATA AGGREGATIONS (FEATURES) WHICH ARE NEEDED TO POWER QUERY REWRITES FROM PRODUCT EVENT DATA. MAINTAIN THE JOB THAT CREATES FEATURES AND ENSURE THE DATA IS UP-TO-DATE (ITERATOR AGE), THE FEATURE VOLUMES ARE CONSISTENT WITH PREVIOUS VOLUMES AND FEATURE VALUES ARE CORRECT (DATA VALIDATION). UTILIZE AWS KINESIS TO READ THE EVENTS, APACHE SPARK TO PERFORM STREAMING AGGREGATIONS AND AWS DYNAMODB TO STORE THE FEATURES. WORK WITH DATA SCIENTISTS TO IMPROVE SEARCH RELEVANCE FROM AN ENGINEERING PERSPECTIVE. ASSIST DATA SCIENTISTS IN SETTING UP REPLICABLE EXPERIMENTS INVOLVING SEARCH SYSTEM CHANGES, USAGE OF LAUNCHDARKLY FEATURE FLAGS AND DATABRICKS FOR EXPERIMENT TRACKING. EXECUTE NATURAL LANGUAGE PROCESSING, TEXT UNDERSTANDING, CLASSIFICATION, PATTERN RECOGNITION, RECOMMENDING, TARGETING AND RANKING SYSTEMS. AUTHOR BLOG POSTS, PAPERS AND PERFORM CONFERENCE TALKS. MASTER’S DEGREE IN COMPUTER SCIENCE OR A CLOSELY RELATED FIELD OF STUDY PLUS TWO (2) YEARS OF SOFTWARE DEVELOPMENT EXPERIENCE WITH JAVA, BUILDING MACHINE LEARNING PRODUCTS, SEARCH RELEVANCE/INFORMATION RETRIEVAL, TEXT MINING, KNOWLEDGE EXTRACTION AND BUILDING KNOWLEDGE GRAPHS FORM LARGE TEXT CORPORA. BACHELOR’S DEGREE IN COMPUTER SCIENCE OR A CLOSELY RELATED FIELD OF STUDY PLUS FIVE (5) YEARS OF SOFTWARE DEVELOPMENT EXPERIENCE WITH JAVA, BUILDING MACHINE LEARNING PRODUCTS, SEARCH RELEVANCE/INFORMATION RETRIEVAL, TEXT MINING, KNOWLEDGE EXTRACTION AND BUILDING KNOWLEDGE GRAPHS FORM LARGE TEXT CORPORA. MUST PASS TECHNICAL INTERVIEW. Whether you work in an office or a distributed team, Atlassian is highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time off to relax and recharge, flexible working options, five paid volunteer days a year for your favourite cause, an annual allowance to support your learning & growth, unique ShipIt days, a company paid trip after five years and lots more. Creating software that empowers everyone from small startups to the who’s who of tech is why we’re here. We build tools like Jira, Confluence, Bitbucket, and Trello to help teams across the world become more nimble, creative, and aligned—collaboration is the heart of every product we dream of at Atlassian. From Amsterdam and Austin, to Sydney and San Francisco, we’re looking for people who want to write the future and who believe that we can accomplish so much more together than apart. At Atlassian, we’re committed to an environment where everyone has the autonomy and freedom to thrive, as well as the support of like-minded colleagues who are motivated by a common goal to: Unleash the potential of every team . We believe that the unique contributions of all Atlassians is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.  All your information will be kept confidential according to EEO guidelines.  If your experience looks a little different from what we’ve identified and you think you can rock the role, we’d love to learn more about you.  Learn more about Atlassian’s culture, interviewing flow, and hiring process by checking out our Candidate Resource Hub .",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T05:10:20.000Z"
  },
  "company": {
    "name": "Atlassian",
    "link": "https://au.linkedin.com/company/atlassian"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Mountain View",
    "region": "CA",
    "postal_code": "94040",
    "street_address": null,
    "latitude": 37.39008,
    "longitude": -122.08139
  }
}