{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "Join us as a on our Global eCommerce Experience team in Round Rock, Texas to do the best work of your career and make a profound social impact. As a Site Reliability Engineer you will help deliver and operate large scale, distributed systems and applications for the evolving needs of our global eCommerce experience. Our team is looking for a Senior Site Reliability Engineer to contribute to the buildout of our monitoring, tooling and automation platforms who will work with internal partners, product teams, designers, production support teams and external vendors around the world to deliver world-class experiences for our engineering teams and customers. Every Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role: Dell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We’re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.  What’s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.  We started with computers, but we didn’t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what’s next in technology, starting today.  You can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here. 30 July 2021  Dell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here.  Job Id: R128300Job Function: Engineering Development",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T00:00:00.000Z"
  },
  "company": {
    "name": "Dell Technologies",
    "link": "https://www.linkedin.com/company/delltechnologies"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Round Rock",
    "region": "TX",
    "postal_code": "78683",
    "street_address": null,
    "latitude": 30.508787,
    "longitude": -97.67996
  }
}