{
  "job": {
    "title": "Machine Learning and Computer Vision Engineer",
    "industry": "Consumer Electronics",
    "description": "iPhone is the most popular camera in the world, with billions of photos taken every year. The seamless integration of software and hardware has led to features like Smart HDR, Portrait Mode, and Live Photos which deliver magical experiences that surprise and delight our customers!   The Camera Technologies & Systems team in Camera & Photos team delivers amazing quality photos and videos by combining state of the art computer vision, image processing, and machine learning. As an engineer on our team you’ll research and develop novel machine learning techniques for image enhancement and restoration, and build new great camera capabilities spanning the universe of Apple devices. Whenever you see a “Shot on iPhone” billboard, you see our work; it could be your work too! 3+ years experience in developing machine learning algorithms for tackling various computer vision and image processing problems  Solid understanding of computer vision and computational photography concepts  Experience with deep learning techniques for image enhancement and restoration (denoising/inpainting/super resolution/filtering/demosaicing), segmentation, saliency, and object detection  Strong coding skills in Python and C/C++  Experience with one of the major ML frameworks (TensorFlow, PyTorch, etc.)  Strong verbal and written communication skills  Able to collaborate and build productive cross-functional relationships If you consider yourself an engaging and highly-collaborative engineer with excellent communication skills, and are comfortable in a dynamic environment, we have a rewarding opportunity for you. We’re looking for a strong machine learning engineer to identify and apply machine leaning technologies for solving specific camera applications. In this role, you will develop and train deep learning algorithms, and work closely with GPU optimization and frameworks teams on productizing developed camera features. MS or PhD degree in Machine Learning, Computer Vision, Computational Photography, or a related field.    Role Number: 200241845",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T19:50:38.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}