{
  "job": {
    "title": "Test Automation Software Engineer",
    "industry": "Financial Services,Investment Management,Banking",
    "description": "Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application.  At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.  Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.  Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees.  This position will support the Credit and Retail Services businesses (Credit Card and Retail Services) within the Credit and Retail Services Technology organization. This position may also support other lines of business where shared platforms exist. Card and Retail Services is a growth area within Wells Fargo. Key element of the growth strategy is to develop new credit card products and grow the Co-branded credit card portfolio. To enable the growth several Technology areas with Card Technology, Digital and Enterprise Technology have to come together to deliver E2E solution. This role will be well suited for an individual with proven success in strong technology delivery experience that has been gained on top of past hands-on technology solutions crafting and delivery. This role will partner with line of business partners and translate the business needs to various technology groups within Wells Fargo and Third Party Solutions providers and orchestrate activities to have End-to-End solutions in place and deliver it. This position is NOT ELIGIBLE for relocation assistance. Prospective candidates should reside in and/or around the target site location or be able to commute to the site for employment. The salary range displayed below is based on a Full-time 40 hour a week schedule. Min: $84,000 Mid: $120,000 Max: $156,000 Min: $84,000 Mid: $120,000 Max: $156,000 Min: $92,400 Mid: $132,000 Max: $171,600 Min: $84,000 Mid: $120,000 Max: $156,000 2222 W Rose Garden Ln - Phoenix, AZ 6051/6061 N State Hwy 161 - Irving, TX 101 N Independence Mall E - Philadelphia, PA 2700 S Price Rd - Chandler, AZ Visit https://www.wellsfargo.com/about/careers/benefits for benefits information. 5591614-4",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:08:00.000Z"
  },
  "company": {
    "name": "Wells Fargo",
    "link": "https://www.linkedin.com/company/wellsfargo"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Philadelphia",
    "region": "PA",
    "postal_code": "08051",
    "street_address": null,
    "latitude": 39.95106,
    "longitude": -75.16562
  }
}