{
  "job": {
    "title": "Software Engineer (full stack)",
    "industry": "Internet",
    "description": "Replicated is the modern way to ship multi-prem software. Replicated helps software vendors quickly and easily deploy their applications to any customer using a single architecture.The Replicated platform provides all of the tools needed to operationalize and scale the distribution of Kubernetes applications into any enterprise environment. Those tools include Kubernetes-native versions of release channels, customer license management, automated troubleshooting, and a nextgen end-customer admin experience.  Replicated is committed to cultivating an efficient, respectful workplace. We know that innovation thrives on teams where diverse points of view come together to solve hard problems in ways that are just now possible. As such, we explicitly seek people that bring diverse life experiences, diverse educational backgrounds, diverse cultures, and diverse work experiences.  We are fully remote and plan to stay that way! Most roles are open in any state in the US. We're open to candidates in Canada and the UK also. Full Stack Engineers bring expertise in front end and Typescript development to a collaborative development team. They contribute to every stage of building the Replicated delivery and management platform. They implement, test, and deploy new enhancements and updates to our products. They work closely with Core engineers which have a complementary expertise in backend and service development.  As a member of the team you will get to use cutting-edge technology and emerging open source tools and standards. Our stack includes Go, Typescript, Kubernetes, and more. You’ll get an opportunity to work across the stack and build software for our highly technical user-base of software developers. You won’t be locked into legacy products or technology, our engineers learn something new every day.  What you'll do: You should have: Nice to have: Location: Remote US/Canada/UK  Not sure you meet 100% of our qualifications? Please apply anyway!  We invest in our team and love candidates who are eager to learn and grow. We have a fantastic team of highly collaborative individuals who enjoy learning, growing, and mentoring others. We are driven by a passion for solving hard problems and propelled by a shared desire to continuously learn. We have the confidence to pursue new avenues and the courage to zig when so many others zag. We are proud of our accomplishments but understand that we haven’t solved every problem, yet. We’re on a journey of discovery and improvement. We take the long view when it comes to how we treat each other, how we treat our customers, and how we build our technology. We inherently trust each other and believe in empowerment and autonomy so people can bring and do their best. We strive for diversity and inclusiveness because we know that being diverse and inclusive helps people, companies and communities thrive. We know each member of our team is valuable and deserving of our active listening, understanding, and support. We offer strong benefits to help you stay healthy and productive. For the US, our benefits are listed below: Replicated is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We encourage applicants of all backgrounds and we work to make sure that all team members have an equal opportunity to succeed.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:47:15.000Z"
  },
  "company": {
    "name": "Replicated",
    "link": "https://www.linkedin.com/company/replicated"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}