{
  "job": {
    "title": "Staff Devops Engineer - Network Reliability",
    "industry": "Internet,Information Technology and Services",
    "description": "LinkedIn was built to help professionals achieve more in their careers, and everyday millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We are much more than a digital resume – we transform lives through innovative products and technology.   At LinkedIn, we trust each other to do our best work where it works best for us and our teams, and this role can be performed remotely in most locations in the country of employment.    Creating economic opportunity for every member of the global workforce is a responsibility we all share. To truly transform the global economy, we must evolve the way we hire and enable our talent to serve people of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer.   Productivity Engineering is a team at LinkedIn that builds products that power LinkedIn’s business. We drive technology vision, architecture, and design for systems that help the company deliver on major business processes (go-to-market, sales, finance, and customer support etc.). We deliver applications and products that let our customers do business with us in a seamless way, help grow our top line, and increase our efficiency.   The enterprise network team is looking for an accomplished networking & devops professional for a broad range of opportunities and challenges. This role will help lead the team in all things automation, bringing our infrastructure-as-code efforts to new levels, as well as help evolve and transform our Azure virtual infrastructure.  Responsibilities: You will identify areas of optimization across the stack and work with other product and infrastructure teams to implement performance enhancements to improve the member experience  You will build a Culture of Performance by evangelizing and scaling performance optimizations and best practices across LinkedIn  You will help develop and advocate the Network Automation Vision and Roadmap to cross-functional teams and stakeholders of the Corporate Network  You will influence product roadmaps and design decisions to ensure optimal performance and efficiency of our applications and data centers.  You will work with cloud vendors and external technical support on upgrades, problem resolution, and design issues.  You will analyze large scale distributed environments and optimize performance bottlenecks in our infrastructure  You will improve the performance of network infrastructure, application infrastructure or data infrastructure  You will work with other engineering teams and DevOps to understand and optimize site-wide capacity  You will participate in on-call rotation, which includes 12 x 7 support on a rotation basis Due to business needs, this position will require working from 9am-5pm PT   Basic Qualifications: BA/BS Degree in Computer Science or related technical discipline, or related practical experience 4+ years building infrastructure and supporting applications in cloud environments  4+ years of programming experience using languages such as Python, Java, or similar   4+ years of managing and automating infrastructure / configuration management using tools such as Puppet, Chef, Ansible or similar  Experience with public cloud solutions like Azure, AWS, GCP or similar   Preferred Qualifications: BS and 10+ years of relevant work experience, MS and 6+ years of relevant work experience, or PhD and 4+ years of relevant work experience Understanding and knowledge of Azure (Virtual Machines, Service Fabric, Storage Accounts, Azure DNS, Azure NSG, Azure Active Directory, Security Center, and Azure Functions   Experience with Software Defined Network solutions  Experiences with software design methodologies, information systems architecture, object-oriented design, and software design patterns  Experience in Git and Azure Devops  Experience in Azure and cloud networking, security, routing, peering.   Development experience using Python  Familiarity with large-scale systems and methodologies  Excellent verbal and written communication skills  Ability to quickly triage problems, determine root cause and drive resolution   You will Benefit from our Culture:  We strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels.  LinkedIn is committed to fair and equitable compensation practices.  As required by C.R.S. § 8-5-201(2): (Colorado only) The minimum pay for this role is $121,000. Actual compensation packages are based on a wide array of factors unique to each candidate, including but not limited to skill set, years & depth of experience, certifications and specific office location. This may differ in other locations due to cost of labor considerations. The total compensation package for this position may also include annual performance bonus, stock and benefits. For additional information, visit: https://careers.linkedin.com/benefits.    Equal Opportunity Statement  LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. LinkedIn is an Affirmative Action and Equal Opportunity Employer as described in our equal opportunity statement here: https://lnkd.in/equalemploymentopportunity2017. Please reference http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf and https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf for more information.   LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.    If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.    Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:    -Documents in alternate formats or read aloud to you  -Having interviews in an accessible location -Being accompanied by a service dog -Having a sign language interpreter present for the interview   A request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.   LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.  Pay Transparency Policy Statement  As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.  Global Data Privacy Notice for Job Candidates This document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://lnkd.in/GlobalDataPrivacyNotice",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-12T16:35:09.000Z"
  },
  "company": {
    "name": "LinkedIn",
    "link": "https://www.linkedin.com/company/linkedin"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}