{
  "job": {
    "title": "Staff Software Engineer",
    "industry": "Financial Services,Information Technology and Services",
    "description": "Apply Here For Expedited Consideration If You Are Being Directed to a Third Party Site: https://matterport.com/careers/  Matterport is leading the digital transformation of the built world. Our groundbreaking spatial computing platform turns buildings into data making every space more valuable and accessible. Millions of buildings in more than 150 countries have been transformed into immersive Matterport digital twins to improve every part of the building lifecycle from planning, construction, and operations to documentation, appraisal, and marketing.  We’re excited to announce that Matterport is now publicly listed on NASDAQ. It’s an exciting time to join us!  Visit our Matterport Comparably Profile to learn more about working at Matterport and the awards we have won!  Matterport is a remote workplace with headquarters in Sunnyvale, CA. This position can be based remotely in the United States. #LI--Remote Matterport is looking for an enthusiastic Staff Software Engineer to join our Platform team. You’ll be responsible for crafting and scaling services for the Matterport Platform which serves billions of requests a month. The ideal candidate is an individual who thrives on new challenges, possesses a strong platform development background, and has a drive to invent. For more detail visit www.matterport.com/careers * Medical and retirement benefits vary by Country At Matterport, we don’t just accept differences, we celebrate them and recognize the value they bring to our customers and employees. Matterport is proud to be an equal opportunity workplace and works to create and support diversity at Matterport. Equal opportunity and consideration are afforded to all qualified applicants and employees. We won’t unlawfully discriminate on the basis of gender, identity or expression, race, ethnicity, religion, national origin, age, sex, marital status, physical or mental disability, veteran status, sexual orientation, and any other category protected by law. We are committed to providing employees with a work environment that provides a sense of inclusion and belonging and is free of discrimination and harassment. We also consider all qualified candidates regardless of criminal histories, consistent with legal requirements. Matterport is likewise committed to working with and providing reasonable accommodation to all qualified applicants and employees with disabilities in accordance with the American Disabilities Act  For information regarding how Matterport collects and uses personal information, please review our Privacy Policies.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:20:32.000Z"
  },
  "company": {
    "name": "Matterport",
    "link": "https://www.linkedin.com/company/matterport"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}