{
  "job": {
    "title": "Software Engineer - Tock",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "The Software Engineer position is located in Chicago or can be 100% remote.  You'll be helping us build the next generation restaurant booking system, based on the tried and true (and proven) system deployed at world-class restaurants such as Alinea, Next, The French Laundry, and more. We're looking for engineers who are generalists—you'll be working with a mix of front and back-end web development tools. Our team is pretty small and undergoing exponential growth, so there's a great opportunity for you to make a difference.  All Tock employees are working remotely at this time. We are closely monitoring the status of COVID-19 as we continue our work to build a return-to-work plan that ensures a safe return to our offices and provides flexibility for our employees. Tock is the only all-in-one system for reservations, takeout, delivery, and events. We are changing the way restaurants, wineries, and culinary event organizers run their business and how guests explore, discover, and book at these places all around the globe. Squarespace makes beautiful products to help people with creative ideas succeed. By blending elegant design and sophisticated engineering, we empower millions of people — from individuals and local artists to entrepreneurs shaping the world’s most iconic businesses — to share their stories with the world. Squarespace’s team of more than 1,200 is headquartered in downtown New York City, with offices in Dublin, Los Angeles and Portland. For more information, visit www.squarespace.com/about.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-03T00:00:00.000Z"
  },
  "company": {
    "name": "Squarespace",
    "link": "https://www.linkedin.com/company/squarespace"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}