{
  "job": {
    "title": "Data Scientist Jr",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "YOUR NEXT STEP IS AT RAPPI!  Rappi is one of the first Latin American unicorns and a start-up that continues to focus on growing and making life easier for our users. As a company, we seek to continue improving the services we already offer, add more to our offer and continue expanding throughout the Latin American continent.  Rappi is the fastest growing Latin American startup, backed by the world's top investors, including Sequoia, Andreesen Horowitz, Y Combinator and Softbank. We reached unicorn status last year and haven't slowed down. We operate in 100+ cities across 9 countries in Latin America, with large hubs in Mexico City, Bogotá, São Paulo, and Buenos Aires.  At Rappi, no two days are the same. We love to hustle, work hard for a greater good and strive to be the leading tech company in Latin America. Rappi is growing at a tremendous rate and this position is crucial in our pursuit of a game-changing experience for our users and partners.  Main Responsibilities Key Requirements He leído y acepto la Autorización de Datos Personales de Rappi S.A.S  https://docs.google.com/document/d/e/2PACX-1vRFEkFojVd3AfFsARRsdZpiSjA_xQGK5Y7ZCBT3gw19MOdQVqH5nRAuSqyu3yZq2A/pub  Conforme a la Política de Tratamiento de Datos Personales  https://legal.rappi.com/colombia/politica-de-proteccion-y-tratamiento-de-datos-personales-rappi-s-a-s/  I have read and accept the Authorization of Personal Data from Rappi S.A.S  https://docs.google.com/document/d/e/2PACX-1vRFEkFojVd3AfFsARRsdZpiSjA_xQGK5Y7ZCBT3gw19MOdQVqH5nRAuSqyu3yZq2A/pub  In accordance with the Personal Data Treatment Policy  https://legal.rappi.com/colombia/autorizacion-de-tratamiento-de-datos-personales-rappitenderos-rappi-s-a-s/",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T17:02:53.000Z"
  },
  "company": {
    "name": "Rappi",
    "link": "https://www.linkedin.com/company/rappi"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Location",
    "region": "WV",
    "postal_code": "26254",
    "street_address": null,
    "latitude": 39.213993,
    "longitude": -79.63701
  }
}