{
  "job": {
    "title": "Data Scientist",
    "industry": "Accounting,Information Technology and Services,Management Consulting",
    "description": "Are you an analytical, data-driven professional? Are you interested in a role that offers an opportunity to provide front line support to our clients instead of a \"back office programmer\" position? If so, Deloitte's Government and Public Services (GPS) Analytics team is the place for you! Join our team of specialists as they unlock insights contained in the data universe and work through challenges related to the identification of improper payments, data quality, mission-oriented analysis, and cost management. In this role, you will specialize in and provide expertise in data analytics, data science/engineering, and data management. Other responsibilities include: Transparency, innovation, collaboration, sustainability: these are the hallmark issues shaping GPS initiatives today. Deloitte's GPS practice is passionate about making an impact with lasting change. Carrying out missions in the GPS practice requires fresh thinking and a creative approach. We collaborate with teams from across our organization in order to bring the full breadth of Deloitte, its commercial and public sector expertise, to best support our clients. Our aspiration is to be the premier integrated solutions provider in helping to transform the GPS marketplace.  Deloitte GPS Analytics mitigates current and future risk for our GPS clients across several industries, spanning from finance and audit readiness to forensics and healthcare. With a creative and innovative approach, our Analytics team exposes our clients' risks and provides recommendations to improve the quality of data. We collaborate closely with government agencies, accountants, IT professionals, and clients to produce analyses in support of risk consulting engagements. Required: Preferred:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-18T06:16:10.000Z"
  },
  "company": {
    "name": "Deloitte",
    "link": "https://www.linkedin.com/company/deloitte"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}