{
  "job": {
    "title": "Software Engineer.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Ethicon, part of Johnson & Johnson Medical Devices Companies, is recruiting for a Software Engineer located in Redwood City, CA!  Johnson & Johnson Medical Devices is passionate about crafting the future of digital surgery and expanding its robotics and digital solutions offerings across the entire portfolio, with multi-specialty, end-to-end solutions in orthopedics, endoluminal intervention and general surgery. This includes the MONARCH® platform, a first-of-its-kind robotic technology indicated for bronchoscopic visualization of and access to patient airways for diagnostic and therapeutic procedures in the lung.  Ethicon, part of Johnson & Johnson Medical Devices Companies, has made significant contributions to surgery for more than 100 years from crafting the first sutures, to revolutionizing surgery with minimally invasive procedures. Our continuing dedication to Shape the Future of Surgery is built on our commitment to help address the world's most pressing health care issues and improve and save more lives. Through Ethicon's surgical technologies and solutions including sutures, staplers, energy devices, trocars and hemostats and our commitment to treat serious medical conditions like obesity worldwide, we deliver innovation to make a life-changing impact. For more information, visit www.ethicon.com. Johnson & Johnson Robotics & Digital Solutions is looking for Software Engineer for calibration tools to join a team of hardworking roboticists and software engineers who are trying to solve some of the hardest problems in medicine today.  We are looking for an engineer to work on our growing ecosystem of engineering and production tools that will enable new generations of platform capability. The right candidate should be an experienced software developer who enjoys working on tools and infrastructure. Good command of python and C++ are required as well as strong communication and presentation skills. You will have an opportunity to lead projects from concept to release. Engage engineers from other teams to learn what they need and build amazing tools to make them more efficient and effective in their day-to-day work. Your work will enable the team to design, build and service next-generation of medical device technology faster.  Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. #gia United States-California-Redwood City-150 Shoreline Dr Auris Health, Inc. (6267) R&D 2105947824W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T17:33:22.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 93700,
    "max_value": 172000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Redwood City",
    "region": "CA",
    "postal_code": "94064",
    "street_address": null,
    "latitude": 37.4805,
    "longitude": -122.21528
  }
}