{
  "job": {
    "title": "Software Data Engineer",
    "industry": "Medical Devices,Hospital &amp; Health Care,Biotechnology",
    "description": "Siemens Healthineers is a leading global medical technology company with over 170 years of experience and 18,000 patents. More than 48,000 dedicated colleagues in over 70 countries are driven to shape the future of healthcare. We stand with our customers around the world to support them in delivering high quality care to their patients. An estimated 5 million patients across the globe benefit every day from our innovative technologies and services in the areas of diagnostic and therapeutic imaging, laboratory diagnostics and molecular medicine, as well as digital health and enterprise services. This is what truly matters to us.  Join our team now at Siemens Healthineers as : At Siemens Healthineers, we value those who dedicate their energy and passion to a greater cause. Our people make us unique as an employer in the med-tech industry. What unites and motivates our global team is the inspiration of our common purpose: To innovate for healthcare, building on our remarkable legacy of pioneering ideas that translate into even better healthcare products and services. We recognize that taking ownership of our work allows both us and the company to grow. We offer you a flexible and dynamic environment and the space to move beyond your comfort zone to grow both personally and professionally. https://usa.healthcare.siemens.com/careers If you wish to find out more about the specific before applying, please visit: .  As an equal-opportunity employer we are happy to consider applications from individuals with disabilities. Siemens Healthineers Siemens Healthcare Diagnostics Inc. Experienced Professional Full-time Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law. Applicants and employees are protected under Federal law from discrimination. To learn more, Click here. Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here. California residents have the right to receive additional notices about their personal information. To learn more, click here.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T02:50:43.000Z"
  },
  "company": {
    "name": "Siemens Healthineers",
    "link": "https://de.linkedin.com/company/siemens-healthineers"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Flanders",
    "region": "NJ",
    "postal_code": "07836",
    "street_address": null,
    "latitude": 40.845943,
    "longitude": -74.70278
  }
}