{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Staffing and Recruiting,Financial Services",
    "description": "Calypso Technology, Inc . is a cloud-enabled provider of cross-asset front-to-back solutions for financial markets with over 35,000 users in 60+ countries. With a rich legacy of innovation and 20 years of experience, its award-winning software improves reliability, adaptability, and scalability across several verticals, including capital markets, investment management, central banking, clearing, treasury, and collateral management.  Calypso’s success is founded on our values of accountability, transparency, and people. At Calypso, R&D comprises of Development, Product Management, Quality Assurance, Architecture, and Infrastructure teams. These teams work towards delivering a powerful yet flexible technology platform keeping the needs of end customer in mind. The development teams ensure that all codes are delivered to clients with the highest quality. Product managers are technical and capital market experts who work together to design and build the software and product roadmap, whereas; QA team constantly aims at enhancing the quality of Calypso’s platform delivery through test methodologies for implementations, upgrades and migrations. The R&D-Engineering team has multiple subdivisions responsible for application development and enhancement as per client’s request and ensure systems are up to date. The Calypso system is a large-scale software product for the capital markets supporting trading, risk management, and processing of various financial products such as Interest Rate, Equity and Credit Derivatives. We are seeking a highly motivated Software Engineer for our New York-based Front Office UI team. As a member of the Front Office UI team, you will be responsible for development and maintenance of innovative Calypso Front Office solutions. Calypso New York office is located in beautiful Park Avenue and just a block away from world-famous landmark and transportation hub Grand Central Station. It is easily accessible via subway, bus or walk from Penn Station. It is a modern office with lovely view of the Empire State Building, Grand Central, Park Avenue and a short walk to United Nations and the East River. New York office has a friendly and diverse environment with people from all over the world. At Calypso, we are always looking for passionate individuals who will use their professional skills and experience to work side by side with clients in addressing their complex business and regulatory challenges and help develop and deliver products that drive value. If this sounds like you, we’re looking forward to your application.  Calypso Technology is an equal opportunity employer (EOE) and strongly supports diversity in the workforce.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:09:27.000Z"
  },
  "company": {
    "name": "Calypso Technology",
    "link": "https://www.linkedin.com/company/calypso-technology"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 75400,
    "max_value": 158000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}