{
  "job": {
    "title": "Cloud Engineer - DevOps",
    "industry": "Electrical/Electronic Manufacturing,Automotive,Mechanical or Industrial Engineering",
    "description": "We are looking for a DevOps leader to drive and manage our infrastructure, help build and refine our automated CI/CD pipeline, support the design and development of cloud applications and systems, and continue to find new ways make our advanced engineering organization better. The role will work with a team of software engineers integrating complex systems consisting of embedded applications, cloud services, and mobile apps. DENSO is an advanced mobility supplier and global Fortune 500 company. Here, we innovate, create and make things to change how the world moves. We develop technology and components for major automakers worldwide, which you can find on nearly every vehicle make and model on the road today.  At our core, DENSO wants to make the world a better place. And, we have the ability to do so using our broad product portfolio, which spans mobility electronics, thermal systems, electrification systems, powertrain systems, sensors & semiconductors, and non-automotive businesses.  We’re far reaching: Globally headquartered in Japan, we have 170K+ employees across 221 facilities in 35 countries across the globe. Here in North America, our headquarters is in Southfield, Michigan. Last year, we had $47.6 billion in global consolidated revenue with North America contributing $10.9 billion.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:29:01.000Z"
  },
  "company": {
    "name": "DENSO",
    "link": "https://jp.linkedin.com/company/denso"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Southfield",
    "region": "MI",
    "postal_code": "48037",
    "street_address": null,
    "latitude": 42.480198,
    "longitude": -83.241
  }
}