{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 392 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Engineering at Venmo At Venmo, we are creating a product that people love. We strive to create a delightful user experience while connecting the world and empowering people through payments. We are looking for intellectually curious people who want to be inspired and inspire others to change the world. Engineering is a craft, and at Venmo we want the internals of our software to be as elegant as the end user experience we are designing. We spend our days scaling our capacities and building new features to meet and exceed our user’s needs and wants. We teach and learn from one another and push each other to be at our creative and analytical bests. Product Intelligence team Imagine what you could do here. Venmo is the fastest growing peer-to-peer financial brand and keeps innovating in the tech industry. We as Venmo Product Intelligence (Applied Science) team are looking for Machine Learning Engineer to join us and build creative next generation of data products and AI/ML solution. We derive valuable insights from our extensive, rich and rapidly growing datasets in order to improve customer daily experience. This role is critical to the engineering team and will be deeply embedded within multi-disciplinary teams across the company. You will join the team that interacts with Data Scientists, Data Engineers and Machine Learning Engineers to embrace rich data into Machine Learning as a service. You will have the opportunity to take full stack ownership of design and implementation of highly reliable, scalable and high-performance products. You will drive appropriate technologies for the business, lead the way for continuous innovation and shape the future of e-commerce. Candidate Qualification We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.  PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.  REQ ID R0070617",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-14T00:42:42.000Z"
  },
  "company": {
    "name": "Venmo",
    "link": "https://www.linkedin.com/company/venmo"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}