{
  "job": {
    "title": "Data Scientist - US Cards",
    "industry": "Banking,Financial Services,Investment Banking",
    "description": "Job Id: 21374797  The US Consumer Analytics (USCA) Decision Science Team develops statistical tools and tool-driven optimization strategies for NA Cards and Retail Bank marketing programs in order to increase Customer Centricity, aiming to increase customer satisfaction and revenue growth. Within USCA, the Acquisition (ACQ) modeling team builds and manages predictive analytics solutions for cards and retail bank account acquisition improvements. This job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.  ------------------------------------------------- Decision Management  ------------------------------------------------- Specialized Analytics (Data Science/Computational Statistics)  ------------------------------------------------------ Full time  ------------------------------------------------------  Citi is an equal opportunity and affirmative action employer.  Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.  Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review .  View the \" \" poster. View the .  View the .  View the",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-07T00:00:00.000Z"
  },
  "company": {
    "name": "Citi",
    "link": "https://www.linkedin.com/company/citi"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 88100,
    "max_value": 185000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}