{
  "job": {
    "title": "Associate Electrical Engineer - New York",
    "industry": "Construction,Information Technology and Services,Staffing and Recruiting",
    "description": "Type of contract  Permanent  Grade  Associate, Senior  Area of Expertise  Building Environment  Region  US  Office / Project Location  New York  Ref No  5017  The Associate Electrical Engineer will work closely with clients, architects and other Buro Happold Engineers and/or design team members as part of a dedicated and skilled team. Duties include the production of coordinated detailed design drawings, electronic models, specifications, written reports, site observation reports, schedules etc. on a variety of projects within the electrical discipline, as well as the coordination with utility companies and obtaining the necessary electrical permit approvals from Plan Check. Input to the projects is likely to be varied but will include the requirement to: As an experienced Associate Electrical Engineer, it is expected that you will be able to demonstrate: Buro Happold is proud to be a practice of a diverse range of professionals that reflects the countries in which we operate. In order to truly benefit from this diversity we must create an environment in which employees feel they can be themselves. Buro Happold actively promotes inclusivity across the practice to enable every individual to reach their full potential, feeling included is good for all of us. This begins with a fair and inclusive recruitment process which focuses on your skills, competencies and experiences in relation to the role. We recognise and are committed to change the lack of representation of minority groups in our industry, and particularly welcome applications from Black, Asian and minority ethnic individuals, disabled people and women across all our offices. We understand that through collaboration, diverse people with different experiences develop the most innovative and elegant solutions.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T03:16:34.000Z"
  },
  "company": {
    "name": "Buro Happold",
    "link": "https://uk.linkedin.com/company/buro-happold"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}