{
  "job": {
    "title": "Software Engineer",
    "industry": "Financial Services,Investment Management,Banking",
    "description": "Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application.  At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.  Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.  Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees.  Digital Teller & ATM Technology (DTAT) supports two mission critical physical channels for Wells Fargo. On a daily basis, DTAT processes very high volume deposits and millions of dollars cash for Branch and ATM customers. We deliver world-class Digital Teller and ATM Technology and take pride in a continuous learning culture, collaboration, and individual accountability to provide the most secure, scalable and customer centric banking experience. DTAT is currently seeking qualified candidates for this Software Engineer position. The candidate will lead and mentor a mission critical application Teller platform along with strong technical leaders. In addition, this leader will also be responsible for team development & training needs, vendor engagement management, and team communications The salary range displayed below is based on a Full-time 40 hour a week schedule. Min: $84,000 Mid: $120,000 Min: $100,800 Mid: $144,000 2600 S Price Rd - Chandler, AZ 794 Davis St - San Leandro, CA Visit https://www.wellsfargo.com/about/careers/benefits for benefits information. 5591534-1",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:05:30.000Z"
  },
  "company": {
    "name": "Wells Fargo",
    "link": "https://www.linkedin.com/company/wellsfargo"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chandler",
    "region": "AZ",
    "postal_code": "85226",
    "street_address": null,
    "latitude": 33.302284,
    "longitude": -111.8401
  }
}