{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Entertainment",
    "description": "Madison Square Garden Entertainment Corp. (MSG Entertainment) is a leader in live entertainment. The Company presents or hosts a broad array of events in its diverse collection of venues: New York’s Madison Square Garden, Hulu Theater at Madison Square Garden, Radio City Music Hall and Beacon Theatre; and The Chicago Theatre. MSG Entertainment is also building a new state-of-the-art venue in Las Vegas, MSG Sphere at The Venetian. In addition, the Company features the original production – the Christmas Spectacular Starring the Radio City Rockettes – and through Boston Calling Events, produces the Boston Calling Music Festival. The Company’s two regional sports and entertainment networks, MSG Network and MSG+, deliver a wide range of live sports content and other programming. Also under the MSG Entertainment umbrella is Tao Group Hospitality, with entertainment dining and nightlife brands including: Tao, Marquee, Lavo, Beauty & Essex, Cathédrale, Hakkasan and Omnia. More information is available at www.msgentertainment.com . MSG Ventures, a Madison Square Garden company is looking for a Software Engineer specializing in interactive software. This role will help bring the creative vision of our studio to life on a diverse mix of projects ranging from mobile applications and virtual reality software with intimate single user interfaces to complex multi-display installations with live control, many of which involve R&D. The Software Engineer leads the development of interactive, real time content systems as well as user interfaces. Working on a project from conception through execution, this position benefits from a broad range of skills such as realtime graphics, usability evaluation and scripting. Candidates who have completed 60 credits of college-level coursework (representing 2 years), or have shown similar self-development through certifications, trade school coursework, etc. are preferred.  Educational requirements may differ from job to job based on the role. At MSG we value diversity and are looking for extraordinary employees of all backgrounds! MSG is an Equal Opportunity Employer and provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, sexual and reproductive health choices, national origin, citizenship, age, genetic information, disability, or veteran status. In addition to federal law requirements, MSG complies with all applicable state and local laws governing nondiscrimination in all locations.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T01:50:19.000Z"
  },
  "company": {
    "name": "Madison Square Garden Entertainment Corp.",
    "link": "https://www.linkedin.com/company/msg-entertainment"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Burbank",
    "region": "CA",
    "postal_code": "91504",
    "street_address": null,
    "latitude": 34.182053,
    "longitude": -118.30747
  }
}