{
  "job": {
    "title": "Ad Operations Integrations Consultant",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "From media planning and activation, to measurement and insights, Oracle Advertising provides brands, agencies, publishers, and platforms with the solutions they need to drive better business outcomes.  For more information on Oracle Advertising : https://www.oracle.com/cx/advertising/  Moat Analytics help brands and media companies push the envelope on privacy-friendly models of advertising, help them make sound product decisions that involve running fewer ads, help make their ads load faster, fight botnets, and strive to de-fund fake news. Our mission is to help the world's top publishers and marketers make smarter decisions through real-time data. Our analytics and intelligence software is used by Forbes, Condé Nast, Kellogg's, P&G, Spotify, and hundreds of other major platforms and advertisers, and we have unique measurement integrations into Facebook, Instagram, Twitter, Snapchat, and YouTube. We are part of the Oracle Advertising. The Partnerships Operations Engineer is a key role ensuring that Oracle Advertising partners are given effective technical support for OA measurement product..  This role will liaise closely with other support teams, such as Account Management or Sales, and Engineering teams, such as Product and Back-End Development. The Partnerships Operations Engineer acts as the go-to technical contact and knowledge base. The team not only provides support, but also continues team growth by documenting new issues/procedures as they arise. Coordinates all aspects of internal information system-specific projects from initiation to delivery. Projects often involve network, server, or software implementation and upgrades, PC deployment and the like.  Coordinates work performed by IT staff and internal customers/partners by defining project specifications, performing feasibility and needs/impact assessments. Develops detailed project plans and manages all implementation processes including resource allocation, progress tracking, monitoring change control process, testing, documentation, training and on-time delivery within budget constraints.  Duties and tasks are varied and complex utilizing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS degree or equivalent experience relevant to functional area. Typically 5 years of project management, product design or related experience needed.  If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 121915 in the subject line of the email. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:12:52.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}