{
  "job": {
    "title": "Software Engineer - REACT and Node",
    "industry": "Marketing and Advertising",
    "description": "If you are a Software Engineer with experience, please read on!  Top Reasons to Work with Us What You Will Be Doing What You Need for this Position  Must have: - 5 years hands-on experience with JavaScript (React or Node, ideally both) - Track record in taking features from inception through to delivery and supporting them once live - Passion for best practice design and code and a desire to develop innovative new ideas - Strong understanding of the JavaScript ecosystem on the front and/or backend Nice to have:- Experience with the entertainment industry (tv, film, music videos)- Experience with social media (YouTube, Instagram, Twitch, TikTok etc) - Experience with gaming - Experience with Product Placement, Influencer campaigns, Performance Marketing or Paid Media  So, if you are a Software Engineer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Sandra.Ochoa@CyberCoders.com Sandra Ochoa - Lead Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T17:41:26.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Provo",
    "region": "UT",
    "postal_code": "84601",
    "street_address": null,
    "latitude": 40.235123,
    "longitude": -111.66219
  }
}