{
  "job": {
    "title": "Lead Software Engineer - DevSecOps / Site Reliability Engineer (SRE)",
    "industry": "Airlines/Aviation,Aviation &amp; Aerospace,Defense &amp; Space",
    "description": "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.  The Boeing Company is seeking - to join their Enterprise DevSecOps team. This positions will focus on supporting the Boeing Defense Systems (BDS) business organization.  In this role, you will help guide the Boeing Enterprise transformation of DevSecOps across our business units. The successful candidate will design, implement, and maintain a modern system deployment to the cloud environment with a Continuous Integration/Continuous Deployment (CI/CD) workflows for system build, test and deploy in containerized microservices. We operate as a fast paced agile team. We seek candidates who have proven skills in DevOps, Cloud environments, software development, test automation, and system automation.  These positions will place you in roles where you have the opportunity to make an impact on the results of our project. The DevOps team offers a collaborative mentoring environment where you have the opportunity to learn from or lead others. full-time. A final U.S. Secret Clearance Post-Start is required. Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense. Boeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies. This position is for 1st shift.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T19:16:10.000Z"
  },
  "company": {
    "name": "Boeing",
    "link": "https://www.linkedin.com/company/boeing"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 168,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 77400,
    "max_value": 112000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "St Louis",
    "region": "MO",
    "postal_code": "63121",
    "street_address": null,
    "latitude": 38.635357,
    "longitude": -90.20099
  }
}