{
  "job": {
    "title": "Senior Data Scientist, India Growth",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "“The front page of the internet,\" Reddit brings over 430 million people together each month through their common interests, inviting them to share, vote, comment, and create across thousands of communities. Come work with one of the richest datasets in the world and make an impact on the lives of Redditors everywhere.  We are looking for a results-oriented and strategically-minded to work with our International Growth team as Reddit expands its user base to India. Today the majority of Reddit’s user base lives in the US. Reddit’s mission is to bring community and belonging to everyone in the world, which means we’ll be making a major push to expand our audience internationally. We’ve identified India as a key market and need you to be a key player in exploring and understanding the key levers to drive growth. As a Data Scientist, you will become an expert in improving Reddit’s product-market fit for a global user base. You’ll be pivotal in understanding how Indian users interact with our product today and how that differs from other audiences. You’ll be a champion to the users through evaluating performance of existing Reddit features for India users, as well as uncovering opportunities for new experiences that are optimized for worse internet connections.  You will work side by side with a world-class org of Engineering, Machine Learning, Search, Community Operations, Product Management practitioners who work together to create a variety of capabilities for Reddit to be more successful in its decision-making and product creation. In this process, you will be exposed to a variety of new techniques in experimentation, machine learning, and exploratory analysis",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:12:44.000Z"
  },
  "company": {
    "name": "Reddit, Inc.",
    "link": "https://www.linkedin.com/company/reddit-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}