{
  "job": {
    "title": "Machine Learning Data Scientist",
    "industry": "E-Learning",
    "description": "Lexia Learning, a Cambium Learning® Group company, empowers educators through adaptive assessment and personalized instruction. For more than 30 years, the company has been on the leading edge of research and product development as it relates to student reading skills. With a robust offering that includes solutions for differentiated instruction, personalized learning, and assessment, Lexia Learning provides educators with the tools to intensify and accelerate literacy skills development for students of all abilities. Lexia is looking for a Data Scientist that is interested in applying their skills to our mission: delivering the highest quality literacy programs and best educational technology experiences to Lexia’s millions of students and educators.  The Data Scientist will be a part of Lexia’s Product Research & Analytics team, which focuses on leveraging data science and evidence to inform how Lexia’s programs are designed, built, implemented, and supported.  For the Data Scientist role, we are looking for an innovator. The Data Scientist will collaborate with talented designers, researchers, and engineers to transform how our programs work. We capture millions of data points about the experiences of our learners and educators every day. We need someone who will be able to identify the best problems to solve, unearth new value from our data, build out a next-generation infrastructure for data science, and pioneer using machine learning techniques to drive product evolution. To learn more about our organization and the exciting work we do, visit https://www.lexialearning.com/",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-11T23:45:58.000Z"
  },
  "company": {
    "name": "Lexia Learning",
    "link": "https://www.linkedin.com/company/lexia-learning-systems"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}