{
  "job": {
    "title": "Senior Scientist - Biomarker Development, Translational Medicine",
    "industry": "Pharmaceuticals",
    "description": "38! Soluble Biomarkers contributed to advance science in 8 First In Human and >10 Proof of Concept studies. Data contributed to demonstrate pathway engagement, proof of biology and identify the right drug and the optimal dose for the right patient! 25 innovative soluble biomarker methods were developed in >5 disease relevant tissues. 1 purpose...to reimagine medicine!  This is an exciting opportunity to join the Molecular & Cellular Sciences (MCS) team within Biomarker Development (BMD) and Translational Medicine (TM) at the Novartis Institutes for Biomedical Research (NIBR). BMD focuses on delivering fit for purpose integrated biomarkers leveraging diverse expertise and knowledge in immunology, genomics, protein and cellular biology and state of the art data sciences.  Our innovative spirit enables the development and application of cutting-edge technologies which address key clinical questions such as target engagement, defining disease stage or progression, predict the safety or efficacy of medication, select a group of patients who would benefit most from a given therapy, and identify additional clinical indications suitable for a innovative molecule.  As a Senior Scientist within MCS in BMD, you will work in close collaboration with project and clinical teams to develop novel exploratory assays in our state of the art laboratories, implement internal and external biomarker activities and interpret results to enable proof of mechanism, proof of biology, safety and efficacy understanding. As a soluble biomarker assay expert, you will be developing and validating innovative biomarker solutions implementing new methodologies, delivering high quality data and playing a pivotal role in human clinical trials.  Your responsibilities will include, but not limited to: Our Expectations What you will bring to the role: What Novartis can offer you?  Yes, we offer exceptional benefits and competitive salaries. However, we can offer more. Here you will: Why consider Novartis?  769 million patients were impacted by Novartis products in 2020. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives?  We believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you are given opportunities to explore the power of digital and data. Where you are empowered to risk failure by taking smart risks, and where people who share your determination to tackle the world’s toughest medical challenges surround you.  We are Novartis. Join us and help us reimagine medicine. NIBR Translational Medicine USA Cambridge, MA NIBRI Research & Development Full Time Regular No No",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-30T23:52:23.000Z"
  },
  "company": {
    "name": "Novartis Institutes for BioMedical Research (NIBR)",
    "link": "https://www.linkedin.com/company/novartis-institutes-for-biomedical-research"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 96000,
    "max_value": 123000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cambridge",
    "region": "MA",
    "postal_code": "02239",
    "street_address": null,
    "latitude": 42.36525,
    "longitude": -71.10502
  }
}