{
  "job": {
    "title": "Software Engineer - Entry Level",
    "industry": "Information Technology and Services,Defense &amp; Space,Research",
    "description": "New ideas are all around us, but only a few will change the world. That’s our focus at JPL. We ask the biggest questions, then search the universe for answers—literally. We build upon ideas that have guided generations, then share our discoveries to inspire generations to come. Your mission—your opportunity—is to seek out the answers that bring us one step closer. If you’re driven to discover, create, and inspire something that lasts a lifetime and beyond, you’re ready for JPL.  Located in Pasadena, California, JPL has a campus-like environment situated on 177 acres in the foothills of the San Gabriel Mountains and offers a work environment unlike any other: we inspire passion, foster innovation, build collaboration, and reward excellence. Our missions are complex, long-lasting, far-reaching—and each one is unique. We’re constantly developing new mission-specific software. For designers, engineers, architects, and developers who like to test the limits, JPL is a constant source of new stimulating challenges.  In this role you would be a vital team member in a JPL software or computer engineering groups. You will partner with lead engineers to design, code, and develop secure software applications and interface solutions that power JPL’s spacecraft, science instruments, mission control systems, science analysis pipelines and IT services. You will integrate algorithms and models into software components for production and analysis of mission and enterprise data. You will use general understanding of the complexity and interdependence involved with integrating multiple applications with complex data sources, and deploying the resulting systems at sites worldwide and beyond.  Opportunities in Software Computing Systems Engineering include, but are not limited to, the following: JPL is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, citizenship, ancestry, age, marital status, physical or mental disability, medical condition, genetic information, pregnancy or perceived pregnancy, gender, gender identity, gender expression, sexual orientation, protected military or veteran status or any other characteristic or condition protected by Federal, state or local law.  In addition, JPL is a VEVRAA Federal Contractor.  EEO is the Law.  EEO is the Law Supplement  Pay Transparency Nondiscrimination Provision  The Jet Propulsion Laboratory is a federal facility. Due to rules imposed by NASA, JPL will not accept applications from citizens of designated countries or those born in a designated country unless they are Legal Permanent Residents of the U.S or have other protected status under 8 U.S.C. 1324b(a)(3). The Designated Countries List is available here.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T00:00:00.000Z"
  },
  "company": {
    "name": "NASA Jet Propulsion Laboratory",
    "link": "https://www.linkedin.com/company/jet-propulsion-laboratory"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Pasadena",
    "region": "CA",
    "postal_code": "91122",
    "street_address": null,
    "latitude": 34.14955,
    "longitude": -118.14145
  }
}