{
  "job": {
    "title": "Associate Director/Director, Regulatory Affairs (Oncology) - Remote",
    "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "Regulatory Professionals, a division of Premier Research, is a consultancy firm specializing in drug, biologics and device regulatory affairs. Our purpose as a company is to support our clients by furthering the development of human therapeutics that will benefit the health and well-being of patients around the world. With a presence in the US, EU, Canada and Australia we are growing and looking for talented people to grow our business, advance the goals of our clients and contribute to our unique culture. Our focus is to provide strategic and tactical support in all aspects of regulatory affairs, including preclinical, CMC and clinical development for drugs, biologics, devices, and combination products.  We’re looking to hire a talented and energetic to join our innovative team.  As the Associate Director, Regulatory Affairs, you’ll have the opportunity to develop, implement and lead both regional and international strategy for assigned projects with various cross-functional teams. You’ll execute regulatory strategies for earliest possible approvals of the company’s regulatory applications at all stages of development and post approval and address the analysis and evaluation of regulatory procedures and changes to ensure attainment of corporate goals. You’ll provide guidance for, and contribute to, the development of documents for regulatory agencies e.g. Investigational New Drug applications (INDs)/Investigational Medicinal Product Dossiers (IMPDs)/Clinical Trial Applications (CTAs), and New Drug Applications (NDAs)/Biologics License Applications (BLAs)/Marketing Authorization Applications (MAAs), ensuring that they meet current regulatory requirements and industry standards, are high quality, consistent, complete, and approvable on the first review cycle. This position may supervise or manage others within the Regulatory Affairs skill group.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:28:08.000Z"
  },
  "company": {
    "name": "Premier Research",
    "link": "https://www.linkedin.com/company/premier-research"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}