{
  "job": {
    "title": "Machine Learning Engineer - Computer Vision Retail Engineering",
    "industry": "Consumer Electronics",
    "description": "Are you passionate about designing simple software solutions to seek sophisticated tasks? We are looking for someone who thrives on collaboration and wants to push the boundaries of what is possible today!   Join our team of driven and dedicated software engineers in the Retail Apps Engineering team in Austin. We build software and hardware solutions that power the worldwide fleet of Apple Retail locations. As a member of the group, you will develop ML solutions for exciting new technologies that drive top-level customer and employee experiences in our stores. Excellent collaboration and interpersonal skills Excellent software design, problem solving and debugging skills Excellent understanding of data structures and algorithms Expertise in Python, TensorFlow/Keras with familiarity of PyTorch Solid mathematical foundation in linear algebra Solid experience with graph data structures and algorithms Solid knowledge of GPU   Consistent  track record of successfully  shipping Projects   Strong interest in latest Machine Learning Research   Experience with object detection and/or multi-object tracking is a plus Demonstrate your experience in order to help us deliver a one-of-a-kind product within Apple. You will work on a highly focused team which is developing an innovative, Privacy-conscious computer vision and machine learning system for Apple Retail worldwide. You will collaborate cross-functionally with various disciplines including our deep learning and computer vision algorithm engineers to build software solutions for Apple’s groundbreaking retail experience. Masters or Bachelors in Computer Science or similar; and 3+ years of proven experience    Role Number: 200275673",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T03:14:43.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}