{
  "job": {
    "title": "Remote Senior DevOps Engineer / Site Reliability Engineer",
    "industry": "Information Technology and Services,Computer Software",
    "description": "This Jobot Job is hosted by Amber Heigerick  Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.  Salary $150,000 - $175,000 per year We are a well established Technology company consistently voted best places to work! We believe that everyone deserves to thrive at the company they are part of! We treat our employees like our clients, without you we wouldn't have a company! We give our employees unlimited PTO, flexible work hours, and every other Fridays off. These are just some of our perks. We have very low turn-over, because we have happy employees. We like to promote from with in whenever possible and 90% of the time, are able to do that. Come join a company that you can learn, grow, have fun, and create memories and experiences that will last a lifetime! You will be a key member of our fast-growing and high-performing team that keeps our production environments stable, as well as creates tooling to enable our internal customers.  Build software releases and testing new code; as an automation expert using tools that automate the development, testing and integration of software releases/fixes  Ensure each and every release is stable and; as a security officer, continually monitoring our product's health and security after update deployment.  Design, develop, and implement software that defines and evolves our infrastructure.  Troubleshoot production issues and coordinate with the development team to streamline code deployment.  Implement automation tools and frameworks (CI/CD pipelines).  Analyze code and communicate detailed reviews to development teams to ensure a marked improvement in applications and the timely completion of projects.  Collaborate with team members to improve the company's engineering tools, systems and procedures, and data security.  Optimize the company's computing architecture.  You should know the following  5+ years of experience in DevOps Engineering  Knowledge on Source Control Tools such as GIT, and GitHub  Experience with with Infrastructure-as-code concepts and tools, such as Terraform.  Experience with Continuous Integration (CI) tools such as Jenkins/Bamboo, source control systems such as Bitbucket/Git.  Must be proficient in one or more scripting languages Unix Shell, Perl, Python.  Experience in a production environment with AWS or GCP.  Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T00:00:00.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}