{
  "job": {
    "title": "Data Scientist*",
    "industry": "Machinery,Mechanical or Industrial Engineering,Staffing and Recruiting",
    "description": "Choosing where to start and grow your career has a major impact on your professional and personal life, so it’s equally important you know that the company that you choose to work at, and its leaders, will support and guide you. With a diversity of people, global locations, technologies and products, 3M is a place where you can collaborate with 96,000 other curious, creative 3Mers.  “A long-lasting career at 3M comes from having vision, imagination and the ability to see what doesn’t exist. 3Mers are groundbreaking innovators and it’s important that we give every person the space for disruptive and creative thinking.” – John Banovetz, executive vice president, chief technology officer and environmental responsibility at 3M As a Data Scientist supporting Digital Twin Technology in the Corporate Supply Chain Operations & Services Organization, you will have the opportunity to tap into your curiosity and collaborate with some of the most innovative and diverse people around the world. To set you up for success in this role from day one, 3M requires (at a minimum) the following qualifications: Additional qualifications that could help you succeed even further in this role include: 3M offers many programs to help you live your best life – both physically and financially. To ensure competitive pay and benefits, 3M regularly benchmarks with other companies that are comparable in size and scope. For more details on what happens before, during and after the interview process, check out the Insights for Candidates page at 3M.com/careers.  Learn more about 3M’s creative solutions to the world’s problems at www.3M.com or on Twitter @3M.  Responsibilities of this position include that corporate policies, procedures and security standards are complied with while performing assigned duties.  Pay & Benefits Overview: https://www.3m.com/3M/en_US/careers-us/working-at-3m/benefits/  3M is an equal opportunity employer. 3M will not discriminate against any applicant for employment on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status. Carefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.  Please access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-23T19:13:49.000Z"
  },
  "company": {
    "name": "3M",
    "link": "https://www.linkedin.com/company/3m"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 78700,
    "max_value": 170700,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Maplewood",
    "region": "MN",
    "postal_code": "56304",
    "street_address": null,
    "latitude": 45.006413,
    "longitude": -93.02519
  }
}