{
  "job": {
    "title": "UX Researcher",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "UX Researcher, International - NetSuite GBU Burlington,MA or East Coast Remote A family of +60 UX Designers and Researchers around the world, working together with Product Managers, Software Engineers, Technical Writers and many other wonderful people. We pursue innovative ways of building user-centered solutions that can scale over time.  We work using Agile methodologies and iterative processes. We can proudly say we practice Design Thinking and iterate our solutions based on customer feedback and technical feasibility. And we keep the loop going with the efforts of dedicated, committed teams.  At NetSuite we think out-of-the-box and spend a lot of time brainstorming. The greatest and simplest solutions come from the group effort. And we move forward by bridging Experience Design with Product Management and Engineering at every step. We’re looking for a talented UX Researcher to join our International Experience Design Team as the main researcher for our spanish-speaking Latin American customers and partners, and working collaboratively with the local International Product Manager and a team of PM and Designers spread world-wide. Oracle NetSuite is growing faster than ever, and the company is investing heavily in ensuring the best resources are focused on expanding globally. You will be joining the team that is leading some of the key product initiatives for the company; a global product that feels local.  You will be focusing on the Internationalization and Localization efforts in LatAm (most specifically in Mexico and Colombia at first). You will empathize with users on these countries and building last-mile functionality that will make the product feel like it's built for them.  Are you capable of translating challenging business problems into simple interaction solutions? Do you have the instinct to design for simplicity? Have you spent time understanding the users’ profiles and tailoring solutions to their workflows? Are you comfortable presenting rationales of your design work and justify your decisions? Are you willing to work together with fellow designers and collect feedback while moving further? Because we believe that innovation starts with diversity and inclusion, we’re committed to creating a workplace where all kinds of people work together. All qualified applicants will receive consideration for employment without regard to race, color, national origin, marital status, sexual orientation, gender, gender identity, age, religion, disability, protected veteran status, or any other characteristic prohibited by federal, state, or local law.  Responsible for creating, evaluating and modifying prototypes to support evolving hardware and software application development.  As a member of the User Experience team, you will develop and apply software design/usability processes in the investigation of technical problems. May develop user profiles, with emphasis on human error control, display issues, visual interaction, physical manipulation and task and objective analyses. Provide product usability, evaluation and support to product development teams, including the analysis and investigation of applications/systems including tactile methods, visual graphics, web, multimedia, voice response and conversational user interaction. May assist in developing design concept and implementation, providing input on user design considerations. May produce specifications describing user needs and internal structures for product in development.  Duties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. Typically one year of software engineering or related experience needed. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T03:40:36.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Burlington",
    "region": "MA",
    "postal_code": "01803",
    "street_address": null,
    "latitude": 42.504986,
    "longitude": -71.19583
  }
}