{
  "job": {
    "title": "Senior PE (Multifamily Builder, $50+ MIL Annual Volume)",
    "industry": "Construction",
    "description": "If you are a Senior Project Engineer looking to grow your career with a locally-focused and growing General Contractor with an established book of business - please read on!  Top Reasons to Work with Us  Since 2004, we have grown to become the General Contractor of choice for private and public sector clients alike. We are a tight-knit group with the ability to take on larger, complex project but also offer the personalized experience and customized approach of a smaller firm. With an annual revenue in the at ~$50 MIL, we may not be the biggest name in the industry but our custom-tailored approach to each project and passion in multifamily construction, specifically within the affordable housing space has made us one of the most trusted names in the greater Sacramento region for over 15 years. We are currently expanding our teams with future projects in preconstruction and seeking a senior-level Project Manager with strong vertical construction experience within commercial and multifamily construction.  What You Will Be Doing What You Need for this Position What's In It for You So, if you are a Project Engineer with leadership experience in high-density multifamily construction, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Pat.Ward@CyberCoders.com Pat Ward - Recruiting Manager - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:31:42.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "high school"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Sacramento",
    "region": "CA",
    "postal_code": "95820",
    "street_address": null,
    "latitude": 38.576935,
    "longitude": -121.49495
  }
}