{
  "job": {
    "title": "Electrical Test Engineer",
    "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
    "description": "Maxar is currently seeking an Electrical Test Engineer to join our Assembly Integration and Test department in Palo Alto, CA. In this role, you will be responsible for all electrical testing of a given spacecraft, from Communication Panel and Bus Module Integration through Launch Base activities. This includes test planning, development, data analysis, and initial troubleshooting efforts, as required. Analyze and evaluate electrical circuits and interfaces using engineering knowledge.  Lead an electrical test team for 3 shift, 7 days a week operations.  Perform long term planning (future test phases), and new program development.  Collaborate with Spacecraft Manager, Mechanical Vehicle Engineer and Communication Vehicle Engineer.  Support any shift required during the course of the spacecraft build process.  Travel offsite for certain test phases and launch base support.  Communicate with peers using proper verbal and written skills.  Write, review, and/or consult on electrical test procedures.  Use electrical testing equipment (oscilloscopes, multimeters, power supplies ect.).  Document all non-conformances and test anomalies, following Assembly, Integration and Test (AIT) policies.  Troubleshoot test scripts.  Ensure testing is in compliance with the test requirements document (TRD).  Use Omega 3 data handling architecture and electrical power subsystem (EPS) architecture.  Lead complex electrical spacecraft level troubleshooting efforts with support of systems engineering. Must be a U.S. citizen or permanent resident.  Bachelor's degree in engineering or a related field. Four years of additional experience may be substituted for a degree.  2 years of relevant experience. 5 years of relevant experience.  Familiarity with satellite design and testing obtained through educational training and/or on-the-job experience in a related field.  Familiarity with satellite command and telemetry databases and wirelists.  Program management experience.  Highly skilled with Microsoft Office.  Strong collaboration and communication skills.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T22:50:33.000Z"
  },
  "company": {
    "name": "Maxar Technologies",
    "link": "https://www.linkedin.com/company/maxar-technologies-ltd"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}