{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Finicity is recognized as a pioneer and leader in Financial Data Access, FinTech, Data Science and Decisioning. Consumers should have full transparency and control of their Financial Data. Finicity expands financial inclusion, and increases financial and data literacy.  Finicity's Intelligent Machine Services teams focus on Intelligent Decisioning; Financial Certainty; Attribute, Feature, and Entity Resolution; Verification Solutions and much more. Join our team to make an impact across all sectors of the economy. Check out Experian Boost, UltraFICO and the recent announcement from Mastercard for more! This team is establishing the ground floor for advanced Data Science and AI enabled financial interactions and transactions. Mastercard announced in June that it has entered into an agreement to acquire Finicity. In this role, Senior Data Scientists will realistically be determining the probability space and the elsewhere of probable for almost any financial interaction. Finicity’s solutions provide Intelligence and real-time access to Financial data.  Your Impact as a Data Scientist  As a Data Scientist, you will take lead on empowering consumers and creating business value. You will own business objectives and will work to deploy solutions to financial institutions, FinTechs, small and medium businesses, large enterprises consumers and even government agencies and related ecosystems.  Key responsibilities include: About Finicity:  Finicity, a Mastercard company, helps individuals, families, and organizations make smarter financial decisions through safe and secure access to fast, high-quality data. Our trusted and proven open banking platform empowers consumers to easily connect their financial data to the apps they choose, transforming the way we experience money for everything from budgeting and payments to investing and lending.  Through market-leading data connections, Finicity partners with influential financial institutions and disruptive fintech providers alike to give consumers a leg up in a complicated financial world, helping to improve financial literacy, expand financial inclusion, and ultimately lead to better outcomes. Finicity is headquartered in Salt Lake City, Utah.  Finicity provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.  Powered by JazzHR  sH2HTaA7Ae",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T07:13:53.000Z"
  },
  "company": {
    "name": "Finicity, a Mastercard Company",
    "link": "https://www.linkedin.com/company/finicity"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 77300,
    "max_value": 167700,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Salt Lake City",
    "region": "UT",
    "postal_code": "84101",
    "street_address": null,
    "latitude": 40.758476,
    "longitude": -111.888145
  }
}