{
  "job": {
    "title": "Data Engineer",
    "industry": "Information Technology and Services,Design,Computer Software",
    "description": "Work at a company where people truly believe in what they’re doing! At Wonderlic, we combine our science-based assessment background with the best talent to innovate the way modern pre-employment screening is leveraged by the recruiting industry. Our mission is to expertly combine I/O psychology, machine learning, and artificial intelligence to ensure applicants are able to find their best jobs. Wonderlic provides the most trusted, scientifically validated assessments for sophisticated HR teams looking to identify top applicants and accurately predict on-the-job performance potential.  As a people-first company, we’re constantly on the lookout for the best and brightest minds to propel Wonderlic forward. Do you strive for excellence? Are you driven by the desire to make positive changes in the world you live in? Are you passionate about your craft? Join Wonderlic in shaping the future of our organization. We’d be happy to have you. Data Engineer Fully-remote position with infrequent voluntary travel into the Vernon Hills, IL office No direct reports Manager, AI Innovation Wonderlic is looking for a brand new Data Engineer, and we hope it’ll be you. Why? Because you’re ready to expand Wonderlic’s competitive edge, working closely with our talented team of data scientists to deliver cutting-edge user experiences. You’re confident in your ability to identify relevant opportunities where streamlined data pipelines and a single, reliable source of truth can make a difference for our organization’s emerging data strategy.  As a Wonderlic Data Engineer, you’ll partner with stakeholders to internalize the problem domain, uncovering opportunities where various data solutions are appropriate. Your passion for data, creative problem-solving, and ownership will empower you to deliver these data products end-to-end, from design to launch. Through technical excellence, you will play a significant role in enhancing our processes and improving our toolkits. Wonderlic is proud to be an equal employment opportunity/affirmative action employer. Here, diversity is valued and celebrated, and is what makes us such a successful team. Wonderlic does not discriminate in employment on the basis of race, color, religion, gender, gender identity, pregnancy status, national origin, sexual orientation, marital status, disability, genetic information, age, parental status, military/veteran status, or any other factor protected by law. This job description is not designed to include a comprehensive list of duties and responsibilities that are required of the employee. Duties and responsibilities may change or be assigned at any time, with or without notice.  Powered by JazzHR  zokUBQlxjI",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-20T19:09:45.000Z"
  },
  "company": {
    "name": "Wonderlic",
    "link": "https://www.linkedin.com/company/wonderlic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}