{
  "job": {
    "title": "Machine Learning Engineer, Applied ML",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Robinhood was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering barriers, removing fees, and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in. Just as we focus on our customers, we also strive to create an inclusive environment where our employees can thrive and do impactful work. Robinhood is backed by leading investors that include DST Global, Index Ventures, NEA, Ribbit Capital, Thrive Capital, and Sequoia.  Check out life at Robinhood on The Muse! Insights from data power most decisions at Robinhood. The Core ML team works with a simple mission of making it easy to use machine learning at Robinhood. The team is executing the mission by building the core infrastructure (eg. training and serving platform, feature platform) and a number of model-as-a-service solutions (eg. embedding service, multi-arm bandit service). The team works closely with data scientists who are applying ML in various spaces such as risk and fraud, growth, customer understanding etc. to ensure that they are able to ship their solutions to create business value.  As a , you will work closely with other teams to identify critical problems that can be solved using ML. You will co-develop a model, sometimes an ML system, with them and then, whenever possible, build and deploy the solution as a reusable and generalizable ML service. You will continue to build such services and onboard new applications to existing services over time. Feeling ready to give 100% to democratizing finance for all? We’d love to have you apply, even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we’re looking for people invigorated by our mission, not just those who simply check off all the boxes.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-04T01:08:06.000Z"
  },
  "company": {
    "name": "Robinhood",
    "link": "https://www.linkedin.com/company/robinhood"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 132000,
    "max_value": 203000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Menlo Park",
    "region": "CA",
    "postal_code": "94029",
    "street_address": null,
    "latitude": 37.45322,
    "longitude": -122.18322
  }
}