{
  "job": {
    "title": "Software Engineer (Returnship) - Opportunity for Working Remotely",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "The program at VMware is an 18-week paid returnship for experienced professionals returning to the workforce after taking time off for caregiving. The program is open to individuals who have at least 5 years of professional experience and have been out of the paid workforce for at least 2 years to focus on caring for a child or other dependent. If you meet these criteria, we welcome you to apply. Applicants are not limited to the locations listed. Candidates may apply from anywhere within the US. VMware Telco & Edge Cloud Business Unit is looking for a highly motivated software engineer to join the team that is building a purpose-built telco platform. You will have unique opportunities to develop next generation cloud native Telco platform with bunch of exciting cutting edge technologies including 5G/6G, K8s platform, cloud native services, FPGA/GPU/SmartNIC optimization and so on. We are looking for strong candidates with technical passion, quick learning and self-motivated to join us.  We use a wide range of technologies such as Java, Kubernetes, Go, Python, etc. just to name a few. And we have a large catalog of internal and external training content that you can leverage if you need to brush-up on something you know or to learn something new. https://www.techrepublic.com/article/top-20-tech-companies-for-remote-jobs-in-2020/ VMware Telco & Edge Cloud Business Unit is looking for a highly motivated software engineer to join the team that is building a purpose-built telco platform. You will have unique opportunities to develop next generation cloud native Telco platform with bunch of exciting cutting edge technologies including 5G/6G, K8s platform, cloud native services, FPGA/GPU/SmartNIC optimization and so on. We are looking for strong candidates with technical passion, quick learning and self-motivated to join us. Success in the role is defined by the ability to consistently create high-quality code that addresses the business requirement and, is well tested, performant and maintainable. Most of your time will be spent writing high-quality code based on engineering team coding standards that include excellent test coverage using Go or Java. You can expect to be the owner and take accountability for the quality of your code. You will need to become very familiar with the market we operate in and the problems the product addresses. Understand the challenges and limitations of the existing system. Demonstrate the ability to contribute to engineering roadmap and design discussions considering both these. This job requisition is not eligible for employment-based immigration sponsored by VMware University and Recent Grads Internships Full Time 2021-05-17  VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.  Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:35:43.000Z"
  },
  "company": {
    "name": "VMware",
    "link": "https://www.linkedin.com/company/vmware"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Kansas City",
    "region": "MO",
    "postal_code": "64113",
    "street_address": null,
    "latitude": 39.099792,
    "longitude": -94.57856
  }
}