{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Marketing and Advertising,Computer Software,Financial Services",
    "description": "You are someone who brings your life experience to create products that truly make a difference in the lives of working parents. You use data to inform roadmaps, but you also know when you have enough information for action. You love the challenge of prioritizing user needs amongst multiple business objectives. You enjoy growing from diverse perspectives and coworkers while collaborating with others in a cross-functional team, and across departments.  You are looking for something more from your job. Maybe a bigger problem to solve with both immediate and long term impact, or perhaps you just need a mission you can believe in every day. You are scrappy and collaborative while looking to join an inclusive and supportive culture with a bias for action. You dig a balanced startup life and can wrestle challenges with grace. You love big, interesting problems and bringing solutions to the masses while making sure it feels personal, authentic and connected. If this sounds like you, we'd like to talk. The Mom Project is a pioneering, remote-first venture-backed startup with roots in Chicago & Cincinnati. We are backed by some of the best investors in the world and are lucky to be surrounded by an incredible team of advisors, including Serena Williams. The Mom Project is a platform and community leading a movement that matches companies with diverse talent. This critical match drives businesses forward while expanding professional opportunities for women.  Our team is growing as we push to rewrite the narrative for working women at every stage of life. We believe women should be able to choose both a successful family life AND career aspirations without sacrificing one over the other. Our commitment to Diversity Equity & Inclusion across race, gender, age, religion, identity, and experience drives us and our mission forward every day. We strive towards inclusion and that means everyone is comfortable bringing their authentic and best self to work every day. The Mom Project (TMP) is excited to find a motivated Site Reliability Engineer passionate about building a stable and scalable product. As an early member of the Infrastructure team, you’ll be responsible for overseeing the development, implementation, and maintenance of the cloud infrastructure (AWS) used by our applications. Our goal is to develop and support the systems and automations that drive our business-critical platform, ensuring high uptime and quality deployments, while maintaining operational flexibility. We’re especially excited about candidates who have experience working with some (or all!) of the following technologies: Let me see those Perks, Perks, Perks We're just getting started. Join us in building the future of work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T01:03:22.000Z"
  },
  "company": {
    "name": "The Mom Project",
    "link": "https://www.linkedin.com/company/the-mom-project"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}