{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
    "description": "Heron Systems has developed a software factory for building and optimizing deep reinforcement learning-based solutions. The technology has drawn significant interest from DARPA, AFRL and the US Navy. We are currently working with these customers to investigate modern warfighting problems and develop prototype solutions. This position will support at least one of our Machine Learning teams to help build a solution while simultaneously advancing the technology more broadly. If you're interested in being part of our team, apply now!  Shield AI is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to  equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know.  To conform to U.S. Government regulations, applicant must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T05:03:32.000Z"
  },
  "company": {
    "name": "Shield AI",
    "link": "https://www.linkedin.com/company/shield-ai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Alexandria",
    "region": "VA",
    "postal_code": "22336",
    "street_address": null,
    "latitude": 38.804665,
    "longitude": -77.04362
  }
}