{
  "job": {
    "title": "Senior Software Engineer, UI - Unpublished R&amp;D Product",
    "industry": "Computer Games,Computer Software,Internet",
    "description": "Riot engineers bring deep knowledge of specific technical areas but also value the opportunity to work in a variety of broader domains. As a Senior Software Engineer, you’ll also dive into projects that focus on team cohesiveness and cross-team objectives. You’ll partner closely with other game makers on features and provide other engineers with a clear illustration of extraordinary engineering.  As a Senior Software Engineer focused on UI within Research & Development, you are armed with a wealth of knowledge on the intricacies of game UI technology to inject life into an exciting new game. You will work in a team alongside a product lead, designers, artists, and other engineers to answer fundamental product questions and build experiences that will fulfill our players’ imaginative dreams. You will report to the Engineering Manager of the project. We offer medical, dental, and vision plans that cover you, your spouse/domestic partner, and children. Life insurance, parental leave, plus short-term and long-term disability coverage are also available. Riot will support your retirement benefits with a company match, and double down on your donations of time and money to non-profit charitable organizations. Balance between work and personal life is encouraged with open paid time off, and a play fund so you can broaden and deepen your personal relationship with games.  It’s our policy to provide equal employment opportunity for all applicants and members of Riot Games, Inc. Riot Games makes reasonable accommodations for handicapped and disabled Rioters and does not unlawfully discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, handicap, veteran status, marital status, criminal history, or any other category protected by applicable federal and state law, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance relating to an applicant's criminal history (LAMC 189.00)",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T18:35:39.000Z"
  },
  "company": {
    "name": "Riot Games",
    "link": "https://www.linkedin.com/company/riot-games"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}