{
  "job": {
    "title": "Software Engineer I",
    "industry": "Hospital &amp; Health Care",
    "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.  A healthy heart is essential to good health. That's why we're committed to advancing treatments for people with cardiovascular disease. As a global leader in Cardiac Rhythm Technologies, our breakthrough medical technologies help restore people's health so they can get back to living their best lives, faster. We focus on innovative technologies that can improve the way doctors treat people with heart arrhythmias, or irregular heartbeats.  Our location in currently has an opportunity for a .  Contribute to the design and development of software across Android and iOS mobile applications under a disciplined product development process that meets Abbott quality and appropriate regulatory agency requirements. At Abbott, you can have a good job that can grow into a great career. We offer: www.abbottbenefits.com  Follow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.  Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T00:00:00.000Z"
  },
  "company": {
    "name": "Abbott",
    "link": "https://www.linkedin.com/company/abbott-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 6,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 70300,
    "max_value": 136000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Sunnyvale",
    "region": "CA",
    "postal_code": "94089",
    "street_address": null,
    "latitude": 37.373676,
    "longitude": -122.036575
  }
}