{
  "job": {
    "title": "Data Scientist",
    "industry": "Consumer Goods,Food &amp; Beverages",
    "description": "Budweiser. Bud Light. Stella Artois. Michelob ULTRA. That’s right, over 100 of America’s most loved brands, to be exact. But there’s so much more to us than our top-notch portfolio of beers, seltzers, and more. We believe our people are our greatest asset, and we’re looking for people like you to join our shared dream of bringing people together for a better world. Are you up for the Challenge?  In the role as Data Scientist you will own data structure and analysis for all new data science strategic processes and drive future data structure and platform solutions to ensure optimized performance and reliability of required data. You will assist the Data Science Team with data requirements to ensure efficient and effective data flow, align with the Data Science Team members on a strategic vision and plan for new technology systems and applications solution opportunities and work with Global TechSupply on a new technology roadmap and initiatives for the North America Zone. Anheuser-Busch is here for the times that matter. The moments where we celebrate, defy challenges, dream of the brighter future we are building today– and all the moments in between. We are a company that brings people together for richer conversations, sweeter celebrations and stronger communities.   Challenge Accepted! Apply Today! We offer generous benefit plan options that can be tailored for your unique needs and wellbeing and are effective on day 1. Here are just a few: Supply United States-Missouri-St. Louis-A-B Headquarters Complex Full-time Permanent $100,000.0 - $112,500.0 Sep 7, 2021 As the leading global brewer, Anheuser-Busch InBev is committed to finding innovative ways to continually improve. It's this kind of thinking that creates a unique work environment by rewarding talent, celebrating diversity and encouraging forward thinking. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status or any other characteristic protected by applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T02:50:09.000Z"
  },
  "company": {
    "name": "Anheuser-Busch",
    "link": "https://www.linkedin.com/company/anheuser-busch"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 75400,
    "max_value": 106000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "St Louis",
    "region": "MO",
    "postal_code": "63121",
    "street_address": null,
    "latitude": 38.635357,
    "longitude": -90.20099
  }
}