{
  "job": {
    "title": "Embedded Software Engineer - C Programming, Hardware, Systems",
    "industry": "Computer Hardware",
    "description": "If you are an Embedded Software Engineer with C programming experience, please read on!  With locations around the world, we're a technology powerhouse on a mission to develop the next generation of cutting-edge, networking products and services for our customers! Due to explosive growth and increased demand for our products/services, we're looking to expand our embedded engineering team with talented programmers with C programming skills for embedded systems (hardware/firmware).  Top Reasons to Work with Us What You Will Be Doing What You Need for this Position Pluses What's In It for You For your hard work and dedication, you will be rewarded with a competitive base salary, RSUs and benefits including but not limited to So, if you are an Embedded Software Engineer with C Programming experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Pat.Befort@CyberCoders.com Pat Befort - Recruiting Manager - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:01:33.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}