{
  "job": {
    "title": "Software Engineer I",
    "industry": "Banking,Financial Services",
    "description": "At Bank of the West, our people are having a positive impact on the world. We’re investing where we feel we can make the most impact, like advancing diversity and women entrepreneurship programs, financing for more small businesses, and promoting programs for sustainable energy. From our locations across the U.S., Bank of the West is taking action to help protect the planet, improve people’s lives, and strengthen communities. We are part of BNP Paribas, a global leader supporting the UN Sustainable Development Goals (SDGs). Yes, we’re a bank, but as the bank for a changing world, we are continually seeking to improve the ways we help our customers, while contributing to more sustainable and equitable growth. Contributes to the development, modification, testing, adaption, and/or implementation and post implementation support of short- and long-term software solutions to business and technology needs. Reviews system requirements and business processes; codes, tests, debugs and implements software solutions. Works independently in a fast paced environment on moderately complex issues. Bank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran.  Bank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations. United States-Arizona-Tempe Technology Sep 1, 2021, 8:27:58 PM",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:20:22.000Z"
  },
  "company": {
    "name": "Bank of the West",
    "link": "https://www.linkedin.com/company/bank-of-the-west"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Tempe",
    "region": "AZ",
    "postal_code": "85280",
    "street_address": null,
    "latitude": 33.42552,
    "longitude": -111.94125
  }
}