{
  "job": {
    "title": "Machine Learning Research Engineer",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
    "description": "We invite you to join us to explore, innovate, develop and deliver state-of-art end-to-end machine learning solutions to customers, and the academic research community. As a Machine Learning Research Engineer you will join a team of deep learning research scientists within Intel Lab's AI Lab. In your role you will work with the research scientists participating in all phases of end-to-end machine learning solutions development - including technical design, implementation, quality assurance, and performance optimization; resolving challenging customer pain points in scaling machine learning solutions. In either research environments or specific product environments, utilize current programming methodologies to translate machine learning models and data processing methods into software.  Complete programming, testing, debugging, documentation and/or deployment of the solution/products.  Implement machine learning algorithms, such as supervised and unsupervised learning, reinforcement learning, transfer learning, and others, to solve applied problems in various disciplines such as Computer Vision, Natural Language Processing, Robotics, Cybersecurity, etc. This position involves work on a U.S. Government contract which may impose certain security requirements: If you are a U.S. citizen, the government may require that you certify that you are a U.S. citizen. If you are not a U.S. citizen, the government may require you to pass a security check before you can be approved to work on the project. Please note that any offer by Intel for this position is conditioned upon meeting and/or passing the U.S. government's security check requirements should the government impose these requirements. Minimum qualifications are required to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Requirements listed would be obtained through a combination of industry relevant job experience, internship experiences and or schoolwork/classes/research. The candidate must possess a Bachelor’s degree (with 4+ years’ experience), Master’s degree (with 2+ years’ experience), or PhD degree (with 1+ years’ experience) in Electrical Engineering, Computer Engineering, Computer Science or Applied Mathematics. Intel harware optimization libraries including OpenVINO, MKL-DNN, etc. Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units. US, Arizona, Phoenix;US, Oregon, Hillsboro;US, Virginia, Fairfax All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-19T09:57:16.000Z"
  },
  "company": {
    "name": "Intel Corporation",
    "link": "https://www.linkedin.com/company/intel-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}