{
  "job": {
    "title": "Climate / Remote Sensing Data Analyst (Associate Level)",
    "industry": "Environmental Services,Civil Engineering,Oil &amp; Energy",
    "description": "is seeking a self-starting, dynamic to join our consulting team in . As part of our Geospatial and Climate Analysis Team, you will provide high-quality analytical support to ERM clients while working closely with team members, and in collaboration with and support of senior team members. Your work supporting ERM clients will include analyzing and processing large climate and geospatial data layers, generating insight, and creating visuals and reports to help solve our clients’ needs. Assignments will be primarily desktop work but will include domestic and international travel on occasion. Advanced remote sensing skills are required as well as experience with climate change data modeling. The successful candidate will be a highly skilled and confident user of a wide array of scripting languages and geospatial software platforms (both desktop and cloud-based), and should have the ability to prepare applications and documents that are essentially client-ready. This is an excellent opportunity for aspiring junior or mid-level consultant looking to advance his or her career with a global sustainability leader, and to do so in collaboration with a wide array of Subject Matter Experts. As the largest global pure play sustainability consultancy, we partner with the world’s leading organizations, creating innovative solutions to sustainability challenges and unlocking commercial opportunities that meet the needs of today while preserving opportunity for future generations.  Our diverse team of world-class experts supports clients across the breadth of their organizations to operationalize sustainability, underpinned by our deep technical expertise in addressing their environmental, health, safety, risk and social issues. We call this capability our “boots to boardroom” approach for its comprehensive service model that allows ERM to develop strategic and technical solutions that advance objectives on the ground or at the executive level.  Please submit your resume and brief cover letter. Based on review of these responses, shortlisted candidates will be invited for interviews.  ERM does not accept recruiting agency resumes. Please do not forward resumes to our jobs alias, ERM employees or any other company location. ERM is not responsible for any fees related to unsolicited resumes.  ERM is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, gender identity, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.  Thank you for your interest in ERM!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T02:27:14.000Z"
  },
  "company": {
    "name": "ERM: Environmental Resources Management",
    "link": "https://uk.linkedin.com/company/erm"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Washington",
    "region": "DC",
    "postal_code": "20398",
    "street_address": null,
    "latitude": 38.892063,
    "longitude": -77.01991
  }
}