{
  "job": {
    "title": "Software Engineer - Java, SQL, C#, $180k-$200k + Bonus",
    "industry": "Retail",
    "description": "Job Title: Software Engineer - Java, SQL, C# Location: Redwood City, CA or REMOTE Salary Range: $180-$200k + Bonus + Benefits Requirements: Java, SQL, C#, Databases  We are a growing internet marketplace company based in Redwood City, California. We have created an innovative retail and technology platform where users can instantly create, purchase, and sell their products online. Due to growth we are seeking a superstar Software Engineer to join our growing team. The ideal candidate will have 5+ years of experience with Java, SQL, C#, and be an innovative team player.  If this sounds like you, please apply for this awesome opportunity. We are interviewing candidates this week and next!  What You Will Be Doing  You will be developing and operating software on all server clusters, including web servers, search servers, and various service/API servers. You will also be developing software for workflow systems, tools and batch processes for background processing.  What You Need for this Position What's In It for You  We are a unique company that strives for innovation, if hired you will be rewarded with an offer that will include\" So, if you are a Software Engineer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Gino.Tunzi@CyberCoders.com Gino Tunzi - Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:00:54.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 77400,
    "max_value": 142000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Redwood City",
    "region": "CA",
    "postal_code": "94064",
    "street_address": null,
    "latitude": 37.4805,
    "longitude": -122.21528
  }
}