{
  "job": {
    "title": "Software Engineer",
    "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
    "description": "Intel is seeking highly qualified candidates to join our Data Platforms Group (DPG) as a Network Software Engineer. This role is part of DPG's Ethernet Product Group where you will work on exciting products fueling the data center growth.  In this role, you will perform network product design, testing, documentation, and analysis of software applications and wired network drivers. Your daily agenda will be anything but ordinary. On a regular basis, you will be responsible for the validation of new programs and subprograms as well as enhancements, modifications, and corrections to the existing software validation scripts, process, and test passes.  As a Software Engineer on this team, you will be responsible for the validation of network drivers on various operating systems across Linux, Windows, Free BSD and ESXi on a variety of foundational and smart NIC products. Additionally, you will review and analyze the requirement documents and architecture specifications to understand the product interact with marketing and architecture teams to understand the scalability and performance aspects and customer use cases. In this position you will gain invaluable experience which will allow growth and expanded opportunities within this business group as well as future possible opportunities with other business groups within Intel.  The Data Platforms Group drives new products technologies from high-end co-processors for supercomputers to low-energy systems for enterprise and the cloud, as well as solutions for big data and intelligent devices. The group is a worldwide organization that develops the products and technologies that power 9 of every 10 servers sold worldwide. Candidates must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Requirements listed below would be obtained through a combination of industry relevant job experience, internship experiences and or schoolwork/classes/research. The Data Center Group (DCG) is at the heart of Intel’s transformation from a PC company to a company that runs the cloud and billions of smart, connected computing devices. The data center is the underpinning for every data-driven service, from artificial intelligence to 5G to high-performance computing, and DCG delivers the products and technologies—spanning software, processors, storage, I/O, and networking solutions—that fuel cloud, communications, enterprise, and government data centers around the world. All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T04:08:41.000Z"
  },
  "company": {
    "name": "Intel Corporation",
    "link": "https://www.linkedin.com/company/intel-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Hillsboro",
    "region": "OR",
    "postal_code": "97124",
    "street_address": null,
    "latitude": 45.52395,
    "longitude": -122.98974
  }
}