{
  "job": {
    "title": "Site Reliability Engineer - 100% Remote",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Bigtincan is an AI-powered Sales Enablement and Automation Platform that adapts to your sales process, delivering the right content for selling, training, and coaching for all your teams.  Since our inception in 2011, Bigtincan has grown into a global company headquartered in Waltham, Massachusetts with offices in London and Sydney, Australia. We’ve partnered with Apple, AT&T, and other technology leaders and are used by the largest, most successful companies in the world such as, Exxon, Titleist, Guess Jeans, and Amazon, to accelerate their sales and marketing initiatives. Our award winning platform is recognized by Gartner as the only solution in their Sales Engagement Platform category to meet all of their feature requirements. YOU'D BE A FANTASTIC MATCH FOR THIS ROLE IF YOU BRING Our benefits include tremendous career growth opportunities, competitive salary, stock options, health benefits, 20+ PTO days, 401K, company events & outings, trips to our offices on the US East Coast (Boston, MA), Europe (Glasgow Scotland) and Australia (Sydney, Brisbane) and of course, a fun team of Bigtincaners to work with!  Bigtincan (ASX BTH) helps sales and service teams increase win rates and customer satisfaction. Leading brands including AT&T, Thermo Fisher, Merck, ANZ Bank and others rely on Bigtincan to enhance sales productivity and fuel customer engagement. With global sales and marketing headquartered in Boston, Bigtincan also has offices across EMEA, Australia and Asia. To discover more about us, please visit www.bigtincan.com  Bigtincan is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, nationality",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-13T04:19:37.000Z"
  },
  "company": {
    "name": "Bigtincan",
    "link": "https://www.linkedin.com/company/bigtincan"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}