{
  "job": {
    "title": "Scientist 5 Data Science.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Senior Scientist Neurodegeneration Discovery AI/ML and Informatics Research Janssen Research & Development is recruiting for Senior Scientist, Neurodegeneration Discovery AI/ML, located in Titusville, NJ or Beerse, Belgium! This outstanding data scientist will craft impactful data science solutions to the challenge of identifying and validating of novel targets to progress through preclinical and experimental medicine studies. We analyze high-dimensional molecular datasets from preclinical models generated and human data from both research and real-world sources, developing methodologies to link data to mechanistic hypotheses. You will be part of our high-performing, cross-functional team of bioinformaticians, data scientists and discovery scientists at Janssen, and as part of our collaborations with top external partners in academia and industry. The role requires knowledge of sophisticated analytics including linking bioinformatics with artificial intelligence and machine learning, inventing and customizing novel methods. The candidate will lead machine learning initiatives integrating across a wide range of molecular data types to support Target Identification and Validation for Alzheimer's, Parkinson's and other neurodegenerative diseases.  The candidate's work will be tightly coupled with our computational chemistry and high content imaging programs in the discovery organization, and with our Neurodegeneration Disease Area in the Neuroscience Therapeuticc Area. PhD with 2-5 years of progressive experience in a computational or physical science with prior applying data science to life sciences. A degree in a biological science with extensive application of data science methodologies will also be considered. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.  Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. United States-New Jersey-Titusville-1125 Trenton Harbourton Road Janssen Research & Development, LLC (6084) R&D 2105946236W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T17:38:08.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 93800,
    "max_value": 174000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Titusville",
    "region": "NJ",
    "postal_code": "08560",
    "street_address": null,
    "latitude": 40.31713,
    "longitude": -74.87571
  }
}