{
  "job": {
    "title": "Software Engineer - Code to Cloud",
    "industry": "Computer Software",
    "description": "Do you want to make software development a delight for the entire world? Join us at GitHub!   We are delivering the best end to end software development experiences across GitHub and Azure DevOps.   We’re looking for world-class software engineers to join GitHub’s Code to Cloud organization. In this organization, we build solutions that enable engineers to easily package and deploy their software, right alongside their code. Code to Cloud is responsible for the full stack of features and technologies that power Github Actions, GitHub Packages, GitHub Pages, and Azure DevOps.  These services enable our millions of customers to follow industry best practices and deploy and maintain their products easily, increasing the impact of software solutions at a global scale.   Code to Cloud is growing fast and is hiring for many different frontend, backend, and full-stack roles across these services, so please reference the qualifications below to determine if any of these roles would be a good fit for you. In this role, you will have the opportunity to work as an engineer with a distributed, diverse and passionate team delivering features and improvements to the stack. You’ll work with our team of engineers, designers, and product managers to build and maintain customer-facing experiences and backend solutions to enable high-quality services running at global scale and deliver those experiences into the hands of millions of developers across the world. GitHub is the developer company. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where many Hubbers work, snack, and create daily. The rest of our Hubbers work remotely around the globe. Check out an updated list of where we can hire here: https://github.com/about/careers/remote   We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.   GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!   Please note that benefits vary by country. If you have any questions, please don't hesitate to ask your Talent Partner. GitHub is the developer company. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness At GitHub, we constantly strive to create an environment that allows our employees (Hubbers) to do the best work of their lives. We've designed one of the coolest workspaces in San Francisco (HQ), where many Hubbers work, snack, and create daily. The rest of our Hubbers work remotely around the globe. Check out an updated list of where we can hire here: https://github.com/about/careers/remote   We are also committed to keeping Hubbers healthy, motivated, focused and creative. We've designed our top-notch benefits program with these goals in mind. In a nutshell, we've built a place where we truly love working, we think you will too.   GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!   Please note that benefits vary by country. If you have any questions, please don't hesitate to ask your Talent Partner.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T01:11:20.000Z"
  },
  "company": {
    "name": "GitHub",
    "link": "https://www.linkedin.com/company/github"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Diego Metropolitan Area",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}