{
  "job": {
    "title": "Software Engineer I",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "We are an incubation studio with a mission to enable people with more personalized care in the home. The Covid-19 crisis presents an opportunity for Microsoft to participate in a dramatic shift with regards to how both society and the medical community view the delivery of health care. COVID-19 has shifted the standard office visit into the home, advancing the demand for virtual care and accelerating a long-forecasted trend for a new healthcare segment in home healthcare.  This emergence will democratize the delivery care, enabling more virtual care services such as remote monitoring into the home. As a result, the notion of in-home care services (also referred to as Connected Care) will become an increasingly used and vital mechanism for everyone on the planet. At Microsoft, we have a clear mission and bold ambitions: Empower every person and every organization on the planet to achieve more through our technology and innovation. To make that a reality, our Health Next Connected Care team is charged with incubating and delivering solutions that help transform these new opportunities into innovative solutions leveraging both existing and emerging technologies. Our goal is to enable new ways to broaden access to care - ultimately assisting the industry in to drive better health care experiences and outcomes for people around the world.      We’re a small but growing team, and we'd love for you to be a part of our story! Come join a positive and collaborative and passionate group of people—where everyone is encouraged to bring their authentic selves—and work at the forefront of innovation and transformation!  #ConnectedCare #Research #Incubation Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-04T03:55:31.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}