{
  "job": {
    "title": "Senior Site Reliability Engineer - Segment",
    "industry": "Information Technology and Services,Internet,Telecommunications",
    "description": "At Twilio Segment, we believe companies should be able to send their data wherever they want, whenever they want, with no fuss. Unfortunately, most product managers, analysts, and marketers spend too much time searching for the data they need, while engineers are stuck integrating the tools they want to use. Segment standardizes and streamlines data infrastructure with a single platform that collects, unifies, and sends data to hundreds of business tools with the flip of a switch. That way, our customers can focus on building amazing products and personalized messages for their customers, letting us take care of the complexities of processing their customer data reliably at scale. We’re in the running to power the entire customer data ecosystem, and we need the best people to take the market.  As a member of the Site Reliability Engineering (SRE) team, you’ll help to empower our entire R&D organization. Alongside a diverse distributed Infrastructure group you’ll participate in building the next iteration of our service platform; focusing on the reliability, operability, observability, flexibility, and cost-effectiveness of our production infrastructure. As a Site Reliability Engineer, you will live the Twilio Magic values: The Infrastructure Engineering group is central to Segment’s Platform strategy. The ecosystem of tools that your team creates and supports are the foundation for the services built by Product teams. In order to maintain our leadership position in the customer engagement space we must continue to build innovative services that support our developers in seamlessly delivering value to customers. You will partner with some of the brightest minds in the industry to push the boundaries of web-scale service delivery.  Twilio is a company that is empowering the world’s developers with modern communication in order to build better applications. Twilio is truly unique; we are a company committed to your growth, your learning, your development, and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion, and innovation and we want you and your ideas to thrive at Twilio. Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers.  In accordance with applicable law, the following represents Twilio's reasonable estimate of the range of possible compensation for this role if hired in Colorado. Salary Range: $109,824 - $137,280 Salary Range: $96,096 - $120,120 Additionally, this role is eligible to participate in Twilio's equity plan.  An overview of Twilio’s benefits offered is listed below: At the time of this posting, this role is eligible to participate in the following benefits, which Twilio reserves the right to modify at any time for any reason in accordance with applicable law  Twilio is committed to delivering a comprehensive benefits program that provides support needed for you and your loved ones. It’s likely that you don’t think about benefits every day; however, they are an important component of your total compensation, and we want you to understand the options available to you so that you can make the most of your benefit dollars.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T14:44:53.000Z"
  },
  "company": {
    "name": "Segment",
    "link": "https://www.linkedin.com/company/segment-io"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}