{
  "job": {
    "title": "Principal Validation Test Engineer - Photonics",
    "industry": "Semiconductors",
    "description": "If you are a Principal Validation Test Engineer with Photonics experience, please read on! Principal Validation Test Engineer - Photonics Pasadena, CA - Relocation assistance offered!  Our company's core technology platform was developed with a total focus on high volume manufacture of highly integrated optical/electronic devices. Our large waveguide photonics platform offers multiple benefits over conventional solutions. These benefits include higher density waveguide circuit design, better manufacturing tolerance, superior optical power handling, and a more efficient interface from the photonics IC to the physical domain.  Our company's technology simplifies the manufacturing, assembly, and test process while maximizing the power efficiency of the optical system.  Over half of our team holds advanced technical degrees (M.Sc and PhD) and it includes world recognized experts in photonics process development, photonics device design and modeling, high speed CMOS mixed signal circuits, optical circuit switching, optical sensing and measurement systems, and network systems architecture. Our business leaders have amassed a spectacular track record including in multiple photonics start-ups with impressive investor returns, in growing high volume optical manufacturing at scale, and in forging market-leading communications semiconductor product lines. Together, the team is driving a vision for pervasive silicon photonics across a broad range of high volume applications.  Top Reasons to Work with Us What You Will Be Doing  We are seeking best-in-class professionals to join our dynamic and innovative team. Candidates must have excellent written and oral communication skills, work well independently and in a team environment, and thrive on the challenges that come from working in a fast-paced start-up. What You Need for this Position  Must have a BS / MS in Electrical Engineering or similar with 5+ years experience/knowledge of the following: What's In It for You So, if you are a Principal Validation Test Engineer with Photonics experience, please apply today! or send an updated copy of your resume to for immediate consideration! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Mike.Vandenbergh@CyberCoders.com Mike Vandenbergh - Lead Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.  CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:16:19.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Pasadena",
    "region": "CA",
    "postal_code": "91122",
    "street_address": null,
    "latitude": 34.14955,
    "longitude": -118.14145
  }
}