{
  "job": {
    "title": "Software Engineer - Remote",
    "industry": "Financial Services,Health, Wellness and Fitness,Hospital &amp; Health Care",
    "description": "Position description  This is a full time remote position within the United States.  Mayo Clinic is seeking a Software Engineer to design and build back-end services that support our portfolio of data-centric clinical and analytic applications. These applications leverage cloud computing, big data, mobile, data science, data warehousing, machine learning using state of the art software development applications and frameworks. Our Software Engineers ensures that these cloud-based micro-services adhere to uptime and accuracy targets, are resilient, and scale as data volumes and traffic increase. They work closely with the data engineering, platform, and solutions teams to develop applications as required to benefit our practice and patients. Works closely with the Product Owners, Product Managers, Architects to translate requirements into code. Developing services around data warehousing, big data, cloud computing, business intelligence, analytics and machine learning. Participate in DevOps, Agile, continuous development and integration frameworks. Programming in high-level languages such as Go, Python, Java etc. Work on deployment automation/configuration management with tools including but not limited to ADO, Puppet, Chef or Ansible or Azure Pipelines, CloudFormation, Terraform following a DevOps model. Ensure all appropriate documentation of processes and source code is created and maintained. Communicate effectively with peers, leaders, and customers throughout the organization. Participate in expert level troubleshooting and resolve problems through root cause analysis, data and system investigation. Continues to build knowledge of the organization, processes and customers. Performs a range of mainly straightforward assignments. Uses prescribed guidelines or policies to analyze and resolve problems. Receives a moderate level of guidance and direction.  Mayo Clinic will not sponsor or transfer visas for this position. Bachelor’s Degree in Computer Science/Engineering or related field. Preferred qualifications for this position include: Site description  Mayo Clinic is located in the heart of downtown Rochester, Minnesota, a vibrant, friendly city that provides a highly livable environment for more than 34,000 Mayo staff and students. The city is consistently ranked among the best places to live in the United States because of its affordable cost of living, healthy lifestyle, excellent school systems and exceptionally high quality of life.  Compensation Detail  Required education, experience, and tenure may be considered along with internal equity when job offers are extended. The salary range every 2 weeks is approx. $3,496.00-$4,894.40 based on a full-time position.  Equal opportunity employer  As an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T03:52:11.000Z"
  },
  "company": {
    "name": "Mayo Clinic",
    "link": "https://www.linkedin.com/company/mayo-clinic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 81300,
    "max_value": 120000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Rochester",
    "region": "MN",
    "postal_code": "55901",
    "street_address": null,
    "latitude": 44.019333,
    "longitude": -92.45887
  }
}