{
  "job": {
    "title": "(Remote) Senior PHP/React Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Senior Software Engineer $140k - $170k 100% Remote 8+ years development experience - Good experience with PHP and Javascript (React is desired)  We are a SaaS company that works with banking, healthcare, real estate and other industries to help execute sales more quickly and efficiently. Our platform integrates will all email and CRM applications to help provide real time analytics and track ROI on investments.  We need an experienced Software Developer to create innovative and efficient software solutions and have a focus on full stack development using PHP and Javascript/React.  Top Reasons to Work with Us What You Will Be Doing What You Need for this Position So, if you are a (Remote) Senior PHP/React Engineer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Danny.Herries@Optello.com Danny Herries - Lead Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-31T07:11:07.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redwood City",
    "region": "CA",
    "postal_code": "94064",
    "street_address": null,
    "latitude": 37.4805,
    "longitude": -122.21528
  }
}