{
  "job": {
    "title": "Sr. Data Scientist, Battery Systems.",
    "industry": "Information Technology and Services,Computer Software,Automotive",
    "description": "Leading the future of luxury mobility  Lucid’s mission is to inspire the adoption of sustainable energy by creating the most captivating luxury electric vehicles, centered around the human experience. Working at Lucid Motors means having a shared vision to power the future in revolutionary ways. Be part of a once-in-a-lifetime opportunity to transform the automotive industry.  The Data Scientist at Lucid is setting data science foundation for our fast growing data team, to enable the company tackling challenges which are haven’t seen before. Data generated by electric vehicles is rich and diverse and driving insight from them is a very exciting and challenging task. This opportunity involves defining the path to discover trends, patterns and hidden insights from these data while collaborating with the most brilliant talents in the automotive industry. Be part of something amazing  Come work alongside some of the most accomplished minds in the industry. Beyond providing competitive salaries, we’re providing a community for innovators who want to make an immediate and significant impact. If you are driven to create a better, more sustainable future, then this is the right place for you.  At Lucid, we don’t just welcome diversity - we celebrate it! Lucid Motors is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, national or ethnic origin, age, religion, disability, sexual orientation, gender, gender identity and expression, marital status, and any other characteristic protected under applicable State or Federal laws and regulations.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:15:53.000Z"
  },
  "company": {
    "name": "Lucid Motors",
    "link": "https://www.linkedin.com/company/lucidmotors"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Newark",
    "region": "CA",
    "postal_code": "94560",
    "street_address": null,
    "latitude": 37.540813,
    "longitude": -122.033394
  }
}