{
  "job": {
    "title": "Machine Learning Research Scientist/Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "ECS is seeking a to work in our office. The successful candidate will provide scientific, engineering, and technical assistance (SETA) support to the Defense Advanced Research Projects Agency (DARPA). Fields of expertise include, but are not limited to, artificial intelligence, neural networks and machine learning. The candidate will support a DARPA Program Manager in all technical aspects of program development and execution, including: planning; solicitation preparation; proposal/publication evaluation; independent review, analysis, and summary of relevant research; interaction with individuals from academia, industry and government; preparation and presentation of briefing materials, technical reports, and other program documents as required; and other tasks as needed. The candidate will identify, assess, prioritize, and offer recommendations on proposed and emerging technologies to program manager and performers. This position does not entail direct experimental research.  Individuals will be expected to work on a multi-disciplinary team environment and work independently. Individuals must demonstrate exceptional professionalism, organizational skills, and the ability to multi–task effectively.  The position requires interaction with government customers at all levels of authority and technical acuity, and therefore the individual must be able to effectively communicate technical information through excellent verbal and written skills. Due to the fast-paced environment, individuals must have a dedicated work ethic, be responsive to challenges that arise on the job, be flexible to schedule changes, show initiative and creativity, and be capable of developing new research concepts. ECS is a leading mid-sized provider of technology services to the United States Federal Government. We are focused on people, values and purpose. Every day, our 3000+ employees focus on providing their technical talent to support the Federal Agencies and Departments of the US Government to serve, protect and defend the American People.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-16T11:56:17.000Z"
  },
  "company": {
    "name": "ClearedJobs.Net",
    "link": "https://www.linkedin.com/company/clearedjobs-net"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}