{
  "job": {
    "title": "Senior Software QA Engineer - UI &amp; API Automation Testing",
    "industry": "Computer Software",
    "description": "Senior Software QA Engineer - UI & API Automation Testing Remote or San Diego or Portland or Phoenix or Remote $120k-$165k/yr + Bonus + Benefits Automation testing, UI Testing, API Testing, Selenium Web driver, Rest Assured, Karate, Java, Python, C#  Based in the San Diego area, we are a global leader in cloud treasury and finance solutions. We provide award-winning solutions for cash and risk-management, payment, and supply chain finance. Due to growth we are seeking a Senior Software QA Engineer with UI or API automation testing experience. The ideal candidate will have experience with UI and/or API automation testing, experience coding with Java or Python, and experience with Selenium Webdriver. Experience with Karate, REST assured, AWS, and Docker is a huge plus but not a must have skill.  If this sounds like you, please apply now or send your resume to gino.tunzi@cybercoders.com, we are actively interviewing this week and next!!  What You Will Be Doing  You will be responsible for designing and executing tests, writing automated tests for new features, and troubleshoot automation test failures.  What You Need for this Position What's In It for You So, if you are a Senior Software QA Engineer with UI or API automation testing experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Gino.Tunzi@CyberCoders.com Gino Tunzi - Recruiter - CyberCoders All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:29:22.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Diego",
    "region": "CA",
    "postal_code": "92161",
    "street_address": null,
    "latitude": 32.71576,
    "longitude": -117.16382
  }
}