{
  "job": {
    "title": "Software Engineer",
    "industry": "Marketing and Advertising,Computer Software,Financial Services",
    "description": "Remote friendly position! We’re a marketing software company that serves small business owners, primarily financial advisors and insurance agents. About 25,000 small businesses use our tools and send out our content. Generally, these businesses don’t have marketing departments but are growth-minded enough to know they need to market themselves. Our software helps them do just that. We automate email and social campaigns to drive traffic back to their websites, helping them build better relationships with their customers with less hands-on effort.  We are focused on culture and investing in opportunities where our teams are able to grow professionally and inspire one another. We are very results-oriented with a bias to action. We value humility and a team-first, company-first approach and are willing to laugh at ourselves. We believe in a healthy work-life balance. We believe work should be both fun and challenging. We believe team members are most productive at work when they are successful in their personal lives, and vice versa. We embrace an open, transparent, trust-based work environment with a remote-first culture. Many of our team members enjoy the privilege of working from home on a regular basis. “I love working here! It’s way better than other places I’ve worked!” : Fonzi, QA Automation Engineer Our ideal candidate is a critical thinker, results-oriented, able to learn quickly, and be awesome to work with. You must be an excellent team player and be able to contribute to our culture of iterative development, team collaboration and our fun, positive, professional work environment. You are ready to take the next step in your career. You can find out what it’s like to work at FMG Suite by visiting  Powered by JazzHR  DKPeQ7D36e",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:00:05.000Z"
  },
  "company": {
    "name": "FMG Suite",
    "link": "https://www.linkedin.com/company/fmg-suite"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 62600,
    "max_value": 112000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Minneapolis",
    "region": "MN",
    "postal_code": "55440",
    "street_address": null,
    "latitude": 44.977486,
    "longitude": -93.264366
  }
}