{
  "job": {
    "title": "Software Engineer",
    "industry": "Consumer Goods,Food Production,Food &amp; Beverages",
    "description": "The Coca-Cola Company’s IT organization is in the midst of a digital transformation that allows our employees to use world class technology to connect our products to our customers all over the world. This journey is a very exciting time for Coca-Cola and our employees are big contributors to our Success and Growth. Our large scale and complex environment offers an incredible opportunity to address challenges, enable innovative solutions to make a difference for our customers, leveraging technologies such as Adobe, AWS, Azure, Magento, Salesforce and many more.  To continue this digitalization, we are looking for a Software Engineer to join our dynamic team help build scalable, cutting edge solutions for today and tomorrow. This position is part of a global network within Coca-Cola that creates and improves software applications helping The Coca-Cola Company grow and be more productive. If you are up for challenges, eager to learn and highly motivated, we’d love to speak with you and learn more about the solution you built and contributed. We are taking deliberate action to nurture an inclusive culture that is grounded in our company purpose, to refresh the world and make a difference. We act with a growth mindset, take an expansive approach to what’s possible and believe in continuous learning to improve our business and ourselves. We focus on four key behaviors - curious, empowered, inclusive and agile - and value how we work as much as what we achieve. We believe that our culture is one of the reasons our company continues to thrive after 130+ years. Visit Our Purpose and Vision to learn more about these behaviors and how you can bring them to life in your next role at Coca-Cola.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class. When we collect your personal information as part of a job application or offer of employment, we do so in accordance with industry standards and best practices and in compliance with applicable privacy laws.  R-60722",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T08:10:09.000Z"
  },
  "company": {
    "name": "The Coca-Cola Company",
    "link": "https://www.linkedin.com/company/the-coca-cola-company"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 57800,
    "max_value": 74200,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Atlanta",
    "region": "GA",
    "postal_code": "30355",
    "street_address": null,
    "latitude": 33.748547,
    "longitude": -84.3915
  }
}