{
  "job": {
    "title": "Remote AWS Cloud Security Engineer - AWS, Palo Alto, Okta, ISO",
    "industry": "Entertainment",
    "description": "If you are a AWS Cloud Security Engineer with experience, please read on!  We are creating a new form of live entertainment - part social gaming, part sports betting, part mind-blowing experience - all combined for debut in select cities around the world. We are seeking an experienced Cloud Security Engineer to join our team to build a mass multiplayer online games in mobile and web platforms. This position will focus on finding security weaknesses and crafting scalable and usable solutions. It will build security architecture, consult with other technology team members as they build and launch new products, proactively plan for the various security issues, and responds to incidents that occur.  The Cloud Security Engineer will review security strategy to monitor and analyze our cloud infrastructure.  What You Will Be Doing What You Need for this Position Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Nick.Valenti@CyberCoders.com Nick Valenti - Executive Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:32:39.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Carlsbad",
    "region": "CA",
    "postal_code": "92010",
    "street_address": null,
    "latitude": 33.16604,
    "longitude": -117.33793
  }
}