{
  "job": {
    "title": "VMWare Systems Engineer",
    "industry": "Computer Software,Information Technology and Services,Computer Networking",
    "description": "Responsible for supporting the VMware initiatives, automation, operational support of infrastructure components and supporting technologies.  Reviews market trends and collaborate with vendors and other technology teams to develop infrastructure solutions.  Provide VMware infrastructure design and support, with a specific focus on VMware Infrastructure as a Service.  Position provides high level competency in the form of standards, design and solution architecture for VMware‐based services. 5+ years relevant experience providing infrastructure solutions and support, with a focus on VMware based cloud technologies such as VMware ESXi, VMware Site Recovery Manager, vRealize Automation, VMware NSX, vSphere vCenter and vROPs.  Experience with adjacent technologies such as virtualization, networking, automation.  Experience with major enterprise hardware platforms, i.e. Nutanix Comfortable adapting to dynamic, rapid and shifting environments  Experience creating innovative and unique solutions for automation using scripting languages and simplifying administration for others  Demonstrated ability to teach new skills and concepts to junior members of the team  Strong communication skills and self‐starter attitude with a strong ability to exercise independent judgment and critical thinking with minimal supervision  Strong understanding of Enterprise Best Practices  Analytical and research skills and problem solving  Education  Bachelor’s degree preferred  If interested please forward your resume to kevin@libertyjobs.com  #associate  #mid  #IT  #vmware  Code: libertynull",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:38:00.000Z"
  },
  "company": {
    "name": "Liberty Personnel Services, Inc.",
    "link": "https://www.linkedin.com/company/liberty-personnel-services-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Wilmington",
    "region": "DE",
    "postal_code": "19806",
    "street_address": null,
    "latitude": 39.74443,
    "longitude": -75.5451
  }
}