{
  "job": {
    "title": "Site Reliability Engineer - Remote (US)",
    "industry": "Marketing and Advertising,Information Technology and Services,Staffing and Recruiting",
    "description": "PandoLogic delivers Hire Intelligence to Talent Acquisition organizations by sourcing quality applicants faster and more efficiently through the use of big data, artificial intelligence, and proprietary campaign algorithms that fully-automate and optimize the job advertising and decision-making process.  We are backed by premier early-stage venture capital companies and list a number of Fortune 500 enterprise clients.  When you join us, you'll become an important PandoPal of a well-established, global company. Professionally, you'll help us disrupt the recruitment advertising market and work on the most advanced technologies with experienced team members and from day one you'll be challenged to take risks while getting mentorship and support from the team.  What else? Competitive compensation, the flexibility to work from anywhere, a family-friendly culture, happy hours, social outings, hackathons, and more…  To learn more visit http://www.pandologic.com. Excited about using bleeding edge technologies to help make the hiring process better and more equitable for millions of people.  You'll be working on a small team at a rocketship-growth tech company that's focused on building out the conversational AI product in PandoLogic's offering. Your work will streamline the hiring process for millions of job seekers, reduce bias in hiring, and help companies solve some of the most ambitious challenges in the world. PandoLogic is committed to providing equal opportunity employment to all individuals regardless of race, color, religion, gender identity, sexual orientation, citizenship, national origin, disability, veteran status, or any other characteristic protected by law. We are flexible. We are kind. We are PandoLogic.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-27T05:19:54.000Z"
  },
  "company": {
    "name": "PandoLogic",
    "link": "https://www.linkedin.com/company/pandologic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}