{
  "job": {
    "title": "Software Engineer",
    "industry": "Logistics and Supply Chain",
    "description": "Nimble is a Series A startup founded from the AI labs at Stanford and Carnegie Mellon. We’re pioneering the way robots learn to grasp and manipulate any object. Our ultimate goal is to create the dark warehouse, a fully automated eCommerce fulfillment center with swarms of intelligent, cloud-connected robots to enable affordable same-day fulfillment for every retailer, large and small. In the process we aim to create one of the world’s most valuable robotics companies. We’re backed by the world’s most prestigious investors as well as AI and robotics legends like Fei-Fei Li (Chief Scientist of AI at Google, Director of Stanford’s AI lab) and Sebastian Thrun (founder of Google X, Waymo, Kitty Hawk, and Udacity)! Help us advance our robotics moonshot by designing, building, and supporting features that empower machine learning algorithms and robotic systems. You’ll create foundational, scalable systems that extend horizontally throughout the stack. You will design and architect solutions to complex software engineering challenges, take ownership of projects, and push deployments to production. You will play a critical role in working with our world-class cross-functional team to architect and build the world’s most advanced robotic systems for the world’s biggest robotics opportunity! Comprehensive medical, dental, and vision insurance. Paid holidays, generous PTO, competitive wages and meaningful equity of Nimble. We embrace challenges and strive to make the impossible possible each day. We’re not in this to do what’s easy or to be mediocre. We want to create something legendary and leave our mark on the world. We’re ambitious, we’re gritty, we’re humble and we’re relentlessly resourceful in pursuit of our goals. If this sounds like you then you might be a great fit! https://www.businesswire.com/news/home/20210311005117/en/Nimble-%C2%AE-Robotics-Raises-[…]llion-to-Build-the-Future-of-On-Demand-Robotic-Fulfillment https://techcrunch.com/2021/03/11/nimble-robotics-scores-50m-for-its-fulfillment-automation-tech/ https://multichannelmerchant.com/operations/nimble-robotics-takes-in-50m-adds-ai-luminaries/ We are an equal opportunity employer and value diversity at our company. We prohibit any form of workplace discrimination based on race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-16T18:12:48.000Z"
  },
  "company": {
    "name": "Nimble Robotics",
    "link": "https://www.linkedin.com/company/nimble-robotics"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}