{
  "job": {
    "title": "Data Scientist (Statistician)",
    "industry": "Information Technology and Services,Retail,Financial Services",
    "description": "Position Summary... What you'll do...  At Walmart we continuously strive to provide an amazing customer experience with everyday low prices. We do this by constantly experimenting with new features on our website/app, new machine learning models and testing new ideas. Our team owns the Experimentation Platform which provides flexible solutions for designing, launching, and analyzing online experiments, and archiving results. Our platform is widely used by Walmart product managers, data scientists and developers, to experiment new features and new ideas, that makes our customer’s life easier by providing a great experience while shopping at Walmart.  Our team has a combined experience of big data engineering, large scale distributed micro-services and data scientists, so it’s a great environment to learn and grow in various engineering areas. Online experimentation is one of the hottest areas of research and development and is the most critical component required for any tech company to make data driven business decision. This is a chance for you to learn how it works in Walmart and be a pioneer in this field. Minimum Qualifications... Option 1: Bachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 2  years' experience in an analytics or related field. Option 2: Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science,  Information Technology or related field. Option 3: 4 years' experience in an analytics or related field. Preferred Qualifications... Data science, machine learning, optimization models, Master’s degree in Machine Learning, Computer Science, Information Technology, Operations Research, Statistics, Applied Mathematics, Econometrics, Successful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, tensorflow, torch) Primary Location...5600 AVENIDA ENCINAS, CARLSBAD, CA 92008, United States of America",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-30T03:03:22.000Z"
  },
  "company": {
    "name": "Walmart",
    "link": "https://www.linkedin.com/company/walmart"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 77500,
    "max_value": 151000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Carlsbad",
    "region": "CA",
    "postal_code": "92010",
    "street_address": null,
    "latitude": 33.16604,
    "longitude": -117.33793
  }
}