{
  "job": {
    "title": "Senior Test Engineer, Nike Footwear Innovation Manufacturing",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "The Senior Test Engineer for NXT Engineering and Manufacturing-- is responsible for providing technical details to define, develop and implement procedures for testing new sustainable materials and developing technologies. In addition, they work closely with various functions within NXT to provide technical mentorship on existing test methods and analyze the materials & mechanical test results.  The candidate needs to have the ability to thrive in an environment of ambiguity, have strong attention to detail and strong problem-solving skills. The ideal candidate will also need to have experience in sophisticated analytical tools and expertise in chemicals, materials, product testing, and research & development. You will perform materials & mechanical testing using existing test methods, as well as developing customized testing specifications. You will ensure testing procedures align with internal and external standards. You will have the opportunity to evaluate and select test equipment to purchase or be able to design new test equipment as appropriate. You will conduct testing and mentor other test engineers on test protocols and documentation. You will lead and collaborate with teams locally and globally to address test method development and testing process improvement projects As a Senior Test Engineer for Engineering & Manufacturing team, you’ll be working with the Engineering & Manufacturing leadership team. You’ll work with a team of other highly skilled Engineers across this team, as well as the Materials and Mechanical Lab.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:05:53.000Z"
  },
  "company": {
    "name": "Nike",
    "link": "https://www.linkedin.com/company/nike"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Beaverton",
    "region": "OR",
    "postal_code": "97007",
    "street_address": null,
    "latitude": 45.486595,
    "longitude": -122.795616
  }
}