{
  "job": {
    "title": "Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "The Role  Fixed Income Technology is looking for a full stack developer to join the Fixed Income Investment Tools Development Team in our Merrimack office. As a member of our team, you will be co-located with our investment team and interact directly with portfolio managers, quant analysts, traders and investment operations teams to create new and innovative tools that will support and enhance our investment process. These tools are critically important to the work of the investment team in managing risk, adding return and operating our business. You will be embedded with the investment team as a key technology partner supporting the investment process.  The Expertise and Skills You Bring The Team  Due to the breadth and complexity of the various securities held in Fixed Income funds, our technology must keep pace with changes in investment markets, strategies, and regulations. The Investor Tools Development (ITD) team works directly with investment professionals using a variety of technologies and digital tools to build solutions supporting and enabling the investment process. Asset Management Technology (AMT) provides worldwide technology and support to all the Investment Management, Research, Trading and Investment Operations functions. AMT is an integral partner for Asset Management to deliver innovative, scalable, industry-leading investment tools that enable Asset Management to achieve competitive advantage globally $50,000 - $85,000  This position is eligible for incentive compensation or an annual bonus opportunity. Company Overview  At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: . We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.  Join Us  At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities.  We invite you to at fidelitycareers.com.  Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.  Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-03T07:35:44.000Z"
  },
  "company": {
    "name": "Fidelity Investments",
    "link": "https://www.linkedin.com/company/fidelity-investments"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Salt Lake City",
    "region": "UT",
    "postal_code": "84101",
    "street_address": null,
    "latitude": 40.758476,
    "longitude": -111.888145
  }
}