{
  "job": {
    "title": "Lead Software Engineer, Enterprise Data Services - Business Technology",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology Business Technology blazes the trail of enterprise IT. Built on the foundation of our core values - Trust, Ohana, Innovation - we own more than the traditional IT components with a heavy focus on working closely with our business partners for amazing outcomes. Our goal is to deliver technology that is centered around our business and our collective success. We oversee technology strategy, Salesforce on Salesforce, customer and partner enablement, applications engineering, infrastructure, collaboration, enterprise operations, architecture, and program enablement. We own the world’s foremost Salesforce implementation and enable our global Ohana to do their best work by leveraging our platform.  Have you mastered the balance between creativity and technology? Are you looking to join a technical team trusted to deliver mission critical business services that help scale the organization and create unprecedented business value? Do you want to be part of a business that’s improving the state of the world and creating equality for all?  We are looking for an enthusiastic Lead Engineer to join our Enterprise Data Services (EDS) team and own application design and development for a complex portfolio of data initiatives. The person in this role will work on designing, developing and implementing capabilities to support various data management initiatives and would collaborate and partner with both our Northern America & Hyderabad based architects and agile development teams. If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. and are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. and do not accept unsolicited headhunter and agency resumes. and will not pay any third-party agency or company that does not have a signed agreement with or Salesforce.org.  Salesforce welcomes all.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:23:50.000Z"
  },
  "company": {
    "name": "Salesforce",
    "link": "https://www.linkedin.com/company/salesforce"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}