{
  "job": {
    "title": "Software Engineer I",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "10415 Morado Circle, Austin, TX, USA Cox Automotive Individual Contributor No Full-time Day Job 216906 At Cox Automotive, we offer the chance to take an important role in the digital revolution of the automotive industry. Our software engineers are part of an energetic team that build world-class solutions to benefit the auto buying public, dealers and manufacturers. At Cox Automotive, youll be immersed in an environment that values your teamwork and creative problem-solving techniques while encouraging you to continue to learn new skills and technologies.  Risk-taking is encouraged here and we reward great results. Collaboration and support are woven into the fabric of everything we do; from 24-hour Hackathons and brain-storming sessions to sprint reviews, youll be immersed in an environment that encourages bringing fresh ideas to the table with an innovative mindset.  Giving back to the community is important at Cox Automotive. You will be given time during working hours to volunteer at local charities. Our Software Engineers are energetic influencers who thrive on designing simple and scalable solutions to complex problems and delivering leading edge software products for our customers. We are looking for exceptionally ambitious and communicative hands-on individuals who have the passion and skills to take our product offerings to the next level.  As a Software Engineer you will work in a collaborative team environment that encourages you to perform at your best, while contributing to the engineering efforts of one of our scrum teams. You will be challenged to engineer right-sized solutions for complex business problems. You will apply your knowledge of modern software design, best practices, design patterns, and frameworks, with an understanding of application performance and maintainability. You will aspire to use new technologies and challenge yourself to develop innovative solutions. You will work alongside developers and technical leads on a team where collaborative programming and mentoring is regularly practiced. Who We Are Theres nothing ordinary about Cox Automotive. We are people of every background driven by our passion for mobility, innovation, client success and community outreach. We make buying, selling and owning (or simply using) cars easier for everyone. Touching more than 40,000 clients across five continents, we bring together the best brands and the best teams to propel the automotive industry forward. Some of those team members work for our iconic consumer brands like Autotrader and Kelley Blue Book, while others are creating the future of automotive at industry-facing brands like Dealer.com, Manheim and vAuto. We are the Cox family of businesses. Weve been making our mark since 1898 by building and evolving world-class businesses, staying true to our values, and encouraging top talent to always look for growth and impact while building a career with us. Our primary divisions - Cox Communications and Cox Automotive - are driving a new wave of innovation, powering smart cities with powerhouse broadband communications and pioneering greener, more progressive transportation alternatives for individuals and fleet operators. Were also expanding into new spaces like cleantech and healthcare to rev up our momentum toward building a better future for the next generation. Were looking for the talent today who will be our leaders tomorrow. Sound intriguing? Learn more about where we are today, where we hope youll be going with us, and the common purpose that unites us at coxenterprises.com.  Benefits of working at Cox may include health care insurance (medical, dental, vision), retirement planning (401(k)), and paid days off (sick leave, parental leave, flexible vacation/wellness days, and/or PTO). For more details on what benefits you may be offered, visit our benefits page.  Cox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law. Cox provides reasonable accommodations when requested by a qualified applicant or employee with disability, unless such accommodations would cause an undue hardship.  Statement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T00:06:27.000Z"
  },
  "company": {
    "name": "Cox Automotive Inc.",
    "link": "https://www.linkedin.com/company/cox-automotive-inc-"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 18,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}