{
  "job": {
    "title": "Software Engineer, Performance",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "The Core Performance team builds the tools, frameworks, and infrastructure to enable a more performant Asana without sacrificing velocity. The team both directly contributes to, and empowers other Asana engineers in, a common mission to make everything we build as fast and efficient as possible. We leverage cutting-edge web performance technologies and methodologies and shape them to work within Asana’s unique infrastructure.  We’re looking for an experienced engineer to join us in making Asana as fast as possible. You’ll be able to directly contribute to high impact performance projects, such as improving Asana pageload times, as well as define and execute on a vision for what performance engineering looks like going forward through projects like code-splitting our Javascript bundle to reduce payload. As a team, our focus is balanced between having direct high-leverage impact via contributing to performance projects directly as well as building out the supporting frameworks to enable other engineers at the company to write performant features. At Asana, we're building a better way to work, fueled by transparency, inclusion, and technology that is a force for positive change. Asana is a work management platform that helps teams orchestrate their work, from daily tasks to strategic initiatives, so they can move faster and accomplish more with less. For the past 5 years, we've been named a top workplace, including top 10 Best Small & Medium Workplaces, #1 Fortune Best Workplace in the Bay Area for four years in a row, #8 Fortune Best Workplaces for Women, #14 , and one of . After spending more than a year physically distanced, we are safely and mindfully returning our global teams to in-person collaboration, incorporating flexibility that adds hybrid elements to our . With offices all over the world, we are always looking for curious, collaborative, and mission-driven people to help us enable the world’s teams to work together effortlessly.  We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that Asana upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T21:26:44.000Z"
  },
  "company": {
    "name": "Asana",
    "link": "https://www.linkedin.com/company/asana"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 115000,
    "max_value": 179000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}