{
  "job": {
    "title": "AI Chatbot Trainer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "NLU Grammar or AI / Chatbot Trainer 12 month contract Remote M-F 40 hr work week 1 Do you have experience working with data? Does conversational interfaces or voice experiences excite you? Are you interested in growing conversational experiences at a Fortune 100? We are looking for an AI Trainer or Data Scientist to join the conversational platform team. Our ideal candidate is a strong in understanding grammar and data related to conversational interfaces. This is an exciting opportunity on a new and growing team. EEO Employer  Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:18:00.000Z"
  },
  "company": {
    "name": "Apex Systems",
    "link": "https://www.linkedin.com/company/apex-systems"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Antonio",
    "region": "TX",
    "postal_code": "78266",
    "street_address": null,
    "latitude": 29.42517,
    "longitude": -98.49461
  }
}