{
  "job": {
    "title": "DE LAPP/SAR Underwriter",
    "industry": "Retail",
    "description": "If you are a Mortgage Underwriter with experience, please read on!  We are a 10 plus year company affiliated with a local builder, looking to start up our underwriting department. Do to our continuous growth and demand for our services, we decided to keep our loans in house. If you are a self starter and looking for a challenge to help establish and grow our underwriting department, then manage this department as we grow. Please apply now!  What You Will Be Doing  You will be underwriting mainly new construction builds and purchase mortgages. We are looking for a self motivated individual that wants to start our underwriting department and give us ideas on how to make our underwriting department successful. You will need to be well versed in FHA, VA, and conventional mortgages to help us grow and then manage the underwriting department down the road.  What You Need for this Position What's In It for You So, if you are a DE LAPP/SAR Underwriter with experience, please apply today!  Or email me at thomas.stampley@cybercoders.com Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Thomas.Stampley@CyberCoders.com Thomas Stampley - Recruiter - CyberCoders  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:27:41.000Z"
  },
  "company": {
    "name": "CyberCoders",
    "link": "https://www.linkedin.com/company/cybercoders"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Jupiter",
    "region": "FL",
    "postal_code": "33458",
    "street_address": null,
    "latitude": 26.934145,
    "longitude": -80.09974
  }
}