{
  "job": {
    "title": "Graphics Software Engineer",
    "industry": "Consumer Electronics",
    "description": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.    The Graphics Software Engineer will be responsible for software tasks required for the development and verification of a GPU design. We would like you to have 3+ years with the following skills and experience:  Deep expertise and knowledge of graphics rendering algorithms  Experience with GPU APIs, preferably Metal, OpenGL, and / or OpenCL  Excellent C/C++ programming skills  Architectural validation and design verification knowledge a plus  Hardware architecture experience a plus  Experience with graphics device driver capture a plus  Experience with scripting, continuous integration systems, automated build and regression systems, web-based programming, database systems  Strong ability to collaborate with engineering teams under high pressure schedules As a Graphics Software Engineer, you will engage in the following activities:   Define, write, and debug GPU architectural, functional, and performance test suites  We would like you to lead the design and implementation of GPU verification tools and APIs  Create production quality automated flows for graphics core verification  Develop C/C++ functional and performance models for hardware verification  Support GPU hardware teams during model and design bring-up pre / post silicon  Support GPU software teams during driver bring-up BS/MS/PhD CE, EE, CS, or related field    Role Number: 200005890",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:37:41.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Orlando",
    "region": "FL",
    "postal_code": "32889",
    "street_address": null,
    "latitude": 28.53833,
    "longitude": -81.378876
  }
}