{
  "job": {
    "title": "Enterprise Account Executive - Financial Services (Midwest)",
    "industry": "Information Technology and Services,Internet,Telecommunications",
    "description": "Twilio is looking for a Financial Services Enterprise Account Executive to sell into high value Financial Services prospects and customers. The candidate will be responsible for sourcing new opportunities within Financial Services including Global 2000 Banks, Insurance and Wealth management companies. Responsibilities will span from driving the sales process from internal leads to qualifying new prospects and managing deals to closure. The Financial Services team is a strategic component to our go-to-market strategy. Twilio is a company that is empowering the world’s developers with modern communication in order to build better applications. The Global Sales team plays an integral role in building out our customer base and bringing Twilio to developers, non-profits and enterprise to make an impact on their services.  Twilio is truly unique; we are a company committed to your growth, your learning, your development and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion and innovation and we want you and your ideas to thrive at Twilio. Come join us. We employ diverse talent from all over the world and we believe great work can be done anywhere. Around the world, Twilio offers benefits and perks to support the physical, financial, and emotional well being of you and your loved ones. No matter where you are based, you will experience a company that believes in small teams for maximum impact; seeks well-rounded talent to ensure a full perspective on our customers’ experience, understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture that empowers everyone to do their best work and be the best version of themselves. We seek people who naturally demonstrate our values , who are challenged by problems, empower others to thrive, people who can draw the owl and not be beholden to one playbook. Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers.  In accordance with applicable law, the following represents Twilio's reasonable estimate of the range of possible compensation for this role if hired in Colorado. $126,000 - $157,500 $126,000 - $157,500 Additionally, this role is eligible to earn commissions and eligible to participate in Twilio's equity plan.  An overview of Twilio’s benefits offered is listed below: At the time of this posting, this role is eligible to participate in the following benefits, which Twilio reserves the right to modify at any time for any reason in accordance with applicable law  Twilio is committed to delivering a comprehensive benefits program that provides support needed for you and your loved ones. It’s likely that you don’t think about benefits every day; however, they are an important component of your total compensation, and we want you to understand the options available to you so that you can make the most of your benefit dollars.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:24:42.000Z"
  },
  "company": {
    "name": "Twilio",
    "link": "https://www.linkedin.com/company/twilio-inc-"
  },
  "education": {
    "required_credential": "associate degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}