{
  "job": {
    "title": "Software Engineer III (Backend)",
    "industry": "Computer Software,Human Resources,Information Technology and Services",
    "description": "At Workday, we help the world’s largest organizations adapt to what’s next by bringing finance, HR, and planning into a single enterprise cloud. We work hard, and we’re serious about what we do. But we like to have fun, too. We put people first, celebrate diversity, drive innovation, and do good in the communities where we live and work. The Reporting application is central to empowering users of Workday Planning to visualize finance, sales and other planning data through powerful, self-service and ad-hoc reports. We leverage our powerful compute engine to provide best-in-class reporting that scales against very large data sets and complex planning models. We are open for a Software Engineer II or and Software Engineer III.   You are a team-player, but also a leader and go-getter and motivated to excel. You care deeply for inclusivity, belonging and equity in relationships with workmates.     Along side these attributes, if you are excited to join to a growing and talented bunch of fun folks in building a best-in-class reporting SaaS platform, you are looking in the right place! Workday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:56:47.000Z"
  },
  "company": {
    "name": "Workday",
    "link": "https://www.linkedin.com/company/workday"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Pleasanton",
    "region": "CA",
    "postal_code": "94588",
    "street_address": null,
    "latitude": 37.658436,
    "longitude": -121.877
  }
}