{
  "job": {
    "title": "Software Engineer",
    "industry": "Computer Software,Internet,Financial Services",
    "description": "Octane is a Fintech company whose mission is to connect people with their passions. The transaction process for large purchases such as powersports, RVs, boats, and home improvements is slow and frustrating, but Octane is changing that through automated underwriting, innovative credit products, and financing through our in-house lender Roadrunner Financial. Octane reaches millions of enthusiasts through editorial brands like Cycle World and Cycle Volta and helps consumers buy their favorite products with instant, frictionless financing on Octane.co. Octane is revolutionizing lending in under-served verticals that account for tens of billions of dollars in annual transactions.  Octane is gaining traction quickly with customers, as evidenced by growth in originations through our platform of more than $1B since inception. Octane works with more than 3,500 merchants in the USA and offers promotional financing with low rates for more than 40 OEM brands. Because we're the platform and the lender, we have both high growth and positive unit economics - rare for a fintech. We have raised more than $192M in capital from leading investors, including Valar Ventures, IA Ventures, Contour Venture Partners, Third Prime, Progressive Insurance and Citi Ventures and our lending securities are rated AA by Standard & Poor's.  We are hiring a Software Engineer to build features and infrastructure for our consumer lending marketplace. Used by dealerships across the country, this product provides a streamlined workflow for dealerships to get fast, flexible financing to their customers. Working with a team of passionate, experienced engineers, you'll work throughout our stack with technologies such as Python, Django, PostgreSQL, Javascript, React, and Node.js. This role is based in our NYC office.  Responsibilities:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T05:14:44.000Z"
  },
  "company": {
    "name": "Octane",
    "link": "https://www.linkedin.com/company/octane-lending"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 82000,
    "max_value": 178800,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "New York",
    "region": "NY",
    "postal_code": "10132",
    "street_address": null,
    "latitude": 40.713047,
    "longitude": -74.00723
  }
}