{
  "job": {
    "title": "Cloud Platform Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "We are the worlds first SaaS experience platform for Communications Service Providers. If you are a Cloud Platform Software Engineer with experience, please read on!  Top Reasons to Work with Us What You Will Be Doing  As an engineer on the Cloud Platform team, you will be building and enhancing a set of backend services (written in Scala and Akka) that are responsible for the real-time control, monitoring, and optimization of OpenSync\" enabled devices. Daily work will involve close collaboration with other teams (Device, Data Engineering, API) to bring ideas to fruition. This is a unique ground floor opportunity for self-motivated individuals to work on a mission-critical, cutting edge software platform that serves millions of households worldwide.  What You Need for this Position BA/BS in Computer Science, Electrical Engineering or a related technical field with 2+ years of industry experience. Alternately, MS or PhD in Computer Science, Electrical Engineering or a related technical field  Well-versed in Scala or Java and eager to get up to speed with idiomatic Scala  Strong understanding of memory and performance characteristics of fundamental data structures  Strong understanding of OOP design principles Experience writing code for large scale distributed systems and supporting it in production  Experience with JVM garbage collection and tuning  So, if you are a Cloud Platform Software Engineer with experience, please apply today! Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:  Krista.Kornchuk@Optello.com Krista Kornchuk - Recruiter - Optello  Applicants must be authorized to work in the U.S. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:29:47.000Z"
  },
  "company": {
    "name": "Optello",
    "link": "https://www.linkedin.com/company/optello-us"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Palo Alto",
    "region": "CA",
    "postal_code": "94310",
    "street_address": null,
    "latitude": 37.445103,
    "longitude": -122.16036
  }
}