{
  "job": {
    "title": "Junior Data Scientist",
    "industry": "Accounting,Information Technology and Services,Management Consulting",
    "description": "Deloitte Consulting LLP is one of the world's leading management consulting firms for executable strategy, operations, technology, and human capital advisory services. We provide powerful business solutions to some of the world's most well-known and respected companies, including more than 75 percent of the Fortune 100. The machine learning group sits in the Deloitte Platform (DP) practice, part of Deloitte Consulting LLP, which supports the firm on a technical level to offer a variety of mixed services to provide the clients' needs. The machine learning team specifically focusses on creating products and solutions that require deeper analytical and problem-solving skills to create tangible results. This is a continuous cycle where we strive to keep innovating and provide state-of-the-art assets. As a junior data scientist, you will focus on supporting the machine learning group and actively participate in all the processes in a data science project. As a newcomer in the field, the initial focus will be on data cleaning, wrangling, and exploratory data analysis. Later, the focus extends to feature generation and selection, creating models, and boost their performance & accuracy as well as guiding more junior resources and act as a sounding board. It is important that the person in this role is proactive and independent. You should be a problem solver with an open mind and an eagerness to pick-up new skills ranging from deeper statistical analysis and better modeling skills to honing programming and communication skills. Competitive candidates for this role will possess the following: At Deloitte you can have a rewarding career on every level! As a dynamic and leading edge company, Deloitte offers a phenomenal opportunity for staff to join a high growth environment to expand, enhance and strengthen their client service and technology skills. In addition to challenging and meaningful work, you'll have the chance to give back to your community, make a positive impact on the environment, participate in a range of diversity and inclusion initiatives, and find the support, coaching, and training it takes to advance your career. To learn more about our culture, benefits and to submit your resume, visit us at www.deloitte.com/us/careers . Required: Preferred: *Must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future.*",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-22T18:09:15.000Z"
  },
  "company": {
    "name": "Deloitte",
    "link": "https://www.linkedin.com/company/deloitte"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Orlando",
    "region": "FL",
    "postal_code": "32889",
    "street_address": null,
    "latitude": 28.53833,
    "longitude": -81.378876
  }
}