{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "We are witnessing a massive shift of consumer presence from offline to online. With it, there is a need for technologies that enable online businesses to thrive. Bolt is at the center of this universe leading the next generation of ecommerce, having created a best-in-class buying experience from checkout to fraud detection, payments and more. With our help, retailers can successfully compete with the online retail giants that have the means to invest in technology.  The Data Platform team works closely with all teams and cross-functional partners (including product, engineering, and data analysts) to build a foundational data stack powering business analytics.  We are looking for someone to play a mission-critical role in designing and building the machine models (fraud detection, categorization, recommendation, personalization, price analysis, etc) that powers Bolt. This should someone with experience, creativity, and passion for producing world-class technology. Companies and consumers alike will rely heavily on what you build, and you’ll have a ton of trust and responsibility. If challenges excite you, and you’re ready for a large one, let us know.  Check out our Engineering Blog ! Bolt is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. If you have a disability or special need that requires accommodation, please let us know  Check out our Engineering Blog !",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T04:14:24.000Z"
  },
  "company": {
    "name": "Bolt",
    "link": "https://www.linkedin.com/company/bolt-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}