{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Computer Software,Information Technology and Services",
    "description": "We have an exciting opportunity for a Sr. Site Reliability Engineer to join a world-class team building the high performing infrastructure to support internal Research activities for our premier voice, natural language, and AI-power technologies.  You are a self-starter and will work on supporting DevSecOps excellence and Site Reliability through an automation pipeline-defined approach to operations, security and Azure infrastructure. You will build various tools, systems and infrastructure that enable pipeline driven testing, and infrastructure that enables cloud native monitoring, continuous integration, horizontal and vertical scalability. Education: Bachelor of computer science or equivalent qualification is required  Minimum years of work experience: 5 years experience building and operating Azure public cloud solutions #Remote  Nuance offers a compelling and rewarding work environment. We offer market competitive salaries, bonus, equity, benefits, meaningful growth and development opportunities and a casual yet technically challenging work environment. Join our dynamic, entrepreneurial team and become part of our continuing success.  Nuance celebrates diversity and is proud to be an equal employment opportunity and affirmative action workplace. We consider all qualified applicants without regard to race, color, religion, sex (including pregnancy), sexual orientation, gender identity or expression, national origin, military and veteran status, disability, genetics, or any other category protected by or Nuance policy. If you need an accommodation because of a disability for any part of the employment process, please call 781-565-5086 and let us know.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-18T00:11:32.000Z"
  },
  "company": {
    "name": "Nuance Communications",
    "link": "https://www.linkedin.com/company/nuance-communications"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 95500,
    "max_value": 184000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Burlington",
    "region": "MA",
    "postal_code": "01803",
    "street_address": null,
    "latitude": 42.504986,
    "longitude": -71.19583
  }
}