{
  "job": {
    "title": "Full Stack Software Engineer – Human Engineering",
    "industry": "Consumer Electronics",
    "description": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Imagine what you could do here. Bring passion and dedication to your job and there’s no telling what you could accomplish.   We are a team of software engineers developing web-based tools and applications for Apple teams. Our work empowers Apple engineers and researchers to build the products that inspire and delight millions every day. Dynamic, inspiring people and innovative technologies are the norm here.   We want you to join our team if you are a resourceful engineer with the desire to research and develop solutions that do not yet exist. Ideal candidates are comfortable breaking down problems and proposing multiple solutions. They strive for excellence but can balance progress and perfection. Working with us, you will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation. Strong fundamentals in object-oriented programming, data structures, and algorithms  Expertise architecting and developing full stack web applications with RESTful APIs  2+ years Python experience  Web development experience with HTML5, CSS/SASS, and JavaScript  Experience with front-end frameworks such as Angular (preferred), React, or Vue.  Experience with backend MVC frameworks such as Django (preferred), Rails, or Spring  Strong understanding of relational database design  Experience designing scalable software systems  Demonstrated UI/UX design abilities  Strong communication skills  Nice to have iOS development experience; Server Administration / DevOps; Extensive experience with UNIX shell; Experience with containers (Docker, Kubernetes) The Human Engineering Software team works closely with many teams around the company to build powerful multi-platform tools.  RESPONSIBILITIES INCLUDE:  -  Gathering project requirements and proposing solutions  -  Designing, building, and maintaining RESTful APIs  -  Architecting complex data storage (relational, non-relational, block, file)  -  Writing backend logic for data organization and processing  -  Building powerful and intuitive client apps (Web, iOS, and macOS)  -  Proactively proposing and implementing ideas  -  Full-stack ownership (communicating with key stakeholders, design, implementation, and deployment) BS/MS in Computer Science/Engineering, or equivalent    Role Number: 200241040",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:29:53.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}