{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "The Microsoft Search in Bing Team is looking for strong full-stack a Senior developer with a passion for building large scale web services and state of the art web applications. In this role, you will have the opportunity to work on complex problems, interface closely with the partner teams and contribute to the exciting product in Microsoft.  You will be part of a passionate and growing team who takes pride in their work, and cares about their colleagues. If you are someone who takes ownership of your projects and thrives in a dynamic environment, then let's chat! Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.  #webxt #bing #webdevelopement",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:03:56.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 150000,
    "max_value": 182000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}