{
  "job": {
    "title": "Software Engineer (NYC or US Remote)",
    "industry": "Computer Software,Financial Services,Real Estate",
    "description": "Roofstock is the leading marketplace for investing in single-family rental homes. Our mission is to make real estate investing radically accessible, cost effective and simple. We want to use technology to transform the way real estate is bought and sold and make real estate investing as simple as investing in stocks. Simply put, we are passionate about helping our customers build wealth through real estate.  Roofstock has been recognized as a Great Place to Work® and was recently named to the Forbes Fintech 50 and the Red Herring 100 lists of most innovative companies. Roofstock has raised over $135M to date, is based in Oakland, California and Dallas,Texas with approximately 180 people and is growing rapidly. Check out our reviews and see why our employees love working here!  We've built an amazing culture where everyone has a voice. We're nice. We get things done. We have fun. We believe in work-life balance (yes, you can really take a vacation). And our values are pretty B.A.D.A.S.S. e customer obsessed. ct like an owner, because you are one. on't be afraid to break things in the pursuit of better. ll of us are empowered to do the right thing. tay curious and create what's next. Fast. eriously. No jerks.  At Great Jones, we're out to build the leading full-service operating platform for lower-scale residential rental real estate: tens of millions of single-family homes and apartment buildings without on-site management, collectively worth trillions of dollars but underpenetrated by technology to date.  By combining technology and design with best-in-class operations & growth leadership, we will unlock the asset class from previous constraints posted by operational headaches.  Technology penetration is low here vs. other asset classes, which just means we have lots of greenfield technology to build!  As a Software Engineer here you will roll up your sleeves, work closely with our product & engineering teams, and help build the foundation of various software components. Because we are so greenfield and nothing quite like this has ever been built before, your team will be working with the latest and greatest technologies including AWS-managed services, serverless components, GraphQL, and NLP!  You'll help build things like a Mint/Robinhood style app so owners can see and manage their rental properties in real-time from wherever they are with the power of real-time data, smart home automation, and predictive analytics at their fingertips; an Uber-style interface so residents can request maintenance, rate their service experiences, pay their rent, or perform any other interaction or communication; and optimized systemized workflows for everything from leasing to leaky faucets to property optimization.  Your team’s work -- delivering software that delights our customers and their tenants, automates and instruments a traditionally low-tech industry, and enables controlled and elegant scaling of the business -- will be an absolutely crucial part of that journey. Competitive compensation  Medical, Vision and Dental for you (95%) and your dependents (65%)  401k  Flexible time off and sick days  Supplemental bonus to support \"work from home\" office needs  Equity incentives to give you a stake in the Company’s future  We are an upbeat and collaborative work culture  Virtual company-sponsored outings",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-05T17:39:40.000Z"
  },
  "company": {
    "name": "Roofstock",
    "link": "https://www.linkedin.com/company/roofstock"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}