{
  "job": {
    "title": "Senior Research Scientist I",
    "industry": "Biotechnology,Hospital &amp; Health Care,Medical Devices",
    "description": "The Sr. Research Scientist I, with input from senior scientists and leaders, works in collaboration with others on one or more projects which are complex in scope. The Sr. Research Scientist I participates in or leads planning of projects and experiments, and is often the technical lead responsible for the successful execution of the project. This position involves independently making detailed observations, analyzing data, interpreting results and providing insights into the next steps and direction of the project, as well as independently determining methods and procedures on new assignments or projects.  Working in a team setting, the Sr. Research Scientist I will be involved in Research and Development projects serving as a technical lead and/or a subject matter expert in exploring and researching new technologies, providing ideas and concepts to improve or develop processes, and/or establish methods and processes for product development towards development of diagnostic assay products. This position will also mentor and provide technical guidance to junior scientists in project teams.  The successful candidate will support the research and early development of NGS-based methods to improve clinical diagnostic test access, quality and performance for patients with cancer. Responsibilities of this position include design and optimization of innovative NGS-based solutions that integrate clinical product requirements with analytical and operational performance. This role will require deep understanding of NGS sample preparation and data analysis to collaboratively develop new workflows for the highly accurate detection of somatic mutations and methylation changes in clinical oncology samples. We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, creed, disability, gender identity, national origin, protected veteran status, race, religion, sex, sexual orientation, and any other status protected by applicable local, state or federal law. Applicable portions of the Company’s affirmative action program are available to any applicant or employee for inspection upon request.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T05:55:49.000Z"
  },
  "company": {
    "name": "Exact Sciences",
    "link": "https://www.linkedin.com/company/exact-sciences"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cambridge",
    "region": "MA",
    "postal_code": "02239",
    "street_address": null,
    "latitude": 42.36525,
    "longitude": -71.10502
  }
}