{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "Olive’s AI workforce is built to fix our broken healthcare system by addressing healthcare’s most burdensome issues -- delivering hospitals and health systems increased revenue, reduced costs, and increased capacity. People feel lost in the system today and healthcare employees are essentially working in the dark due to outdated technology that creates a lack of shared knowledge and siloed data. Olive is designed to drive connections, shining a new light on the broken healthcare processes that stand between providers and patient care. She uses AI to reveal life-changing insights that make healthcare more efficient, affordable and effective. Olive’s vision is to unleash a trillion dollars of hidden potential within healthcare by connecting its disconnected systems. Olive is improving healthcare operations today, so everyone can benefit from a healthier industry tomorrow.  This Data Scientist opening will be work within our newest strategic maneuver, Olive Shares. This product was created to connect providers, payers, and patients to the Internet of Healthcare. At Olive, we build solutions to solve real-world problems, and that’s why we’re starting by addressing a huge pain point shared by providers, payers, and patients alike: prior authorization. Olive Shares will leverage the amazing AI toolkit and solutions we’ve developed for prior authorization, and bring them together to form the beginning of Olive Shares. At Olive, we're committed to growing and empowering an inclusive community within our company and industry. This is why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives across our organization. Research shows that oftentimes women and other minority groups only apply to open roles if they meet 100% of the listed criteria. Olive encourages everyone — including women, people of color, individuals with disabilities and those in the LGBTQIA+ community — to apply for our available positions, even if they don't necessarily check every box on the job description. We take the health and happiness of our employees seriously and consistently evaluate new ways to provide an amazing place to work. From retirement planning, to a wellness program designed to actively incorporate mental and physical wellness into daily interactions amongst fellow Olivians, we make sure to take care of our own.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T08:45:04.000Z"
  },
  "company": {
    "name": "Olive",
    "link": "https://www.linkedin.com/company/oliveai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}