{
  "job": {
    "title": "Senior Software Engineer, Gameplay - Unpublished R&amp;D Product",
    "industry": "Computer Games,Computer Software,Internet",
    "description": "Riot engineers bring deep knowledge of specific technical areas but also value the opportunity to work in a variety of broader domains. As a Software Engineer II, you’ll also dive into projects that focus on team cohesiveness and cross-team objectives. You’ll lead without authority and provide other engineers with a clear illustration of extraordinary engineering.  As a Senior Software Engineer within Research & Development, you are armed with a wealth of knowledge on the intricacies of gameplay technology to inject life into Riot’s exciting new games. You will work in a small team alongside a product lead and designers to answer fundamental product questions to build experiences that will fulfill our players’ impossible dreams. You will report to the Engineering Manager of the project We offer medical, dental, and vision plans that cover you, your spouse/domestic partner, and children. Life insurance, parental leave, plus short-term and long-term disability coverage are also available. Riot will support your retirement benefits with a company match, and double down on your donations of time and money to non-profit charitable organizations. Balance between work and personal life is encouraged with open paid time off, and a play fund so you can broaden and deepen your personal relationship with games.  ===",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T18:35:37.000Z"
  },
  "company": {
    "name": "Riot Games",
    "link": "https://www.linkedin.com/company/riot-games"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}