{
  "job": {
    "title": "Data Scientist",
    "industry": "Marketing and Advertising,Computer Software,Internet",
    "description": "Favor’s mission is ‘Anything Delivered’. Our Engineering team makes high-touch logistics happen. The Favor technology platform is the engine behind the business enabling millions of Favors. Our technology efficiently manages the real-time assignment of Runners to Favors, facilitates communication between customers, Runners, and support, keeps thousands of customer and Runner mobile applications in sync, and more.  We are looking for a Data Scientist to join our growing Data Science team. This person will design and implement models that have a tangible effect on our products and business. They will work on the full lifecycle of machine learning projects from problem definition to feature exploration to ensuring the models they develop work properly in production. This role will be focused on understanding our supply and demand metrics across Texas and forecasting these based on market conditions. At Favor, we believe that to Run Texas, we need to represent Texas. By putting , we honor the diversity of our backgrounds and experiences through sharing our unique voices. Our community grows when we challenge ourselves to learn and see the world from another’s view. We are committed to growing a team with different backgrounds, experiences, abilities, and perspectives and are an equal opportunity employer.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-01T20:58:55.000Z"
  },
  "company": {
    "name": "Favor Delivery",
    "link": "https://www.linkedin.com/company/favor"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 96800,
    "max_value": 160000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}