{
  "job": {
    "title": "Data Scientist, Computational Biology &amp; Baseline Health Study",
    "industry": "Computer Software,Biotechnology,Hospital &amp; Health Care",
    "description": "Verily, an Alphabet company, lives at the intersection of technology, data science and healthcare. Our mission is to make the world’s health data useful so that people enjoy longer and healthier lives.  Our team combines expertise in healthcare, data science and technology to improve the health and well-being of our communities. We are developing the infrastructure and solutions to harness the profusion of health information for good. Our data-driven solutions span three primary areas: research, care and innovation. Programs include Project Baseline - our research initiative to increase participation and evidence generation in clinical research; Onduo - our personalized virtual care platform, which includes connected tools, lifestyle coaching and clinical support; and Debug - our effort to reduce the threat of mosquito-borne diseases by combining machine learning with sterile insect technique. We’re also actively working to combat the spread of COVID-19 through new programs like Healthy at Work. As a Data Scientist working on computational biology, you will be joining a team making use of diverse ‘omics data to improve biomarker and target discovery in different disease settings. You will work in a collaborative, cross-functional team to apply molecular platforms in clinical and research settings. You will lead analyses of large, disease-focused datasets to develop new hypotheses about complex disease and develop an analytical story supporting these hypotheses. You will also work with internal and external collaborators to design new studies in which to apply these molecular platforms and analyses, and may also develop new methods and models to help derive insights from our proprietary platforms. Minimum Qualifications:",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-28T18:55:31.000Z"
  },
  "company": {
    "name": "Verily Life Sciences",
    "link": "https://www.linkedin.com/company/verily-life-sciences"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "South San Francisco",
    "region": "CA",
    "postal_code": "94083",
    "street_address": null,
    "latitude": 37.65568,
    "longitude": -122.41248
  }
}