{
  "job": {
    "title": "Senior Data Analyst",
    "industry": "Information Technology and Services,Management Consulting,Financial Services",
    "description": "Guidehouse is a leading global provider of consulting services to the public and commercial markets with broad capabilities in management, technology, and risk consulting. We help clients address their toughest challenges and navigate significant regulatory pressures with a focus on transformational change, business resiliency, and technology-driven innovation. Across a range of advisory, consulting, outsourcing, and digital services, we create scalable, innovative solutions that prepare our clients for future growth and success. The company has more than 10,000 professionals in over 50 locations globally. Guidehouse is a Veritas Capital portfolio company, led by seasoned professionals with proven and diverse expertise in traditional and emerging technologies, markets, and agenda-setting issues driving national and global economies. For more information, please visit: www.guidehouse.com. Senior Data Analyst role will be part of a data analytics team supporting a large Intelligence Community Agency with data process improvement, data management, and creating performance metrics and business intelligence for business optimization. The candidate will be required to analyze large and complex data sets, including a thorough aptitude for conducting quantitative and qualitative analyses; selecting and applying the appropriate analytical techniques in order to increase organizational efficiency and provide knowledge of data engineering/analysis applications to extract knowledge to help predict, explain, or analyze research questions. The candidate will coordinate with non-technical users to identify data analytics needs support and use facilitation skills and techniques to elicit requirements from a diverse range of stakeholders.  The candidate should have comfort in working with cross-functional teams to present, analyze, update, and view technical data sets with qualitative and statistical analysis. The candidate must have the ability to translate complex problem sets, metrics and assessments into coherent, communications products to brief senior-level officials. The successful candidate must not be subject to employment restrictions from a former employer (such as a non-compete) that would prevent the candidate from performing the job responsibilities as described. Guidehouse is an Equal Employment Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, ancestry, citizenship status, military status, protected veteran status, religion, creed, physical or mental disability, medical condition, marital status, sex, sexual orientation, gender, gender identity or expression, age, genetic information, or any other basis protected by law, ordinance, or regulation.  Guidehouse will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable law or ordinance including the Fair Chance Ordinance of Los Angeles and San Francisco.  If you have visited our website for information about employment opportunities, or to apply for a position, and you require an accommodation, please contact Guidehouse Recruiting at 1-571-633-1711 or via email at RecruitingAccommodation@guidehouse.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodation. Guidehouse offers a comprehensive, total rewards package that includes competitive compensation and a flexible benefits package that reflects our commitment to creating a diverse and supportive workplace.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T23:25:57.000Z"
  },
  "company": {
    "name": "Guidehouse",
    "link": "https://www.linkedin.com/company/guidehouse"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Washington",
    "region": "DC",
    "postal_code": "20398",
    "street_address": null,
    "latitude": 38.892063,
    "longitude": -77.01991
  }
}