{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Software",
    "description": "Cushion is looking for a stellar Machine Learning Engineer to join us during this exciting phase of the company!  We’re growing, generating revenue, and announced our $2.8M Seed round on TechCrunch in 2019. In addition, we have been recognized by SXSW, Bloomberg, American Banker, Inc magazine, and more.  This is a rare opportunity to join a startup as one of the first 20 employees and shape the product, strategy, and culture alongside the Founder and core team.  Who we're looking for  The core of what we're building at Cushion is a system that can perform intelligent financial actions on behalf of a consumer, better than they can.  We are on the hunt to find a humble hard-working ML Engineer who is an outstanding engineer first and foremost (e.g. can build and deploy a web app from scratch if need be). This person must be able to not only extract insights from data and build ML models, but is also able to deploy their models into production without the help of other engineers.  The ideal candidate is curious, driven, absolutely loves solving complex problems, is a pleasure to be around and work with, and has an intense bias towards making stuff happen.  As an engineer at Cushion, you will What we're looking for  Based on our experience building teams at multiple companies, including Twitter, we're looking for candidates with the following background: The salary range for this position is $120,000 - $180,000",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T06:08:10.000Z"
  },
  "company": {
    "name": "CUSHION AID",
    "link": "https://www.linkedin.com/company/cushion-aid"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}