{
  "job": {
    "title": "Senior Software Engineer in Test",
    "industry": "E-Learning",
    "description": "Introduction  Will you transform the future of online education? Make a difference while building the best digital curriculum capabilities and resources to benefit teachers, administrators, parents, and students with innovative, potential-maximizing technologies – Join Us!  Weld North Education seeks a Senior Software Engineer in Test to design, develop, and maintain automation systems and tools to be used by development and test engineers. Weld North Education (WNE) is a leading digital education technology company focused on developing digital curriculum and tools for K-12 students. At WNE, we focus on building the best digital curriculum capabilities and resources to enable teachers, administrators, parents, and students to benefit from innovative technologies designed to maximize potential. Our teams are creating the future of integrated curriculum and assessments to transform the way teachers teach and students learn.  A Day in the Life as a Senior Software Engineer in Test  As a Senior Software Engineer in Test of the Product and Enterprise Operations team, you will spend your days developing and applying software development and test automation skills in support of Quality Assurance tasks. You will work collaboratively with other automation team members in a high-functioning team to create high-quality results. We offer competitive salaries and benefit choices. Our health & welfare benefits provide full-time employees both choice and value to meet the needs of our diverse workforce. We offer multiple health, dental, and vision plans to choose from including accident/critical illness insurance, pet insurance, identity protection, and others. We also provide (at no cost to employees) life insurance, short-term and long-term disability insurance. Paid time off benefits include PTO, holidays, volunteer time off, and paid bonding leave, among others. We contribute to an employee's 401(k) and HSA account. And to support professional growth, we offer multiple training and development programs through our in-house university.  Equal Opportunity Employer  WNE is an Equal Opportunity Employer committed to a diverse workforce, providing equal employment and advancement opportunities to all qualified individuals. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-19T03:08:58.000Z"
  },
  "company": {
    "name": "Weld North Education",
    "link": "https://www.linkedin.com/company/weld-north-education"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 75100,
    "max_value": 135000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Provo",
    "region": "UT",
    "postal_code": "84601",
    "street_address": null,
    "latitude": 40.235123,
    "longitude": -111.66219
  }
}