{
  "job": {
    "title": "Software Engineer, Data",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Ring is looking for a Software Engineer with the passion to drive the execution and ongoing support of mission-critical data services, furthering large-scale data governance, data streaming, and data analytics. If you are passionate about data and technology, eager to seek challenging and innovative opportunities, and motivated to deliver the best customer experience, then this role is the right fit for you. Since its founding in 2013, Ring has been on a mission to make neighborhoods safer. From the video doorbell, to Ring Alarm, which was named #1 in Customer Satisfaction for DIY Home Security Systems by J.D. Power, Ring’s smart home security product line, as well as the Neighbors app, offer users affordable whole-home and neighborhood security. At Ring, we are committed to making home and neighborhood security accessible and effective for everyone -- while working hard to bring communities together. Ring is an Amazon company. For more information, visit www.ring.com. With Ring, you’re always home.  Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us//. - Amazon.com Services LLC Job ID: A1352286",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T16:14:08.000Z"
  },
  "company": {
    "name": "Ring",
    "link": "https://www.linkedin.com/company/ring-labs"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 65300,
    "max_value": 141000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Hawthorne",
    "region": "CA",
    "postal_code": "90251",
    "street_address": null,
    "latitude": 33.916424,
    "longitude": -118.35028
  }
}