{
  "job": {
    "title": "Data Scientist 1",
    "industry": "Computer Software,Financial Services,Internet",
    "description": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 392 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal (NASDAQ: PYPL) is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Our open digital payments platform gives PayPal’s 254 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money, and offers choice and flexibility when sending payments, paying or getting paid. Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo and Xoom enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies. The Partner Checkout Analytics team is seeking a Sr. Analyst to join us as an exceptional problem solver with a passion for data insights and a relentless execution focus. Our team is part of the larger Product Analytics organization and we partner with several stakeholders to tackle merchant questions, especially on product performance and optimization, and make sure that PayPal is analytically equipped for these strategic discussions. We cover both branded and unbranded products across PayPal and advise our strategic merchant partners on how to optimize their payment performance and grow with PayPal. We are looking for a passionate & dynamic Sr. Analyst who should be able to challenge the status quo, and drive data backed decision making leveraging the power of strategic partnerships. The Sr. Analyst is responsible for analyzing merchant product performance and health, triaging the issue, and provide recommendation on the best course solution and optimization. The position will work in close partnership with a host of internal teams to ensure that the merchant’s analytic needs are well addressed. The job requires the candidate to build and maintain close working relations with the various cross functional stakeholders. The analyst will also have opportunities to manage interactions with our top merchants externally, therefore impeccable communications skill becomes a huge advantage. If you’re a data driven enthusiastic and passionately looking to solving real life problems in the payment world for our top merchants, apply now! We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.  PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities.  REQ ID R0074995",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T13:03:49.000Z"
  },
  "company": {
    "name": "PayPal",
    "link": "https://www.linkedin.com/company/paypal"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Chicago",
    "region": "IL",
    "postal_code": "60654",
    "street_address": null,
    "latitude": 41.88323,
    "longitude": -87.6324
  }
}