{
  "job": {
    "title": "SPG iOS Software Engineer - UI Application",
    "industry": "Consumer Electronics",
    "description": "As a Software Engineer within Apple’s Special Projects Group (SPG), you will be part of a team creating new and innovative experiences for human interaction with autonomous technology. You will be prototyping and developing apps and frameworks on Apple internal iOS platforms to build cutting-edge UX and UI.   We work in a fast paced, startup-like environment and you will be part of every stage of development working multi-functionally with user interface designers, mechanical, electrical, and controls engineers from concept phase to deployment.   We are looking for an on-device full-stack engineer who is passionate about software quality and user experience. Proficient in Swift and/or Objective-C.   Familiarity with common iOS frameworks.  Hands-on experience shipping high quality iOS applications with highly responsive, interactive UI.  Strong understanding of software architecture, algorithms, data structures, object-oriented programming, and design with keen eye to best practices and design patterns.  Effective communicator, excellent interpersonal skills, and ability to work well with all levels of engineers and people in other fields.  3+ years experience with software engineering, design, problem solving, and debugging.  Motivated self-starter and great teammate who thrives working in a dynamic environment and learning new technologies. This position requires a proactive engineer with strong technical and interpersonal skills to handle responsibilities including:   -  Design, architect and implement new apps and frameworks primarily in Swift/Objective-C.  -  Understand product requirements, engage with team members and customers to define solutions, and estimate the scope of work required.  -  Deliver solutions that can keep up with a rapidly evolving product.  -  Develop software that works in safety-critical environments, and build test and verification pipelines that ensure reliability and resiliency.  -  Write comprehensive unit tests and work closely with software integration teams for the software you deliver.  -  Shell and Python scripting (e.g. for test tools development).  -  Participate in architecture and code reviews, and hiring interviews. BS in Computer Science or equivalent experience. While the following skills aren’t required, knowledge of one or more of these areas would be valuable:   -  Knowledge & experience with C.  -  Knowledge of 3D rendering or experience building 3D apps using SceneKit, Metal or Open GL.    Role Number: 200260446",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:01:46.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}