{
  "job": {
    "title": "Software Engineer - Early in Career",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Join us as we pursue our disruptive new vision to make all machine data accessible, usable and valuable to everyone. We are a company filled with people who are passionate about our product and seek to deliver the best experience for our customers. At Splunk, we’re committed to our work, customers, having fun, and most importantly, to each other’s success. Learn more about Splunk careers and how you can become a part of our journey!  Splunk is looking for a Software Engineer to join the Data Platform - Indexing teams.  We work on one of the vital core areas of Splunk - getting customer data safely persisted in our systems and available to query. Join us as we work on a tremendous scale, dealing with PBs of data across thousands of customers.  We give our engineers an environment in which they can start contributing from week one, while also providing constant opportunities for learning and growth. You'll learn how our entire stack works, from data ingestion and storage to searching, reporting and building dashboards, all in massively distributed and multithreaded environments. The work you’ll do will directly impact the experience of our customers. Splunk provides a constant stream of new things to learn. We're always expanding into new areas and exploring new technologies. We believe in growing engineers through ownership, leadership, and provide a mentorship program that encourages growth to both mentors and mentees.  We value diversity at our company. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-12T19:05:06.000Z"
  },
  "company": {
    "name": "Splunk",
    "link": "https://www.linkedin.com/company/splunk"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 121000,
    "max_value": 165000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}