{
  "job": {
    "title": "Data Scientist",
    "industry": "Medical Devices,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "The Diabetes Operating Unit focuses on improving the lives of those within the global diabetes community. As a business, we strive to empower people with diabetes to live life on their terms by delivering innovation that truly matters and providing support in the ways they need it. We’re committed to meeting people with diabetes where they are in their journey, always with an aim to make their lives easier. Our portfolio of innovative solutions are designed to provide customers greater freedom and better health, helping them achieve better glucose control, while spending less time managing their disease.  As a member of the Data & Informatics Innovations team, the Data Scientist will engage in statistical and exploratory analysis of datasets such as medical devices data (e.g. insulin pumps and glucose sensors) and smart wearable devices, alongside patient contextual data, and use the insights to build robust classification and prediction models geared toward diabetes management products using advanced artificial intelligence & machine learning algorithms.  The Data Scientist will also play a role in advising and assisting strategic decision making by delving into new and existing data sources to define, monitor, and report on key product performance metrics, test and validate hypotheses, help prioritize product pipelines, and influence better product design decisions.  This role will partner effectively with product managers, front- and back-end software engineers, and DevOps to identify product features and business opportunities, define need for technology infrastructure, and implement CI/CD pipelines following best practices.  A career at Medtronic is like no other. We’re purposeful. We’re committed. And we’re driven by our Mission to alleviate pain, restore health and extend life for millions of people worldwide. Responsibilities may include the following and other duties may be assigned. 2+ years’ experience with a Bachelor in a quantitative science or related engineering discipline or Master in a quantitative science or related engineering discipline Together, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.  We want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.  Physical Job Requirements:  The physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)  Additional Information",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-18T00:03:55.000Z"
  },
  "company": {
    "name": "Medtronic",
    "link": "https://www.linkedin.com/company/medtronic"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Northridge",
    "region": "CA",
    "postal_code": "91330",
    "street_address": null,
    "latitude": 34.24326,
    "longitude": -118.532364
  }
}