{
  "job": {
    "title": "Software Engineer - LT Workbench Backend",
    "industry": "Computer Hardware",
    "description": "At Lightelligence, our engineers have opportunities to grow and develop cutting-edge technology at the forefront of photonic computing. With a culture of internal mobility, there's opportunity to thrive in a variety of disciplines. This is a place for dreamers and doers to succeed.  Become a part of the AI revolution at Lightelligence, where we’re building computational machines that are solving problems in ways that have never been done before!  As a Backend Software Engineer on LT Workbench you will be an integral part of Lightelligence's growing engineering organization and will drive the adoption of our accelerators and ML model-deployment best practices.  As part of the LT Workbench team, you will help build out a platform to allow other internal teams to quickly develop, experiment, iterate, and deploy new projects and ideas. The workbench will be a cloud-native web application and API that enables our scientists and engineers to... If you meet 80% of the qualifications below or have other strengths that you think would benefit our team, we still encourage you to apply. Lightelligence is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-06-24T15:22:38.000Z"
  },
  "company": {
    "name": "Lightelligence",
    "link": "https://www.linkedin.com/company/lightelligence-ai"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 73900,
    "max_value": 159000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}