{
  "job": {
    "title": "Software Engineer - Cloud",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "at Verimatrix helps us create and build on our large suite of security and content protection products. These products are used around the world to protect video content that is delivered via satellite, cable, and the internet. A successful software engineer at Verimatrix works to deliver value to our customers by collaborating hand-in-hand with Product Management and engineering teammates to design, build and deliver high-performing, scalable products.  To be successful, you must be proactive, interactive, creative, and flexible. If you want to make an impact, but be part of something bigger than yourself, then you are already the best kind of teammate. We love working with people who care about customers, quality, new technologies and the people they work with! Help us navigate through challenging problems, setting new standards of innovative problem solving. The technical world moves at an unbelievable pace and we want to move even faster. Join our creative, fast-paced, tight-knit group of engineers and become part of the solution at Verimatrix. : To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. include the following. Other duties may be assigned. Verimatrix helps power the modern connected world with Security Made for People™. We protect digital content, applications, and devices with intuitive, people-centered, and frictionless security. Leading brands turn to Verimatrix to secure everything from premium movies and live streaming sports to sensitive financial and healthcare data, to mission-critical mobile applications. We enable the trusted connections our customers depend on to deliver compelling content and experiences to millions of consumers around the world. Verimatrix helps partners to get to market faster, scale easily, protect valuable revenue streams, and win new business. Powered by JazzHR  2ewEu187fd",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-19T12:37:18.000Z"
  },
  "company": {
    "name": "Verimatrix",
    "link": "https://www.linkedin.com/company/verimatrix"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}