{
  "job": {
    "title": "Principal Software Engineer Developer",
    "industry": "Financial Services,Information Technology and Services,Information Services",
    "description": "We believe that diversity in background and experience will foster an inclusive and engaging work environment for our employees. This ultimately enables us to deliver a better product for our customers.  Being technically competent is only telling half the story. We believe that delivering the best possible customer experience requires an artful blend of human ingenuity and technology. While we value smart technologists, we are fanatics about our culture that promotes autonomy and leadership at all levels. People who are great cultural fits demonstrate curiosity to learn, are unafraid to break things, step up and take the lead, take ownership of their projects, and thrive by sharing knowledge. Come join Fidelity in 2021 as we have our Better Way of Working! Your mission, if you choose to accept it, is to join Client Solutions Technology chapter focused on greater delivery, efficiency, and quality. Our engineering team is innovative, diverse, passionate, and self-driven. We work in a very dynamic agile environment. You will work in a Squad focused on enabling Wealth Management business in Fidelity through Flexible, Scalable platforms and report to a Chapter Leader (your manager), whose primary focus is to help you develop in your career and skills as we drive towards increased automation, continuous delivery with quality. Chapter Leaders drive the “how”: skills & mastery, while your Squad drives the “what”. This is the next evolution of Agile development! Company Overview  At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: . We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.  Join Us  At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities.  We invite you to at fidelitycareers.com.  Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.  Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-17T07:13:26.000Z"
  },
  "company": {
    "name": "Fidelity Investments",
    "link": "https://www.linkedin.com/company/fidelity-investments"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}