{
  "job": {
    "title": "Data Scientist - Apple Retail Online",
    "industry": "Consumer Electronics",
    "description": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it.   We are seeking a Senior Strategy Analyst to strategize, prioritize, plan, design and analyses that will have direct and measurable impact to Apple’s global retail contact center (RCC) operations. We are looking for a self-starter with outstanding statistical analysis experience as well as the ability to apply the findings from the analysis to business operations. This is a strategic partnership role and will report into the Apple Retail Contact Center planning team. In this role, you will work multi-functionally with a wide range of Apple teams including Global RCC, Retail Finance, Business Operation, Work Force Management on defining, planning, prioritizing and delivering the business analytics initiatives. Excellent statistical skills in applied regression, spatial and time series modeling  Deep understanding of design of experiments principles  Validated solid understanding of SQL (Teradata preferred), SAS, and R  Experience with scripting and automation of data extraction, data mining, transformation, and modeling outputs  Proficiency with data visualization, such as Tableau  Consistent track record of independently solving complex business problems with hypothesis establishing, data collection, sophisticated statistical analysis, and scalable process creation -  Be a self-starter, motivated, accountable, and a highly upbeat teammate  -  Good communication skill with excellent verbal and written presentation skills - able to promote data informed decision-making.  -  Passionate about understanding the fundamental reasons that customers contacting Apple RCC, and independently build scalable modeling to forecast future contacts  -  5+ years of forecasting experience will be a plus, preferably within a retail domain Bachelor's Degree Required - Applied Social Sciences, Business Administration, Marketing, Finance, Operations Research, or related fields. Masters Degree desirable.    Role Number: 200273908",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-18T05:20:03.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 110000,
    "max_value": 164000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}