{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Computer Software,Human Resources,Information Technology and Services",
    "description": "At Workday, we help the world’s largest organizations adapt to what’s next by bringing finance, HR, and planning into a single enterprise cloud. We work hard, and we’re serious about what we do. But we like to have fun, too. We put people first, celebrate diversity, drive innovation, and do good in the communities where we live and work. We believe if you do what you love, you’ll love what you do. There’s a lot to love at Workday Boulder. Part of a global, high-growth technology company, our Workday Boulder team has the unique opportunity of developing the next generation of Workday’s groundbreaking collaborative products supporting a customer base of more than 31 million strong. You will solve complex problems and influence teams across Workday as you build enterprise software. Thrive in our fun, people-first culture that creates an environment passionate about your success and ability to do your best work. Join us as we change the way millions of people work.Are you incredibly motivated by witnessing machine learning/AI products come to life in production settings which impact tens of millions of people? Workday’s Machine Learning organization is bringing “AI, first” products to life at every step of the Workday product offering. We’re looking for highly creative, results-oriented, and deeply skilled machine learning engineers/scientists to help on a range of these challenges. The Machine Learning Engineer constructs, studies and trains algorithms that can learn from complex, high dimensionality data in order to uncover patterns from which practical and usable predictive models and applications can be developed. They will also use machine language and statistical modeling techniques such as decision trees, logistic regression, Bayesian analysis and others to develop and evaluate algorithms to improve product/system performance, quality, data management and accuracy. Basic Qualifications Disclosure required by sb19-085 (8-5-20) of the minimum salary compensation for this role to be located in the state of Colorado. Minimum salary for the role is listed below. As a part of the compensation package, this role may include eligible bonuses, equity and commissions. For more information regarding Workday benefits, please   click here .  Colorado minimum salary:  $128,200.00  Workday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T18:57:21.000Z"
  },
  "company": {
    "name": "Workday",
    "link": "https://www.linkedin.com/company/workday"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Boulder",
    "region": "CO",
    "postal_code": "80310",
    "street_address": null,
    "latitude": 40.016872,
    "longitude": -105.279625
  }
}