{
  "job": {
    "title": "Jr. Data Scientist #185889",
    "industry": "Banking",
    "description": "An opportunity to be the part of the team working on forming and delivering the operational strategy behind Machine Learning and Data Engineering. You will work with a distributed team of data scientists and DevOps engineers. The data scientists have background either Masters or PhDs. Some of them have years of machine learning development experiences. Team promotes a self-learning and sharing knowledge culture. With projects, you could have chance to pair with experienced data scientist or engineers to tackle the challenge. The role will provide ownership and end-to-end project visibility with direct recognition from clients. There are tons of opportunities you can help shaping the future of machine learning practices and analytics framework in the future. We are a department which values Diversity and Inclusion (D&I) and is committed to realizing the firm’s D&I ambition hich is an integral part of our global cultural values ' Our Data Science team is seeking a hardworking and enthusiastic Data Scientist, who will focus on the development and delivery of strategic and innovative AI solutions across the bank. He /She will apply state-of-the-art ML tools and concepts to deliver value to our clients and make an impact to the organization while tackling challenging problems in the areas of Machine Learning, Data Analytics and Computer Science. United States-NC-Raleigh",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T05:12:48.000Z"
  },
  "company": {
    "name": "Credit Suisse",
    "link": "https://ch.linkedin.com/company/credit-suisse"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Raleigh",
    "region": "NC",
    "postal_code": "27699",
    "street_address": null,
    "latitude": 35.781303,
    "longitude": -78.64168
  }
}