{
  "job": {
    "title": "Machine Learning Engineer- Applied Statistics",
    "industry": "Computer Software,Internet,Information Technology and Services",
    "description": "Truveta is a new company, led by our vision - Saving Lives with Data. Our mission is to drive innovation in patient care and development of new therapies. We are driven by staunchly held principles - we are in service to patients and their best possible outcomes, patient privacy is paramount, and scientific integrity is essential.  In Truveta we believe that artificial intelligence will play a critical role in accomplishing our mission towards saving lives with data. An important component of this work is building deep intelligence and making it available to clinical researchers and medical community overall in accelerating building high quality equitable solutions. We are building a trove of quality healthcare data suitable for medical research and advancing health knowledge. This is an exciting and enormously challenging endeavor where rigorous scientific practice must be blended with robust cloud engineering technology. Specifically in the areas of Real World Data and Real World Evidence, as well as results about the potential risk or benefits of a medical treatment or practice. Using these results to complement or guide clinical experiments can significantly accelerate improvements in therapies and procedures. If you are drawn to work in this space and have a background in applied statistics, data science or computational biology we invite you to join us. Be a part of building something special. Now is the perfect time to join Truveta. We have strong, established leadership with decades of success. We are well-funded. We are building a culture that prioritizes people and their passions across personal, professional and everything in between. Join us as we build an amazing company together. Truveta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T00:00:00.000Z"
  },
  "company": {
    "name": "Truveta",
    "link": "https://www.linkedin.com/company/truveta"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}