{
  "job": {
    "title": "Machine Learning Engineer",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. We are thrilled to share that . In addition, for the last five years we’ve been named in the . The Global Analytics and AI team is accelerating Experian’s impact by bringing together data, tech, and data science and build game-changing products and services for our customers. We are looking for a Machine Learning (ML) Engineer to lead the development of our AI platform and products to serve the needs of Experian’s clients, including those in the financial services and healthcare sectors.  Our team is tackling a key questions, like - How can we increase the rigor and scalability of our loan originations modeling approach? How can we tackle important issues in the lending space today like bias, fairness and explainable AI? And, for our healthcare clients, how can we reduce providers costs with sophisticated machine learning algorithms?  As a growing team, we embrace a start-up mentality while operating in a large organization. We value speed, agility, and impact – and our results and ways of working are transforming the culture of the larger organizations around us. Joining our team in Global Analytics, you'll be responsible for developing and operationalizing our machine learning platform. As an engineer on our close-knit, cross-functional team, you’ll be an active voice in shaping our products. This is a unique opportunity to get involved from the ground level as part of a growing, dynamic team. All your information will be kept confidential according to EEO guidelines.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T23:59:17.000Z"
  },
  "company": {
    "name": "Experian",
    "link": "https://www.linkedin.com/company/experian"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Costa Mesa",
    "region": "CA",
    "postal_code": "92626",
    "street_address": null,
    "latitude": 33.663857,
    "longitude": -117.90476
  }
}