{
  "job": {
    "title": "Systems Engineer III",
    "industry": "Medical Devices,Hospital &amp; Health Care,Information Technology and Services",
    "description": "Transforming smiles. Transforming lives. Transforming an industry.  At Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our teams are constantly pushing the boundaries of what’s possible.  Ready to join us? We are looking for an innovative candidate to be a key contributor as a Sr. Systems Engineer. The Sr. Systems Engineer provides technical expertise, direction and support to cross-functional teams, while guiding the design control processes of the Invisalign System and/or iTero products. This individual will be responsible for planning and executing projects that focus on new product development, as well as improving Align's existing products. Work is hands-on and cross-functional with other engineering groups, working in teams that solve varieties of exciting technical challenges.  The candidate will also support product development with a heavy focus on the design control of medical device processes, testing and documentation. This candidate will work closely with cross functional development teams to write, edit, review and finalize technical documents required for regulatory submissions of medical device products. Knowledge of testing and documents for pre-submissions, verification and validation protocols and reports is desired. Knowledge of US and European medical device documentation regulatory requirements (21 CFR 820.30 & ISO 13485) desired as well. BS/MS/Ph. D. in an engineering discipline  5+ years of experience in the medical device/pharmaceutical industry, familiar with medical device regulations and product development for medical devices. Engineering experience and Technical Writing desired. Great! Click the \"Apply\" link to let us know you are interested. Not the right fit? Don’t worry, Align is quickly growing so we are creating more opportunities to expand our Align family. Please consider joining our Talent Network to receive notifications about future jobs or sharing this opportunity with others in your network. Align Technology is a publicly traded medical device company that is . Our global team of talented employees develop innovative technology, tools and treatment options to help dental professionals worldwide achieve the clinical results they expect. Our digital ecosystem combines the power of technology to create beautiful smiles through the integration of AI and machine learning, digital imaging and visualization, biomechanics and material science to develop the Invisalign system, the most advanced clear aligner system in the world; iTero Intraoral Scanners and OrthoCAD digital services. Did you know? Align is the world’s largest manufacturer of custom 3D-printed materials.         By joining Align, you will be part of a global, fast-growing company in one of the most dynamic industries. Great people, innovative technologies, and meaningful work - these are just some of the things employees say make Align Technology a great place to work.         We respect your privacy. Please review our for additional information. At Align, we believe in the power of a smile, and we know that every smile is as unique as our employees. As we grow, we will continue building a workforce of diverse cultural backgrounds and life experiences and fostering a culture of open-mindedness and compassion for all our employees. We live our company values by promoting healthy people and healthy communities. All with the intent of changing millions of lives, one unique smile at a time. It is our policy to provide equal employment opportunity in all of our employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for positions with Align must be legally authorized to work in the country which they are applying for and verification of employment eligibility will be required as a condition of hire.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:20:07.000Z"
  },
  "company": {
    "name": "Align Technology",
    "link": "https://www.linkedin.com/company/align-technology"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Jose",
    "region": "CA",
    "postal_code": "95148",
    "street_address": null,
    "latitude": 37.334793,
    "longitude": -121.888145
  }
}