{
  "job": {
    "title": "Software Engineer",
    "industry": "Commercial Real Estate,Information Technology and Services,Research",
    "description": "Software Engineer CoStar Group is the world’s leading provider of information and marketing solutions for the Commercial Real Estate industry. We are a NASDAQ listed company with a market cap of over US$30B and sit alongside other notable names such as Amazon, Facebook, Google, and Apple.  As a technology company, we are the trusted partner for all commercial real estate professionals empowering many of the most well-respected landlords, development companies, brokerage firms, banks, lenders, investors, and government agencies.  We do this by actively researching the commercial real estate markets and providing data, analytics, innovative tools and powerful marketing platforms in the U.S. and Internationally to help our clients transact with one another. CoStar continues to win multiple awards including one of Forbes most innovative companies (2017) and Fortune’s fastest growing companies (2018).  LoopNet.com is the leading and most heavily trafficked online commercial real estate (CRE) marketplace listing website in U.S., with over 10 million monthly unique visitors, 70 million monthly property searches and 1 million Detail Page views per day. A CoStar Group subsidiary, LoopNet marketplace includes LoopNet.com, Ten-X.com, CityFeet.com, Showcase.com, Realla.co.uk and bellbex.com  https://www.loopnet.com/solutions/  As a LoopNet marketplace Senior Software Engineer you will be responsible for building applications that are using by millions of CRE users and professionals to market over trillion of dollars of CRE properties on the marketplace platforms. Working at CoStar Group means you'll enjoy a culture of collaboration and innovation that attracts the best and brightest across a broad range of disciplines. In addition to generous compensation and performance-based incentives, you'll be supported in both your professional and academic growth with internal training, tuition reimbursement, and an inter-office exchange program. Be part of a team of professionals enjoying the opportunity to learn, do, and grow in a rewarding atmosphere. But don't just take our word for it -- see why our team chose to work at and stay at CoStar Group: https://www.youtube.com/watch?v=CVbJRnJ2sX0  Candidates must have current US work authorization  CoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testing  CoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testing",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-29T18:12:35.000Z"
  },
  "company": {
    "name": "CoStar Group",
    "link": "https://www.linkedin.com/company/costar-group"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 77700,
    "max_value": 133000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Irvine",
    "region": "CA",
    "postal_code": "92717",
    "street_address": null,
    "latitude": 33.68591,
    "longitude": -117.82472
  }
}