{
  "job": {
    "title": "Lead Software Engineer - Data Platform (US REMOTE)",
    "industry": "Information Technology and Services",
    "description": "We are a Series D company that’s on a mission to make hospitals more efficient with data science and machine learning. 110+ health systems and 400+ hospitals, across 40 states, rely on our award-winning products to increase patient access, decrease wait times, and reduce healthcare delivery costs. We have raised more than $250 million from top-tier investors such as Insight Partners and Goldman Sachs. We have been named among the top 100 AI companies in the world. Our data platform ingests data at scale from Electronic Health Record systems at 100s of hospitals nationwide, using healthcare data exchange protocols such as HL7 and EHR. It is written in Python, uses Apache Airflow for workflow scheduling, and runs on AWS. As a Senior Software Engineer on the Data Platform, you will play a pivotal role in shaping the data platform and taking it to the next level. LeanTaaS is an equal opportunity employer committed to promoting an inclusive work environment free of discrimination and harassment. We value diversity, inclusion, and aim to provide a sense of belonging for everyone. All qualified applicants for employment will be considered without regard to race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you require assistance during the application process, please reach out to accommodations@leantaas.com. LeanTaaS will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law. Please note: LeanTaaS is not accepting agency resumes at this time, and we are not responsible for any fees related to unsolicited resumes. Thank you.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:10:05.000Z"
  },
  "company": {
    "name": "LeanTaaS",
    "link": "https://www.linkedin.com/company/leantaas"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}