{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Our mission is to accelerate the adoption of cryptocurrency so that you and the rest of the world can achieve financial freedom and inclusion. In our first decade, Kraken has risen to become one of the largest, most successful and respected crypto exchanges in the world.  We are changing the way the world thinks about finance and our range of successful products are playing a critical role in the mainstream adoption of crypto assets. We continue to trail-blaze into new territory with the introduction of Kraken Bank, providing a more seamless integration between crypto and the traditional financial system. This makes us the first crypto company (ever) to be awarded a U.S. state banking charter.  Our diverse group of 2,000+ Krakenites are distributed all over the world, united by a shared passion for delighting customers, upholding crypto values and achieving our meaningful mission. We attract people who push themselves to improve, are radically transparent and think differently in order to unlock their potential.  Crypto is a rapidly evolving industry and we’re just getting started. We’re growing fast and you're invited to join the revolution! We are looking for a Data Scientist who is innovative, highly-motivated, and proactive.  For this role, you will be part of a team that builds cutting-edge trading products in the cryptocurrency industry. You will be responsible for transforming data and generating actionable insights into our customer behavior and measuring the performance of Kraken’s products. You will collaborate and lead projects with product management, engineering, marketing, and growth teams. You will transform data from complex systems, generate performance metrics, and share the results with stakeholders at all levels of the company.  Great benefits, amazing perks, remote work and travel opportunities, stock incentives, beautiful HQ office, and a flexible PTO policy make Kraken a great place to work. If you value having a seat at the table and want to make a big impact on guiding the direction of marketing and growth at one of the top crypto exchanges in the world, this role is for you. Location Tagging: #EU #US  We’re powered by people from around the world with their own unique backgrounds and experiences. We value all Krakenites and their talents, contributions, and perspectives.  Check out all our open roles at https://www.kraken.com/careers . We’re excited to see what you’re made of.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T18:32:11.000Z"
  },
  "company": {
    "name": "Kraken Digital Asset Exchange",
    "link": "https://www.linkedin.com/company/krakenfx"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "North Carolina",
    "region": "United States",
    "postal_code": "27208",
    "street_address": null,
    "latitude": 35.539375,
    "longitude": -79.18543
  }
}