{
  "job": {
    "title": "Sr. Biological Research Scientist - Device",
    "industry": "Pharmaceuticals,Biotechnology",
    "description": "At Allergan Aesthetics, an AbbVie company, we develop, manufacture, and market a portfolio of leading aesthetics brands and products. Our aesthetics portfolio includes facial injectables, body contouring, plastics, skin care, and more. Our goal is to consistently provide our customers with innovation, education, exceptional service, and a commitment to excellence, all with a personal touch. For more information, visit www.AllerganAesthetics.com. a Senior Scientist who will provide highly skilled scientific and experimental support to R&D project teams for Pre-Concept, New Product Development, and/or Performance Teams supporting our Plastic Surgery/Breast Surgery franchise. Under minimal supervision, this individual will be expected to independently develop, perform, and analyze in vitro, in vivo (animal-based testing), and/or ex vivo safety and efficacy evaluations of cell/tissue interactions with novel silicone-based medical devices, possibly in conjunction with other biomaterials- or cell/tissue-based products for plastic surgery/breast surgery applications. Additional responsibilities include developing technical strategies and overseeing the design and execution of studies utilizing a variety of cell & molecular biology and/or material characterization techniques including, but not limited to, animal surgery, live imaging, cell culture, microscopy, PCR, ELISA, histology, flow cytometry evaluation of cells and tissues, and material characterization. Additional day-to-day activities will include mentoring junior scientific team members, staying current with literature/scientific advances in the relevant therapeutic area(s), and lab development activities. Experience with managing outsourced research activities is required. Previous experience with biomaterials and/or silicone-based materials is a plus. A proven track record of being able to lead projects and mentor/influence key stakeholders is also a plus. Creativity, acute attention to detail, strong communication skills, as well as the ability to successfully operate independently and as part of a team-based environment is crucial. N/A No Experienced Full-time IC AbbVie’s mission is to discover and deliver innovative medicines that solve serious health issues today and address the medical challenges of tomorrow. We strive to have a remarkable impact on people’s lives across several key therapeutic areas: immunology, oncology, neuroscience, eye care, virology, women’s health and gastroenterology, in addition to products and services across its Allergan Aesthetics portfolio. For more information about AbbVie, please visit us at www.abbvie.com. Follow @abbvie on Twitter, Facebook, Instagram, YouTube and LinkedIn. At AbbVie, we value bringing together individuals from diverse backgrounds to develop new and innovative solutions for patients. As an equal opportunity employer we do not discriminate on the basis of race, color, religion, national origin, age, sex (including pregnancy), physical or mental disability, medical condition, genetic information gender identity or expression, sexual orientation, marital status, protected veteran status, or any other legally protected characteristic.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:24:06.000Z"
  },
  "company": {
    "name": "AbbVie",
    "link": "https://www.linkedin.com/company/abbvie"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Irvine",
    "region": "CA",
    "postal_code": "92717",
    "street_address": null,
    "latitude": 33.68591,
    "longitude": -117.82472
  }
}