{
  "job": {
    "title": "Software Developer 4",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "We are looking for smart systems software engineers with BS/MS/PhD in Computer Science to join the Exadata Team @ Oracle Server Technologies ( http://www.oracle.com/database/exadata.html ). Oracle Exadata technology is the newest innovation in Oracle's history as the provider of the industry's number one database technology. Exadata group (Server Technologies Division) is responsible for the development of all aspects of the Exadata Storage Server and Exadata Database Machine which is named as Oracle’s most successful new product.  Exadata Database Machine is the only database appliance in the industry that is capable of providing extreme performance for data warehousing, OLTP and consolidated workloads. Built using database and storage software from Oracle and industry standard hardware from Sun/Intel, Exadata Database Machine provides a fully optimized engineered system for best performance, scalability and high availability.  At the heart of every Oracle Exadata Database Machine are the Oracle Exadata Storage Servers. These are smart ‘data aware’ storage servers which provide Smart Scans, Smart Flash Cache, Smart Flash Log and Hybrid Columnar Compression technologies. Exadata group is responsible for the development of these innovative technologies that power the entire Exadata family of systems that include various configurations of Exadata X9-2, and Exadata Expansion Rack. Exadata group also keeps looking into leading edge technology like Persistent Memory which is equipped on Exadata X8M and significant boosts the performance in all perspective.  As a member of the software engineering division of Exadata, you will: Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.  As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.  Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:12:12.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redwood City",
    "region": "CA",
    "postal_code": "94064",
    "street_address": null,
    "latitude": 37.4805,
    "longitude": -122.21528
  }
}