{
  "job": {
    "title": "Backend Software Engineer",
    "industry": "Architecture &amp; Planning,Design",
    "description": "Washington, DC, US Boston, MA, US Charlotte, NC, US Chicago, IL, US Seattle, WA, US Austin, TX, US  Gensler’s Digital Experience Design (DXD) practice is positioned at the intersection of physical and digital design and is focused on the creation of immersive experiences, hybrid workplace experiences, and connected urban experiences. Our teams are found across the globe and are formed of seasoned multi-disciplinary generalist and specialists. While our backgrounds are diverse, we have a common passion and commitment for creating innovative and empowering human-centered experiences that improve the world around us. As a Backend Software Engineer, you will be working as part of a global, production-focused team, that facilitates the delivery of immersive and connected experiences for the built environment. As a member of this team, you will help architect, develop, test, deploy, sustain, and document these foundational systems. You will work with a broad range of technologies and perform a diverse set of tasks across collocated and cloud environments.  You will have the opportunity to work on multiple projects with DXD studios across the globe, collaborating with technical and non-technical teams to develop high performance applications in medium to short development cycles. This process will involve technical research, design validation, software architecture, rapid prototyping, testing, development, and sustainment.  To succeed in this role, you will need to be organized, value code clarity over style, be passionate about documentation, enjoy communicating about your work, and be eager to explore new technologies and challenges. At Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.  We encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities.  As part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.  Posted Today Full time R-5412 Gensler celebrates diversity and our commitment to creating an inclusive environment for our colleagues. We are proud to be an Equal Employment Opportunity and Affirmative Action employer of choice. All aspects of employment decisions will be based on merit, performance, and business needs. We do not discriminate on the basis of any status protected under federal, state, or local law. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law.  You may view our Pay Transparency Statement , your EEO rights under the law , and EEO is the law supplemental information . Gensler shares the right to work and participates in the E-Verify program in certain locations, as required by law.  Gensler endeavors to make gensler.com/careers accessible to all applicants. If you need assistance or an accommodation due to a disability, you may contact us .  Regarding Gensler’s approach to recruiting new talent, we will never ask an applicant for sensitive or personal financial information during the recruitment process. We advise all applicants seeking employment with Gensler to review available information on recruitment fraud . Anyone who suspects that they have been contacted by someone falsely representing Gensler should email info@gensler.com .",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T00:08:01.000Z"
  },
  "company": {
    "name": "Gensler",
    "link": "https://www.linkedin.com/company/gensler"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}