{
  "job": {
    "title": "Test Engineer, IODT",
    "industry": "Information Technology and Services,Telecommunications",
    "description": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things.  Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.  Nokia is an equal opportunity employer that is commited to diversity and inclusion.  At Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law Works as System Engineer in product, system or technology program in SW/HW/System Design or Integration & Verification. Strategically based in Nokia Dallas site to co-locate with other local support teams and close to key customer markets and labs for urgent on-site support deployment. Works under general direction and interprets internal/external business issues and recommended best practice in own discipline. Ensure Inter-operability of Nokia products with Devices from key eco-system chipset partner. He/She has the responsibility for understanding 3GPP Specification, Nokia product implementation, integrating ,testing and verification of Nokia 5G RAN with other Devices/Chipets from Key eco-system partners. As part of these activities the engineer should be able to understand Nokia 5G RAN implementation and design test plans to verify Nokia 5G RAN functionalities. Ensure good inter-operability with Devices and 4G RAN. Work as an expert in 5G RAN and Lead and execute technical activities and projects in own responsibility area. Writes requirements, specifications, test plans, reports, and other guiding documentation from a technical point of view. May work also outside of own process area on technical issues. Solves complex engineering problems in many technology areas especially 5G and in 5G-4G interworking areas. Team player in solving complex engineering problems. Undertakes technical training responsibilities The main objective is to work as IODT engineers that support Nokia 5G and LTE products Analogue Hardware - Applied R&D Engineer North Americas-United States-Texas-Dallas Full-time",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T05:08:41.000Z"
  },
  "company": {
    "name": "Nokia",
    "link": "https://fi.linkedin.com/company/nokia"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 50300,
    "max_value": 72200,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}