{
  "job": {
    "title": "Site Reliability Engineer",
    "industry": "Computer Software",
    "description": "Zoox is looking for a site reliability engineer who will be responsible for measuring and maintaining the uptime of the many services critical to the development process for autonomous vehicles. In this role, you will be heavily involved in all phases of rolling out a service from designing systems that are easy to maintain and fault-tolerant through deployment, operation, and continual improvement. Zoox is a robotics company and our ethos of automation extends throughout the infrastructure components we build. Be prepared to work with systems handling large volumes of data and data-processing pipelines performing compute-intensive tasks on CPUs and GPUs. Zoox is developing the first ground-up, fully autonomous vehicle fleet and the supporting ecosystem required to bring this technology to market. Sitting at the intersection of robotics, machine learning, and design, Zoox aims to provide the next generation of mobility-as-a-service in urban environments. We’re looking for top talent that shares our passion and wants to be part of a fast-moving and highly execution-oriented team.  A Final Note: You do not need to match every listed expectation to apply for this position. Here at Zoox, we know that diverse perspectives foster the innovation we need to be successful, and we are committed to building a team that encompasses a variety of backgrounds, experiences, and skills.  The salary range for this position is $100,000 - $200,000",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T05:07:07.000Z"
  },
  "company": {
    "name": "Zoox",
    "link": "https://www.linkedin.com/company/zoox-inc"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 150000,
    "max_value": 233000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Foster City",
    "region": "CA",
    "postal_code": "94029",
    "street_address": null,
    "latitude": 37.561882,
    "longitude": -122.26644
  }
}