{
  "job": {
    "title": "Principal Software Engineer",
    "industry": "Medical Devices,Pharmaceuticals,Hospital &amp; Health Care",
    "description": "At Baxter, we are deeply connected by our mission. No matter your role at Baxter, your work makes a positive impact on people around the world. You’ll feel a sense of purpose throughout the organization, as we know our work improves outcomes for millions of patients.   Baxter’s products and therapies are found in almost every hospital worldwide, in clinics and in the home. For over 85 years, we have pioneered significant medical innovations that transform healthcare.  Together, we create a place where we are happy, successful and inspire each other. This is where you can do your best work.   Join us at the intersection of saving and sustaining lives— where your purpose accelerates our mission.   Software is recognized as a programming expert and platform SME, who leads complex software platform by identifying, solving programming and design issues during development, implementation and sustaining product phases. Understands the software development life cycle and agile methodologies and takes ownership of software platform deliverables including software design, code and test. Collaborates with cross functional team of stakeholder’s system, clinical, Human Factors, UI/UX to drive decisions. This leader will be key contributor in aiding to the Baxter culture levers of Speed, Collaboration, Courage and Simplicity.  Applies a solid understanding of standard engineering techniques, procedures and criteria as part of the software development lifecycle (SDLC) toward the development of new or enhanced software products or processes. Plans, executes and functionally directs important engineering assignments, which require independent judgment. Baxter is an equal opportunity employer. Baxter evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status or any other legally protected characteristic.                                                                                                                                                                 EEO is the Law  EEO is the law - Poster Supplement  Pay Transparency Policy Recruitment Fraud Notice 048148",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:36:08.000Z"
  },
  "company": {
    "name": "Baxter International Inc.",
    "link": "https://www.linkedin.com/company/baxter-healthcare"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 114000,
    "max_value": 153000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Round Lake",
    "region": "IL",
    "postal_code": "60073",
    "street_address": null,
    "latitude": 42.353966,
    "longitude": -88.09335
  }
}