{
  "job": {
    "title": "Senior Software Engineer - Backend",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Parsable aims to improve the lives and experiences of frontline industrial workers by connecting them to the people, information, systems and machines needed to do their best work. Companies like Heineken, Grupo Bimbo (largest bakery in the world), Suntory, LafargeHolcim, and Corteva Agriscience rely on Parsable’s mobile-first platform, Connected Worker®, to empower their workers with modern digital tools that improve productivity, quality, safety, and sustainability at scale. Do you like the idea of a highly-available, well-designed architecture? Are you interested in solving complex large scale problems? We’re hiring a Senior Backend Engineer with deep experience developing complex, highly scalable solutions embracing a customer first attitude. You’ll play a major role in designing and implementing backend services that interact with many different types of devices and an increasingly large number of users. The ideal candidate is well-versed in more than one language and framework and has experience building backend services composed of lots of moving parts that interface via APIs and SDKs. The current Parsable backend tech stack includes Node.js (Typescript), Go, Postgres, MongoDB, Kafka. BONUS At Parsable we have a clear vision: Build an inclusive and diverse organization in which differences are respected and valued. By facilitating dialogue, education, community service and improving internal policies, we're creating a connected community in which everyone is accepted as their best, most authentic self. Parsable is committed to creating an employee population which reflects our customers and our communities. We are proud to be an equal opportunity employer.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T03:19:02.000Z"
  },
  "company": {
    "name": "Parsable",
    "link": "https://www.linkedin.com/company/parsable"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}