{
  "job": {
    "title": "Sr. Research Scientist - Neurology",
    "industry": "Nonprofit Organization Management,Health, Wellness and Fitness,Hospital &amp; Health Care",
    "description": "The Department of Neurology at UT Southwestern Medical Center is a nationally recognized leader in the comprehensive management of neurological conditions. Our vibrant department comprises more than 75 full-time faculty in 12 subspecialty sections, supporting a spectrum of complex and innovative approaches to neurological care, a broad range of novel research programs, and a panoply of educational opportunities for trainees. The department offers access to the latest innovative treatments in one of the most rapidly advancing fields of medicine and features an Advanced Comprehensive Stroke Center and a Level-4 NEAC Epilepsy Center. Through collaborations with the O’Donnell Brain Institute, the department is building state-of-the art facilities for drug and device testing and bringing current and new faculty together for collaborative research on brain disease therapy. The Department of Neurology is seeking a Sr. Research Scientist to work in the lab of Dr. Juan Pascual (https://www.utsouthwestern.edu/labs/rare-brain/). This position will be responsible for neurophysiological data analysis from animal and human studies, signal processing, MATLAB algorithm generation, graphical data representation, statistical analysis and assistance with publications and grant applications derived from the data. Ph.D. degree with major coursework in field of assignment and six (6) years research experience in field of assignment, including at least one (1) year at level of Research Scientist or equivalent.  Master's degree with major coursework in field of assignment and nine (9) years research experience in field of assignment, including at least two (2) years at level of Research Scientist or equivalent.  May consider a Bachelor's degree with major coursework in field of assigment with additional related exerience. Plans, organizes, coordinates, directs and personally participates in major medical or scientific research projects, including development and implementation of research protocols.  Selects key research personnel; determines specific goals or objectives to be attained; assigns and reviews work of subordinates.  Reviews and analyzes resulting research data, revises techniques or approaches to work problems as indicated as necessary by research data.  Compiles, writes and submits project results to principal investigator or department chairman.  Prepares or assists in preparation of research papers, reports and abstracts for publication as one of co-authors.  Designs, develops or adapts equipment used in experiments or research to obtain desired results.  Plans and supervises training of technicians and other laboratory personnel with respect to proper laboratory techniques, use of laboratory equipment, and safety procedures.  Confers with industrial, governmental or other groups concerning progress or results of research project.  Supervises large group of employees engaged in performance of technical and professional work, which varies from routine to complex laboratory work tasks.  Performs other duties as assigned. **Other Duties: Performs other duties as assigned. This position is security-sensitive and subject to Texas Education Code 51.215, which authorizes UT Southwestern to obtain criminal history record information Salary Negotiable Texas-Dallas-5323 Harry Hines Blvd 5323 Harry Hines Blvd Research & Laboratory 417031 - NE-Lab Pascual Full-time Day Job Regular Standard Jul 29, 2021, 6:36:06 PM",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-30T05:10:56.000Z"
  },
  "company": {
    "name": "UT Southwestern Medical Center",
    "link": "https://www.linkedin.com/company/utsw"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 108,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 80400,
    "max_value": 133000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Dallas",
    "region": "TX",
    "postal_code": "75342",
    "street_address": null,
    "latitude": 32.777977,
    "longitude": -96.79621
  }
}