{
  "job": {
    "title": "Software Engineer (Remote, US)",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "Make recognition fun. Love your work. 🤗💚🎉  Join our small but growing team dedicated to building engaged, recognition-rich cultures in workplaces across the globe!  To learn what makes our company culture unique, take a peek at our Employee Un-Handbook, check out our Instagram, , and read what employees say it’s like to work here.  *** COVID-19 Update: Bonusly is still hiring! We will be conducting all interviews and on-boarding new hires remotely until further notice. Until it is safe to return to office-based work, Bonusly will furnish all employees with what they need to work remotely, and employees may choose to work from any location (provided they follow local health guidelines). ***  What is Bonusly?  Bonusly provides solutions to create high-performance, high-engagement teams. We believe that success in business is determined by people, working on teams, to solve novel problems. That belief extends to our own team, and we'd love for you to be a part of it.  What is our mission?  Our mission is to help people connect with their work and each other in meaningful ways. Our vision is for every organization to reach success by using Bonusly to build high-performance, high-engagement teams. We believe that the way we work today can be so much better.  How do we get there?  Our top-rated SaaS platform is built by the talented and creative team here at Bonusly. We work with autonomy, responsibility, and purpose. We are driven by a desire to make meaningful impacts for our customers, and to be excellent teammates to each other along the way. Remote, US only  Bonusly is looking for an experienced, talented and motivated Software Engineer to expand our impact as an established leader in HR B2B SaaS. You will get to positively impact some of the most influential companies in the world such as Hulu, Chobani, Headspace, Palo Alto Networks, and more by building a product that empowers employees to show appreciation for each other, build stronger working relationships, and feel a greater sense of belonging. We're looking for someone who is both highly analytical and enthusiastically creative. Ideally, you are an experienced engineer who can empathize with users, influence design and architecture, and write clean, maintainable code. Finally, you will use your experience in modern frameworks and development tools to drive best practices across the team.  Your team will build products that transform workplace recognition and feedback at the most innovative and fastest-growing companies in the world.  What you’ll do 💯You should apply if you….. Bonus points for….. Salary 🎉Benefits and opportunities include... 💚 What's it like to work at Bonusly?  Culture and employee experience are some of our top priorities! See what we're all about at https://bonus.ly/about, and check out our official Employee Unhandbook to learn more about our culture and values.  🔸 We actively work toward greater diversity, equity, and inclusion  We are an equal opportunity employer and value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-25T21:54:01.000Z"
  },
  "company": {
    "name": "Bonusly",
    "link": "https://www.linkedin.com/company/bonusly"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}