{
  "job": {
    "title": "ETL/BI Developer, Azure (Engineer III, Software)",
    "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
    "description": "Do you want to make a meaningful difference in the quality of healthcare? Omnicell is empowering health systems and pharmacies to radically transform the way they manage medications, so they can achieve the vision of the Autonomous Pharmacy. Thousands of hospitals, pharmacies, skilled nursing facilities and care homes trust Omnicell to provide continuous innovation. They need us to deliver solutions to meet the ever-evolving challenges of the healthcare landscape. We encourage creative problem solving and outside-the-box thinking that only a diverse, well-rounded workforce can bring.  Join us as we build on our powerful combination of advanced automation, predictive intelligence, and expert services to create a safer future for patients—one where medication errors are a thing of the past. You’ll be joining an organization whose culture encourages individual development, rewards intellectual curiosity, and embraces an inclusive environment. Join our growing company and help shape the future at Omnicell! The Engineer III, Software is an experienced professional who participates in creating and extending Omnicell products. This person is a solid developer who can apply industry and corporate best practices to produce quality applications. This person applies their practical and theoretical knowledge from Computer Science and previous experience in Healthcare or a related industry. This person works as part of a team to design and develop new products as well as maintain Omnicell’s current portfolio. Nothing in this job description restricts management’s right to assign or reassign duties and responsibilities to this job at any time.  All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.  Omnicell will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information.  Share",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-08T02:53:47.000Z"
  },
  "company": {
    "name": "Omnicell",
    "link": "https://www.linkedin.com/company/omnicell"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Plano",
    "region": "TX",
    "postal_code": "75093",
    "street_address": null,
    "latitude": 33.019695,
    "longitude": -96.697586
  }
}