{
  "job": {
    "title": "Embedded Systems Software Engineer",
    "industry": "Sporting Goods,Retail,Information Technology and Services",
    "description": "A bit about us  Trek is an awesome place to work, with amazing benefits for all employees. We build only products we love, provide incredible hospitality to our customers, and change the world by getting more people on bikes. When you’re on our team, you’re taken care of, encouraged to learn and grow, and given lots of opportunities to do so. Give us your best, and we’ll give it right back. Sound pretty sweet? Then come join us! Advanced Technologies team is looking for an Embedded Systems Software Engineer to work on multidisciplinary early concept projects. Embedded Systems Software Engineer is responsible for developing the embedded software solutions for the incubating rider-bike interfacing technology concepts with a mass production intent. In this role, you’ll be an integral part of the new concept team that propels the next generation product development. Technical skills: Remote work options available  Flexible and fun company culture  Competitive health care  PPO & HDHP medical plan options, Dental insurance, Vision insurance  Flexible Spending Accounts (FSA)  Free life insurance & optional term life insurance  Competitive vacation package  401(k) with match and Employee Stock Ownership Plans (ESOP)  12 weeks of maternity leave with 100% pay  Flexible holiday schedule – 10 company holidays  Tuition Reimbursement up to $15,000! (Undergraduate & Masters programs)  Employee discounts on all product  Deep partner retail discounts  We are an E-Verify employer. E-Verify Participation Poster: English / Spanish  E-Verify Right to Work Poster: English | Spanish",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-18T05:56:11.000Z"
  },
  "company": {
    "name": "Trek Bicycle",
    "link": "https://www.linkedin.com/company/trekbikes"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Waterloo",
    "region": "WI",
    "postal_code": "53594",
    "street_address": null,
    "latitude": 43.18382,
    "longitude": -88.99043
  }
}