{
  "job": {
    "title": "Software Engineer, Quip",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Products and Technology Our goal at Quip is to build a new class of productivity tool that every person at every company enjoys using every single day. What we're looking for: a software engineering generalist who's passionate and cares deeply about product development.  At Quip, our engineers are always learning new things — we all work cross-platform and full-stack. We pride ourselves on writing high-quality code and maintainable systems that make our lives easier, across Javascript, C++, Python, Java, and Objective-C. Every engineer works on exciting, meaningful projects that impact our technical and product strategy.  We work closely with Product Managers and Designers to define new features, and help map the future of Quip. We’re building the next generation of products leveraging frameworks, such as React, and tackling complex problems related to large-scale backend infrastructure and mobile platforms. We're building a team of talented, thoughtful people who will work together to build an enduring company that will change the way teams work together. -- ” If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. and are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. and do not accept unsolicited headhunter and agency resumes. and will not pay any third-party agency or company that does not have a signed agreement with or Salesforce.org.  Salesforce welcomes all.  Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-03T04:46:10.000Z"
  },
  "company": {
    "name": "Quip",
    "link": "https://www.linkedin.com/company/quip-com"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 88900,
    "max_value": 171000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}