{
  "job": {
    "title": "Data Scientist",
    "industry": "Banking",
    "description": "Thank you for your interest in a career at Regions. At Regions, we believe associates deserve more than just a job. We believe in offering performance-driven individuals a place where they can build a career --- a place to expect more opportunities. If you are focused on results, dedicated to quality, strength and integrity, and possess the drive to succeed, then we are your employer of choice.  Regions is dedicated to taking appropriate steps to safeguard and protect private and personally identifiable information you submit. The information that you submit will be collected and reviewed by associates, consultants, and vendors of Regions in order to evaluate your qualifications and experience for job opportunities and will not be used for marketing purposes, sold, or shared outside of Regions unless required by law. Such information will be stored for a set period of time. You may review, modify, or update your information by visiting and logging into the careers section of the system. At Regions, the Data Scientist works with small teams of data scientists, analysts and visualization experts contributing independently to solve high complexity business problems. The ideal candidate has a depth of knowledge in quantitative analytic methods, data management, visualization, and programming skills suitable to drive data driven decisions. Researches, models, implements and validates algorithms (predictive and prescriptive) to analyze diverse sources of data to achieve targeted outcomes. This position is exempt from timekeeping requirements under the Fair Labor Standards Act and is not eligible for overtime pay. Full time Regions offers a benefits package that is flexible, comprehensive and recognizes that \"one size does not fit all\" for associates. Listed below is a synopsis of the benefits offered by Regions for informational purposes, which is not intended to be a complete summary of plan terms and conditions. Please note, benefits and plans may be changed, amended, or terminated with respect to all or any class of associate at any time. To learn more about Regions’ benefits, please click or copy the link below to your browser.  https://www.regions.com/welcometour/benefits.rf Regions Center - Birmingham Birmingham, Alabama  Bring Your Whole Self to Work  We have a passion for creating an inclusive environment that promotes and values diversity of race, color, national origin, religion, age, sexual orientation, gender identity, disability, veteran status, genetic information, sex, pregnancy, and many other primary and secondary dimensions that make each of us unique as individuals and provide valuable perspective that makes us a better company and employer. More importantly, we recognize that creating a workplace where everyone, regardless of background, can do their best work is the right thing to do.  OFCCP Disclosure: Equal Opportunity Employer/Disabled/Veterans",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:11:55.000Z"
  },
  "company": {
    "name": "Regions Bank",
    "link": "https://www.linkedin.com/company/regions-financial-corporation"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Birmingham",
    "region": "AL",
    "postal_code": "35226",
    "street_address": null,
    "latitude": 33.522858,
    "longitude": -86.80771
  }
}