{
  "job": {
    "title": "Software Engineer - Ad Platform",
    "industry": "Internet",
    "description": "Launched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions. We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams. Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions. We’re always live at Twitch. Stay up to date on all things Twitch on LinkedIn , Twitter and on our Blog . Twitch enables content creators to live-stream content to their communities across the globe. Advertising is a core part of Twitch's business model, and spans across many product areas. We take pride in our mission to help creators earn a living by entertaining and educating their viewers. On the Advertising team you'll work with a passionate, and customer obsessed team. We are a growing team of product and engineering professionals based in the Twitch HQ at downtown SF.  Twitch is looking for backend and full stack engineers with the curiosity and creativity to develop user experiences, services and APIs that grow the advertising and promotion business. These systems give creators opportunities to make money, the data they need to do this well  The ideal contributor has experience building and delivering high-quality production, UXs and web services in a distributed systems environment.  As the leader in this space, Twitch has a unique opportunity to invent what advertising as a product means in a live-streaming context. Our products include creative real-time experiences specific to Twitch. If you're excited about having an outsize impact in an area that's ripe for innovation, come work with us! Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:06:52.000Z"
  },
  "company": {
    "name": "Twitch",
    "link": "https://www.linkedin.com/company/twitch-tv"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 116000,
    "max_value": 175000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}