{
  "job": {
    "title": "Senior Site Reliability Engineer (SRE)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "Oracle GBU Cloud Service (GBUCS) is responsible for managing cloud infrastructure for hundreds of SAAS products developed internally at Oracle. In particular, our team is responsible to build, maintain, and operate the Monitoring-as-a-Service portfolio of monitoring solutions for the entire GBU organization. Our solutions monitor several million entities, at high frequency, that span all layers of the GBUCS stack that includes Storage, Network, Server and the Application services. The monitoring platform is a highly distributed, 24*7 system that collects, transports, processes time-series and log events and provides utilities to alert and visualize massive telemetry data accurately and reliably. Do you want the challenge of working in a cutting-edge environment, solving technical problems, identifying improvements, and implementing your recommendations?  This role lets you design, develop, troubleshoot, debug software for controlling and managing distributed services, multi-level abstractions, end-end automation, monitoring and telemetry and all activities to deliver infrastructure services via code. If you have hands-on experience with analyzing, designing, testing, and implementing solutions, this key role might be for you. As an SRE in the monitoring services team you will be designing and maintaining hosting, process, transform, and analyze operational processes. Your first mission will be to work closely with our software developers and Cloud architects to define a sustainable operational model for monitoring services. This includes mechanisms to scale the systems by way of easy-to-use tooling and automation. You will work in concert with developers and other organization members to evolve systems/products for better scalability, reliability, and monitoring. Some of the responsibilities include: You need to have the following knowledge, skills, and experience: Education and Work Experience Preference for demonstrated practical experience with the following technologies: Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.  As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems.  Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience.If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 111577 in the subject line of the email. Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-16T09:34:02.000Z"
  },
  "company": {
    "name": "Oracle",
    "link": "https://www.linkedin.com/company/oracle"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Bellevue",
    "region": "WA",
    "postal_code": "98007",
    "street_address": null,
    "latitude": 47.6137,
    "longitude": -122.19093
  }
}