{
  "job": {
    "title": "Cloud Network Solution Engineer",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming industry leading products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!    You will be part of the software defined infrastructure (SDI) team focusing on networking for the Cloud Platform. We build web services that work at scale to support infrastructure and security management and control. We are looking for a full stack developer who can build APIs, front ends, and tools that interact with our network infrastructure platform. If you are passionate about innovating and building systems from scratch for the massive scale of our network infrastructure, then our team might the right place for you! Minimum 5 years of experience in hands-on development   Experience designing, building, and maintaining RESTful APIs  Good understanding of containers, build systems and infrastructure automations  Strong organizational, communication and presentation skills  Strong ability to prioritize, deliver on aggressive deadlines and drive closures  High level ownership, self-sufficient, hands-on leader to drive quality and maintain application stability  Experience in working with modern no-sql databases, other key-value stores (MongoDB, Elastic) and Kafka  High tolerance for ambiguity  We're seeking proven experience with Go, Python, Java, Kubernetes, Terraform -  Build orchestration that simplifies Software Defined Network Management.  -  Diagnose and remediate cloud network routing and protocol related issues.  -  Diagnose and remediate host network and system related issues.  -  Troubleshoot network access policy related issues.  -  Build and automate network connectivity to remote sites across the world in a hybrid cloud environment.  -  Champion AWS/GCP Network Solutions to solve business requirements for application teams like AMP, iCloud, Siri and Online Store.  -  Build services to collect metrics/data from distributed Software Defined Network systems.  -  Build tools to help simplify network operation for production environment. BS and MS in Computer Science or equivalent industry experience We are seeking a team player who is excited to work with members having highly diverse technical background. You should have extremely good communication skill and should be self-motivated in pursuing the objective goals.    Role Number: 200275745",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-23T06:38:37.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}