{
  "job": {
    "title": "AI/ML - Machine Learning Engineer, Information Intelligence",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.    Join a new team in Apple AI/ML that is investigating novel visual capabilities across all Apple products that will transform the way people engage with the world around them! We’re looking for strong engineers to work on cutting-edge technology, collaborate with experts across Apple, and deliver new end-to-end experiences that delight customers. Excellent knowledge and practical skills in ML based perception systems  5+ years of experience in developing and implementing high-quality computer vision algorithms  Strong interpersonal skills; able to work independently as well as in a team  Excellent software design, problem solving and debugging skills  Fluency in Python and another language (e.g., C/C++, Go, Swift or Rust)  Experience with relevant deep learning software packages (Keras, Tensorflow, PyTorch) As a senior machine learning engineer you are excited to solve high impact problems using deep learning and large data sets. You will stay up to date with latest research in detection, segmentation and metric learning and work with a team of highly qualified computer vision and machine learning specialists to develop innovative computer vision/machine learning systems in the area of visual search and fine grained recognition. You'll be involved in all phases of model development including data analysis, prototyping, testing, deployment and end to end optimization.   You work closely with teams across Apple worldwide. You have great technical skills, a drive for high quality software and the ability to innovate creative solutions. Communicating clearly and having the flexibility to learn new technologies, while continuously developing your skills will be key to your success. You will fit into our teams, be a fantastic collaborator, comfortable with giving and receiving feedback and able to thrive in a dynamic environment.  If this is you, we'd love to hear from you.   This role will have the following responsibilities:        * Prototype, develop and experiment with computer vision algorithms for search       * Define and measure objective metrics for algorithmic system performance       * Understand product requirements and translate them into engineering goals and tasks       * Guide data collection and labelling for train and test data sets along with defining quality gates       * Build systems for an end to end production grade stack with low latency and high throughput MS or PhD in computer vision, machine learning, computer science or equivalent industry experience.    Role Number: 200267025",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-16T05:10:27.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 135000,
    "max_value": 206000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}