{
  "job": {
    "title": "Front End Engineer - Financial Services - Consulting - Senior (Open Location)",
    "industry": "Information Technology and Services,Computer Software,Financial Services",
    "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all. EY is the only professional services firm with a separate business unit (“FSO”) that is dedicated to the financial services marketplace. Our FSO teams have been at the forefront of every event that has reshaped and redefined the financial services industry. If you have a passion for rallying together to solve the most complex challenges in the financial services industry, come join our dynamic FSO team! The Digital & Emerging Technology team works collaboratively with clients to transform their business through disruptive innovation enablement and transformational design solutions. The team supports our clients in modernizing systems, processes and products to enhance business and customer-facing platforms and services to support high performance in a rapidly changing and competitive environment. Our team helps clients sustain competitive advantage and profitability by developing technology strategies, products, and solutions to stay ahead of the rapid pace of change and disruption and supporting the execution of complex transformations.  We are looking for Frontend Engineers who have worked with modern software solutions including node.js, REST APIs, and cloud-based Solutions. While our teams primary focus is within the financial services industries, you will have opportunities to support other sectors including healthcare, automotive, high-tech, and media. The goal is to support our clients to transform their business through technology. As a Frontend Engineer you will be responsible for analyzing, designing, developing, integrating, testing, and deploying new and existing software application programs. You will deliver high quality systems with focus on reliability and excellent customer experience. We’re looking for a Frontend Developer who can: We’re interested in self-motivated individuals who can easily function in a high demand, performance-driven environment. In addition, we’re looking for people who recognize the accomplishments of the team before the individual and are sought after as people developers. If you’re passionate about problem-solving and helping our clients with some of their most complex issues, this role is for you. We offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. If you can demonstrate that you meet the criteria above, please contact us as soon as possible.  The exceptional EY experience. It’s yours to build. EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.  Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.  Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.  EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, in accordance with applicable law.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-27T05:09:28.000Z"
  },
  "company": {
    "name": "EY",
    "link": "https://uk.linkedin.com/company/ernstandyoung"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Charlotte",
    "region": "NC",
    "postal_code": "28217",
    "street_address": null,
    "latitude": 35.164165,
    "longitude": -80.89497
  }
}