{
  "job": {
    "title": "Senior Software Engineer",
    "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
    "description": "Position Senior Software EngineerSr. Java develper  Los Angeles, CA  Long term  C2C or W2 Bachelor's Degree in Computer Science Engineering or equivalent experience required.  7+ years of software development experience.  7+ years of Java server-side design and development experience.  Highly proficient in J2EE, Spring, Spring Boot and Hibernate.  Distributed Caching (Redis), Queuing technologies (ActiveMQ, Kafka), Elastic Search.  Excellent knowledge of RESTful APIs.  Experience with Data Model, SQL, and No-SQL.  Excellent knowledge of Microservices Architecture and implementation.  Experience with GitHubBitbucket, Jira, Scrum, SonarCloud and CICD processes.  Working knowledge of Linux.  Experience working on software-as-a-service (SaaS), large scale distributed systems and relationalNo-SQL databases.  Experience working in a small team setting along with offshore development team.  Strong verbal and written communication skills proven ability to lead both vertically and horizontally to achieve results thrives in a dynamic, fast-paced, environment and do what it takes to deliver results.  Committed to security practices in policy and delivery.  Show vigilance in reporting of information, security vulnerabilities whether personal devices, corporate assets, services offered to customers, or office environment.  Willing to participate in additional security and privacy trainings.  Willing to be a model citizenmentor in security practices for Greenlots. Experience with AWS, RDS, Docker, Kubernetes.  Experience in Electric Grid management solutions.  Experience in Angular or similar JavaScript frameworks.  Thanks,  Raj  4880 Stevens Creek Blvd. Ste 202, San Jose, CA 95129  Phone  Email",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-09T20:03:23.000Z"
  },
  "company": {
    "name": "Zenaide Technologies, Inc.",
    "link": "https://www.linkedin.com/company/zenaide-technologies-inc."
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Los Angeles",
    "region": "CA",
    "postal_code": "90101",
    "street_address": null,
    "latitude": 34.05224,
    "longitude": -118.24335
  }
}