{
  "job": {
    "title": "Data Scientist",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "In this role the Data Scientist will be working on building Machine Learning and other Advanced Analytics solutions for GE Healthcare Command Center customers. As a Data Scientist you will work independently on all phases of an analytics project which will include data preparation, data analysis, model development, reporting insights, project management, presentation of results and recommendations to stakeholders. She/he will work closely with multiple engineering teams to support the research and development of Data Science technologies . Our team is fearless in pursuit of new ideas and uncompromising in our quest to become a world class team solving complex problems and improving patient outcomes.GE Healthcare is a leading global medical technology and digital solutions innovator. Our Digital organization is structured around three major areas: Products & Platform, Go to Market and Centers of Excellence. Our total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support. GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an    Equal Opportunity Employer    .  Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.    GE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable). No",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-29T20:12:12.000Z"
  },
  "company": {
    "name": "GE Healthcare",
    "link": "https://www.linkedin.com/company/gehealthcare"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 94100,
    "max_value": 132000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Arlington Heights",
    "region": "IL",
    "postal_code": "60006",
    "street_address": null,
    "latitude": 42.082977,
    "longitude": -87.98046
  }
}