{
  "job": {
    "title": "Software Engineer I",
    "industry": "Computer Software,Financial Services,Real Estate",
    "description": "Stavvy is transforming how business is conducted remotely by making complex legal and financial transactions easier, safer, and more accessible to all. Whether we are working to enable title companies to facilitate remote closings in a safe way, better connecting lenders with the businesses they use during the home buying process, or building the next set of tools for the platform, Stavviators (our employees) are disruptors at heart. Our team is constantly iterating, solving problems, and working together to simplify life's defining moments. If you want to help power the paperless revolution, join us at Stavvy! You are a self-driven Software Engineer with 1+ years of professional experience. You have some experience in Python or Java and you have a hunger for learning new languages and are willing to learn and develop full-time with Python primarily. You’re eager to improve upon your skills for writing complex backend code for a publicly accessible web application with aspirations to scale its user base dramatically. A problem solver, you enjoy the process of learning something new and are excited about building products that are used by regular people who are navigating one of the largest financial transactions of their lives (buying a house). A natural collaborator, you thrive in fast-paced environments and love to work with multiple teams to meet market requirements and deliver exceptional software. In the Software Engineer I role, you will be an integral part of the Engineering team, responsible for helping to develop the core backend capabilities that will have the largest impact on value and experience for our application’s users. You will also have the opportunity to be coached/mentored and learn from the senior members of the engineering team while working together to support our company goals of creating a seamless virtual closing process for purchasing real estate or participating in other loan servicing activities. Stavvy is a fast growing organization so you will also have the opportunity to flex into other projects as our organization continues to evolve. This is an exciting role for someone who is interested in Fintech and learning more about the real estate industry - you’ll develop in both spaces.  This is a unique role because you’ll be a part of building a tech product from the ground up to solve real problems facing the banking/mortgage industry and help",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T14:49:37.000Z"
  },
  "company": {
    "name": "Stavvy",
    "link": "https://www.linkedin.com/company/stavvy"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Boston",
    "region": "MA",
    "postal_code": "02118",
    "street_address": null,
    "latitude": 42.358994,
    "longitude": -71.05863
  }
}