{
  "job": {
    "title": "Requirements Planning &amp; Governance Support System Engineer",
    "industry": "Civil Engineering",
    "description": "Peraton drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the worlds leading mission capability integrator and transformative enterprise IT provider, we deliver trusted and highly differentiated national security solutions and technologies that keep people safe and secure. Peraton serves as a valued partner to essential government agencies across the intelligence, space, cyber, defense, civilian, health, and state and local markets. Every day, our 22,000 employees do the cant be done, solving the most daunting challenges facing our customers. This Field Engineer will support Configuration/ Change Management (CM) Governance processes; Strategic Requirements Planning; Integrated Master Schedule reconciliation; and Power, Space & Cooling (PSC) triage processes. Work with regional sites and deployment organizations to establish, oversee and enforce regional standard CM practices and processes; Assist with deployment integration planning, and support management of deployments, system configurations, and associated equipment and maintain control of site CM documentation to include floor plans, facility infrastructure baselines and operational baselines.  The contractor will plan agendas, aid in discussions, prepare minutes, etc. for Fora, Integrated Product Teams (IPTs) and Working Groups; collaborate across regional organizations to share tools, promote continuous process improvement, provide feedback and conduct lessons learned activities to standardize Systems Engineering across the extended enterprise, developing systems engineering and integration technical artifacts.  Assist in developing new or innovative approach to technical or engineering issue; Assist in conducting evaluations to determine suitability for project implementation; Analyze and propose appropriate engineering standards and processes for projects.  Supervise or coordinate the work of other contractor engineers or technicians on projects.  Work independently with little direction on SE Tasks and assignments as directed by the customer.  Capabilities Baseline by site/system & master schedule management; Communication with local organizations/ regional components/ stakeholders for SE Support and Situational Awareness.  Monitor, development, and maintenance of System Outage reference framework artifacts supporting system outage/ impact/ dependencies. (e.g. outage=Impact to x,y,z capabilities)  Facilitation of Change/ Configuration Boards, including analysis of interdependencies between systems deployed in the region, and proposed changes.  Monitoring and/or maintenance / integrity of databases: (e.g. AMHS, ROCBLASTER, TIKITRAVERSE, CMDB and other report and data base repositories).  Develop, refine, or implement management of processes and workflows for requirements/ configuration/ change management Individual Capabilities/Experience Required:  Bachelors degree or advanced degree in computer science, information systems, engineering, or other related discipline plus at least 10 years of systems engineering experience. A Masters degree or PhD may be substituted for two years of experience. A high school diploma or GED plus 14 years of systems engineering experience would also be acceptable.  Able to work independently with little direction from management/customer.  Position requires TS/SCI clearance with polygraph Five (5) or more years experience supporting programs and projects within this customer space.  Familiarity with database repositories such as AMHS, ROCBLASTER, TIKITRAVERSE, CMDB",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-02T05:47:31.000Z"
  },
  "company": {
    "name": "Peraton",
    "link": "https://www.linkedin.com/company/peraton"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 168,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Royal Kunia",
    "region": "HI",
    "postal_code": "96861",
    "street_address": null,
    "latitude": 21.398264,
    "longitude": -158.03445
  }
}