{
  "job": {
    "title": "Data &amp; Applied Scientist",
    "industry": "Computer Hardware,Computer Software,Information Technology and Services",
    "description": "In Microsoft Healthand Life sciences (HLS), our goal is to accelerate innovation by bringing AI and cloud-based services to life, to improve health outcomes and lower costs. Ourteam drives the cross-company strategy for healthcare and life sciences and applies Microsoft's extensive technical assets to improve healthcare and health equity, globally.  Our Health AI team at HLS maintain close collaboration with Microsoft Research and develop novel machine learning methods and systems to solve real-world healthcare challenges. We nurture opportunities and technologies that will shape and define our industry over the next several years.  We excitedly welcome individuals interested in applying advanced machine learning skills to solve hard yet meaningful healthcare challenges in a startup-like environment.  #healthcare #healthai #microsoft #ai #msfthealthcare #research #healthnext As a key member of our multi-disciplinary team, you will: REQUIRED QUALIFICATIONS: Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.  Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-20T04:50:32.000Z"
  },
  "company": {
    "name": "Microsoft",
    "link": "https://www.linkedin.com/company/microsoft"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Redmond",
    "region": "WA",
    "postal_code": "98073",
    "street_address": null,
    "latitude": 47.67491,
    "longitude": -122.12399
  }
}