{
  "job": {
    "title": "Business Solution Lead",
    "industry": "Information Technology and Services,Insurance,Financial Services",
    "description": "As a member of the Global Center of Competence (CoC), the Business Solution Lead partners with business/functional leaders and working groups to provide strategic leadership and identify pragmatic and innovative automation and digitization solutions. He/She will leverage their process-driven, analytical and technical skills to create and maintain automation solutions. Their role includes coaching business and functional unit leaders across the organization to drive and lead process augmentation and automation initiatives across the enterprise. Engage in Business Solutioning and Stakeholder Management Support Process Automation Implementation and Production Engage in enhancing Digital / Process Automation framework and monitor adoption across the enterprise At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin, ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law. Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliation against any individual who reports discrimination or harassment. Jersey City USA-New York-New York Operations & Customer Service No Aug 23, 2021, 3:44:04 PM",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T01:16:32.000Z"
  },
  "company": {
    "name": "Chubb",
    "link": "https://ch.linkedin.com/company/chubb"
  },
  "education": {
    "required_credential": ""
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Utica-Rome Area",
    "region": null,
    "postal_code": "13501",
    "street_address": null,
    "latitude": 43.09009,
    "longitude": -75.2616
  }
}