{
  "job": {
    "title": "Data Scientist",
    "industry": "Biotechnology",
    "description": "This Jobot Job is hosted by Kat Sarinas  Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.  Salary $120,000 - $180,000 per year We are revolutionizing biotech with our product that measures the eye's reflex. We are an exciting biotech start up that is looking to revolutionize the industry. Identify data sources, how to collect and prioritize.  Process/Clean data.  Integrate and store data.  Look for correlation/trends/relation between data sets that allows for improved diagnosis, to measure treatment success, to refine therapies, etc.  Use of machine learning, statistical modeling, and artificial intelligence.  Measure and improve.  Communicate actionable insights.  Utilizes statistical software programs (e.g., SAS, R) to implement advanced statistical methodologies (e.g., longitudinal data analysis, survival analysis, Poisson regression, imputation methodologies and analyses with missing data) and verify underlying distributional assumptions Prior experience in biological sciences, pharmaceuticals, medical devices in entrepreneurial environment.  A minimum of eight (8) years of experience conducting statistical analysis for clinical research projects. Master's or higher level degree in biostatistics, statistics, or a related field is required.  Excellent verbal and written communication and interpersonal skills.  Must be a self-starter, able to work independently and have the ability to coordinate multiple activities simultaneously in support of various projects  Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T21:07:54.000Z"
  },
  "company": {
    "name": "Jobot",
    "link": "https://www.linkedin.com/company/jobot"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Charleston",
    "region": "SC",
    "postal_code": "29492",
    "street_address": null,
    "latitude": 32.783062,
    "longitude": -79.93444
  }
}