{
  "job": {
    "title": "Senior Frontend Software Engineer",
    "industry": "Computer Software",
    "description": "There is only one Data Cloud. Snowflake’s founders started from scratch and designed a data platform built for the cloud that is effective, affordable, and accessible to all data users. But it didn’t stop there. They engineered Snowflake to power the Data Cloud, where thousands of organizations unlock the value of their data with near-unlimited scale, concurrency, and performance. This is our vision: a world with endless insights to tackle the challenges and opportunities of today and reveal the possibilities of tomorrow.  How do you make the world's most powerful Cloud Data Platform a delight to use? We are the fastest growing software company at this scale in history and looking to push that to new heights by building the single best visual user experience in the industry.  The Snowflake Data Cloud is the first to realize the full potential of the massive New Data Economy. We were the first to introduce truly frictionless data sharing, have a rapidly growing data marketplace and monetization platform, and are powering the most complete Analytics platform with a seamless and intuitive visual experience, powerful data visualizations, and world class management interface.  We are looking for talented frontend engineers to help us continue to grow and build compelling new experiences using a best-of-breed tech stack (React/Hooks, Typescript, Node.JS, Kubernetes, Go). Bring your passion for delighting customers and deep experience building cutting edge web apps and help us build the future of the Data Cloud. Building cutting edge cloud technologies is complex, and our engineering team surmounts the obstacles. Snowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.  How do you want to make your impact?",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T01:10:52.000Z"
  },
  "company": {
    "name": "Snowflake",
    "link": "https://www.linkedin.com/company/snowflake-computing"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Mateo",
    "region": "CA",
    "postal_code": "94406",
    "street_address": null,
    "latitude": 37.54715,
    "longitude": -122.3144
  }
}