{
  "job": {
    "title": "Data Analyst / Junior Data Scientist",
    "industry": "Nonprofit Organization Management,Research,Management Consulting",
    "description": "For 20 years, Insight has provided high-quality, nationally recognized research and evaluation services to government, philanthropic, and nonprofit clients. Our focus is on issues affecting at-risk and vulnerable populations. Key practice areas include education, family support, food and nutrition, health, and military and veteran support, Insight's innovative Data and Improvement group helps integrate research with data science and process improvement methods.  Headquartered in Arlington, Virginia, we offer outstanding potential for growth, competitive salaries, and comprehensive benefits in a collegial, family-friendly environment. For more information on the type of work we conduct and our corporate culture, please visit our website: .  Position Summary  This position includes working with other team members to plan and conduct a broad range of data analysis tasks using survey and administrative data to support food and nutrition assistance, health, and education projects. Candidates must have expertise in quantitative data cleaning, data mining, and data analysis. The ideal candidate will have demonstrated skills in one or more statistical programming languages (e.g., R, Python, SAS) and excellent oral and written communication skills. Education At Insight, we value a diverse workplace and strongly encourage women, people of color, people with disabilities, members of ethnic minorities, LGBTQ2S people, and veterans to apply. Insight is a committed equal opportunity employer. Each and every employment decision is based on business needs, job requirements, and individual qualifications without regard to race; color; sex; sexual orientation; gender identity or expression; age; religion; national origin; marital status; pregnancy or parental status; military or veteran status; medical condition; disability; or any federal, state, or local protected class. We do not and will not tolerate discrimination or harassment based on any of these characteristics.  Powered by JazzHR  0eMhLY2GIR",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:04:08.000Z"
  },
  "company": {
    "name": "Insight Policy Research",
    "link": "https://www.linkedin.com/company/insight-policy-research"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 46600,
    "max_value": 75200,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Arlington",
    "region": "VA",
    "postal_code": "22210",
    "street_address": null,
    "latitude": 38.890762,
    "longitude": -77.084755
  }
}