{
  "job": {
    "title": "Director of Analytics for Student Success &amp; Equity (MPP II)",
    "industry": "Higher Education,Government Administration,Financial Services",
    "description": "Director of Analytics for Student Success & Equity (MPP II) Regular Full-Time 63121  Director of Analytics for Student Success and Equity  Type of Appointment: Full-time, Management Personnel Plan II (MPP II)  Salary Range: Commensurate with Qualifications and Experience  Recruitment Closing Date: Open Until Filled  First Review: June 18, 2021 The office of Institutional Research, Planning, and Analytics (IRPA) supports data-informed decision making to help Cal Poly Pomona fulfill its commitment to student access and achievement. We support continuous improvement by seeking innovative ways to make data accessible, intelligible, and actionable.  The Division for Information Technology and Institutional Planning (IT&IP) provides innovative, strategic and cost-appropriate technology services in collaboration with the campus community to advance the mission of the University. Information and Digital technology services are recognized as an essential resource in furthering the University's mission. The IT&IP Division will provide technology solutions, expert consultation, and leadership resulting in numerous enhancements to the advancement of learning and knowledge and to the effectiveness of campus support services and business processes for the entire University. Assessment, Evaluation & Analytics Communication & Reporting Managing & Supervision Campus Partnerships planning/research/information management or analytics and reporting. APPOINTMENT AND SALARY  Salary is competitive and includes a comprehensive benefits package. Salary is competitive and commensurate with qualifications and experience. This is a Management Personnel Plan Level II position with an attractive benefits package, which includes a vacation accrual rate of 16 hours per month, an excellent choice of medical, dental, and vision insurance, long term disability coverage, life insurance and retirement benefits. Review of complete applications will begin June 18, 2022 and will continue until the position is filled. For application information and materials, visit our website at www.cpp.edu/hr and refer to Job number (63121). All candidates must submit: (1) a formal University application (2) a letter of interest which explains in detail and, where possible, provides examples of how the candidate meets the qualifications specified in this announcement; (3) a current résumé or curriculum vitae; and (4) the names, titles, addresses and telephone numbers of three references who can provide assessments of the applicant's professional experience, accomplishments and prospect for success in this position.  BACKGROUND CHECK  A background check must satisfactorily be completed before a candidate can be offered this position. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who apply for this position. The background check consists of the following: Employment verification, education verification, reference checks, and checks of the following systems and databases: National Social Security Number/Address Locator, Felony/Misdemeanor, National Criminal Database, Federal Criminal, Department of Motor Vehicles, and National Sex Offender Registry. Cal Poly Pomona hires only individuals lawfully authorized to work in the United States. In compliance with state and federal crime awareness and campus security legislation, including The Jeanne Clery Disclosure of Campus Security Policy and Crime Statistics Act, California Education Code section 67380, and the Higher Education Opportunity Act (HEOA), the Cal Poly Pomona Annual Security and Fire Safety Report is available at: https://www.cpp.edu/campus-safety-plan.shtml  Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html  CONDITION OF EMPLOYMENT  The person holding this position is considered a 'limited reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment. http://www.calstate.edu/eo/EO-1083.html  AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER  Cal Poly Pomona is an Equal Opportunity, Affirmative Action Employer. The university subscribes to all state and federal regulations and prohibits discrimination based on race, color, religion, national origin, sex, gender identity/gender expression, sexual orientation, marital status, pregnancy, age, disability, genetic information, medical condition, and covered veteran status.",
    "employment_type": "PART_TIME",
    "date_posted": "2021-07-21T02:00:27.000Z"
  },
  "company": {
    "name": "California State Polytechnic University-Pomona",
    "link": "https://www.linkedin.com/company/cal-poly-pomona"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Pomona",
    "region": "CA",
    "postal_code": "91799",
    "street_address": null,
    "latitude": 34.05512,
    "longitude": -117.750046
  }
}