{
  "job": {
    "title": "Data Scientist",
    "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
    "description": "As a Data Scientist at the BudLab, based in Cambridge, MA, you will be responsible to execute research and development (R&D) projects in analytics. In this position, you are expected to act as the interface between our academic partners and business stakeholders, maximizing value generation from these engagements.  This position requires the use of complex theoretical and practical knowledge to solve business problems from an analytical perspective. While managing projects, it will also be required that you develop the solution along with the parties involved, performing tasks related to data engineering, data exploration, or modeling whenever necessary.  Responsibilities and Duties Anheuser-Busch InBev is a publicly traded company (Euronext: ABI) based in Leuven, Belgium, with secondary listings on the Mexico (MEXBOL: ANB) and South Africa (JSE: ANH) stock exchanges and with American Depositary Receipts on the New York Stock Exchange (NYSE: BUD). Our Dream is to bring people together for a better world.  Beer, the original social network, has been bringing people together for thousands of years. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest natural ingredients. Our diverse portfolio of well over 400 beer brands includes global brands Budweiser®, Corona® and Stella Artois®; multi-country brands Beck’s®, Castle®, Castle Lite®, Hoegaarden®, and Leffe®; and local champions such as Aguila®, Antarctica®, Bud Light®, Brahma®, Cass®, Chernigivske®, Cristal®, Harbin®, Jupiler®, Klinskoye®, Michelob Ultra®, Modelo Especial®, Quilmes®, Victoria®, Sedrin®, Sibirskaya Korona®, and Skol®. Our brewing heritage dates back more than 600 years, spanning continents and generations. From our European roots at the Den Hoorn brewery in Leuven, Belgium. To the pioneering spirit of the Anheuser & Co brewery in St. Louis, US. To the creation of the Castle Brewery in South Africa during the Johannesburg gold rush. To Bohemia, the first brewery in Brazil. Geographically diversified with a balanced exposure to developed and developing markets, we leverage the collective strengths of approximately 200,000 employees based in more than 50 countries worldwide. In 2015, on a combined pro forma basis, AB InBev realized 55.5 billion US dollar in revenues (excluding JVs and associates).  Visit us @ www.ab-inbev.com  Like us @ www.facebook.com/abinbev  Follow us @ www.twitter.com/abinbevnews",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-20T00:00:00.000Z"
  },
  "company": {
    "name": "Anheuser-Busch InBev",
    "link": "https://be.linkedin.com/company/ab-inbev"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cambridge",
    "region": "MA",
    "postal_code": "02239",
    "street_address": null,
    "latitude": 42.36525,
    "longitude": -71.10502
  }
}