{
  "job": {
    "title": "Senior Software Engineer - Apple Online Store",
    "industry": "Consumer Electronics",
    "description": "Apple Online Store is looking for a highly motivated senior software engineer to join the Apple Online Store Engineering team. You will deliver projects aimed at improving the hugely successful Apple Online Store’s e-commerce experience and features - www.apple.com/shop The ideal candidate for this role will demonstrate the following characteristics and experience:  5 - 10 years Software Engineer/Developer experience  Programming in Java or other OOO Programming languages with deep understanding of OOO concepts and experience in Spring or other DI frameworks  Develop high-volume performing, multi-threaded, highly scalable, reliable and distributed web services and applications  Demonstrated expertise in Industry standard encryption methods, systems security and compliance  Demonstrated expertise in distributed message based architecture and noSQL data design  Knowledge and experience with service-oriented architecture, micro-services and API design  Expert knowledge of computer science, with understanding of data structures, algorithms, and software design  Demonstrated ability to achieve stretch goals in a highly innovative and fast paced environment  Strong leadership abilities in driving operational excellence and best engineering practices   We're looking for a hardworking and passionate person to join this amazing team, if you feel this is you, we'd love to hear from you. We are looking for a self starting, upbeat individual with excellent written and interpersonal skills, who is a phenomenal teammate, but not afraid to question assumptions and take initiative.   As part of the AOS Payments and Order Engineering team, your responsibilities include building high throughput, high performance, highly scalable and reliable web services and applications that powers the Apple Online Store, in SOA design working closely with other applications engineering team and interacting with product, design, content, QA and many other groups to lead and deliver world class e-commerce experience in an exciting fast-paced environment. Bachelor’s/Master’s degree in Computer Science or Electrical/Electronics Engineering    Role Number: 200250913",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T07:42:54.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 159000,
    "max_value": 202000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}