{
  "job": {
    "title": "Senior Machine Learning Engineer, Search Science (Video) - AI+ML Search",
    "industry": "Consumer Electronics",
    "description": "The Apple Media Products (AMP) Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power Search for the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here. Deep understanding of the search and information retrieval fundamentals including indexing, query understanding, retrieval and ranking   Strong Industrial experience with one or more of the following: search, classification, regression, recommendation systems, targeting systems, ranking systems, fraud detection, online advertising, or related   10+ years of relevant industry experience   Experience with Learning to Rank algorithms   Experience building big data pipelines with Hadoop, Java, Scala, and Spark   Familiarity with A/B experimentation and data/metric-driven product development   Passion. Our customers love what we do at Apple and we want the same from our engineers We’re a diverse collective of thinkers and doers, continually reimagining what’s possible to help us all find what we love in new ways. Our engineers have created some tough acts to follow, and they continue to lead us to innovative breakthroughs. Because they’re driven not by what would be easy, but by what would be amazing. The AMP Search team powers search for iTunes, App Store, Apple Music, Apple TV, Podcasts, Books and more on iOS, macOS, tvOS, watchOS, web browsers, 3rd party devices, and Windows. We are looking for extraordinary researchers to help build next-generation search features for Apple's ground breaking devices and platforms. We are a key part of the Apple ecosystem.   You will be part of a team with strong expertise in software engineering, information retrieval, language processing, data mining, machine learning, scalable systems, and offline parallel processing (Hadoop, Scala, Spark). We collaborate with other world-class engineers, researchers, and statisticians to ensure that features and models are functioning at or above expected performance levels. We think through complex research problems, simplify where necessary, invent when needed, to drive a principled vision from thought to reality. You will have the opportunity to present key technical and novel research work in public forums and will have a major impact on the way people search & discover on Apple devices worldwide! You will be responsible for improving search recall and ranking and use big data technology to evaluate and prioritize content discovery features, and you will ensure successful deployment of features, code, data, and models to production. Our team supports search on all devices (macOS, iOS, tvOS, watchOS, Siri/HomePod, and more) globally in languages from Arabic to Russian and everything in between! -  MS in Computer Science or related discipline or PhD   Apple is an equal opportunity employer that is committed to inclusion and diversity. Visit jobs.apple.com to learn more. If you do not consent to Apple storing your information in our system for Recruiting purposes, please reply to this email requesting deletion. For more information on Apple’s privacy policy please visit https://www.apple.com/legal/privacy/.    Role Number: 200268553",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-09-12T03:15:54.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 116000,
    "max_value": 155000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Seattle",
    "region": "WA",
    "postal_code": "98133",
    "street_address": null,
    "latitude": 47.60323,
    "longitude": -122.33028
  }
}