{
  "job": {
    "title": "Software Engineer (Early Career)",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your career and there's no telling what you could accomplish!   The Information Systems & Technology organization (IS&T) produces key business and technical infrastructure at Apple handling orders from the online store, building applications that improve the retail store experience, providing network bandwidth for our services around the world, processing every transaction in iTunes, and closing the books. We do it all. If you are a born problem solver who enjoys collaborating on the next big thing, we may just have your dream job!   From Apple ID to the Apple website to our data centers around the globe, IS&T manages the massive systems and services that so many rely on. They also build the custom tools that empower our employees to solve problems on their own. And that means these engineers are free to do what engineers do best - explore all of technology’s Excellent programming knowledge in at least one of the following areas: Server side development (Java), Web development (JavaScript, HTML, CSS3) or iOS development (Objective- C, Swift)    Excellent quantitative and interpersonal skills   Leadership experience   Related internship or job experience   Less than 12 months of full-time work experience in the role you are applying for The IS&T Early Career Development Program (ECDP) is for talents with less than 12 months of relevant experience in their position and provides employees with the opportunity to build community amongst themselves by attending educational and social events.  AVAILABLE POSITIONS  Within IS&T, there are a variety of software engineering positions available across many different teams, ranging from special projects for new business initiatives to operations in a rapidly growing and dynamic setting.   EXAMPLES OF POSITIONS:  -  Software Engineer: iOS, front-end, back-end, full-stack   -  Engineering Project Manager   -  DevOps Engineer   -  Machine Learning Engineer   -  Quality Engineer   -  Database Engineer   -  Teams that are hiring include:   -  Online Store Engineering   -  Worldwide Developer Relations   -  Enterprise and Retail Networking   -  Retail Engineering   -  Collaboration and Productivity   -  Global Business Intelligence   -  SAP Global Systems Bachelors degree in CS, CE, ECE, EECS, IS, IT and other related fields of study    Role Number: 200277602",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-10-15T17:06:06.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 12,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 118000,
    "max_value": 200000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Cupertino",
    "region": "CA",
    "postal_code": "95014",
    "street_address": null,
    "latitude": 37.319313,
    "longitude": -122.02927
  }
}