{
  "job": {
    "title": "Apple Pay - Software Engineer (Payments)",
    "industry": "Consumer Electronics",
    "description": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. You bring passion, and dedication to your job and there's no telling what you could accomplish.      We are building the next generation systems powering Apple Pay. Working alongside a hardworking team of engineers our initiative to build the strategic elements of the Apple Pay stack, enabling first to market features that differentiate our products. 5+ years of professional experience as a software engineer.  Proven knowledge of Algorithms & Data Structures.  Hardworking problem solver, building the best solutions for the most meaningful problems.  Ability to communicate thoughtfully, demonstrating problem-solving skills and a learning attitude to build long-term relationships.  Working knowledge of governance/security concepts and technologies including (encryption, anonymization, PCI, PII, ISO-8583, etc.).  Hands-on software development experience with Java, C/C++, Go or similar language.  Experience developing distributed systems. We are looking for a team member with a strong foundation in computer science theory and industry experience. In this role, you will design, develop, and deliver components of a distributed system that is key to the Apple Pay stack.     You will have a proven ability to seek problems, interest in continuous learning and digging deep into the domain when necessary.      Job functions include:    - Multi-functional collaboration throughout the entire software lifecycle.   - Prioritization, design, and implementation of scalable, resilient distributed systems.   - Participating in design sessions and code reviews with peers to elevate the quality of engineering across the organization. BSc or MS in Computer Science or related technical field, equivalent work experience will be considered. This role may require occasional international travel/transatlantic travel.    Role Number: 200215776",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-31T09:12:55.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}