{
  "job": {
    "title": "Software Engineer.",
    "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
    "description": "Ethicon, part of Johnson & Johnson Medical Devices Companies, is recruiting for a Software Engineer in Santa Clara, CA!  Johnson & Johnson Medical Devices is focused on shaping the future of digital surgery and expanding its robotics and digital solutions offerings across the entire portfolio, with multi-specialty, end-to-end solutions in orthopedics, endoluminal intervention and general surgery. This includes the MONARCH® platform, a first-of-its-kind robotic technology indicated for bronchoscopic visualization of and access to patient airways for diagnostic and therapeutic procedures in the lung.  Ethicon, part of Johnson & Johnson Medical Devices Companies, has made significant contributions to surgery for more than 100 years from creating the first sutures, to revolutionizing surgery with minimally invasive procedures. Our continuing dedication to Shape the Future of Surgery is built on our commitment to help address the world's most pressing health care issues and improve and save more lives. Through Ethicon's surgical technologies and solutions including sutures, staplers, energy devices, trocars and hemostats and our commitment to treat serious medical conditions like obesity worldwide, we deliver innovation to make a life-changing impact. For more information, visit www.ethicon.com.  As a Software Engineer you will be working on the Software Applications Backend team, helping to develop the infrastructure software that controls a real-time robotics system. These are the applications that empower the clinical staff to safely and effectively interact with the medical robotic system. You will be interacting closely with Clinical and System Engineering to test and develop clinical and user requirements. We are looking for a highly motivated candidate who is interested in revolutionizing the world of medical robotics.  We are looking for a Software Engineer with a focus in C++ and Linux to join our team to work on our distributed system. The Applications Backend team manages the System Logic, Audio, Video, LED Lights, User Management and Notification Frameworks.  Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. #gia United States-California-Santa Clara- Auris Health, Inc. (6267) R&D 2105945493W",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-21T17:30:36.000Z"
  },
  "company": {
    "name": "Johnson &amp; Johnson",
    "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 24,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Santa Clara",
    "region": "CA",
    "postal_code": "95050",
    "street_address": null,
    "latitude": 37.352394,
    "longitude": -121.95308
  }
}