{
  "job": {
    "title": "Senior Site Reliability Engineer",
    "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
    "description": "Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.  We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! Adobe Stock team is looking for an exceptional Site Reliability Engineer (SRE) to support the innovation we are bringing to the market through microservice and continuous integration/continuous deployment processes. We provide designers and businesses access to hundreds of millions high-quality, curated, royalty-free photos, videos, vectors, illustrations, templates, and 3D assets, for all their creative project needs. Adobe Stock is both a highly interactive web site and as well as integrated right into Adobe’s desktop and mobile apps providing search, browse, and purchase integration. We are a team with the excitement and energy of a startup, but the resources of a large software company committed to providing outstanding value to its customers!",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-06T14:21:29.000Z"
  },
  "company": {
    "name": "Adobe",
    "link": "https://www.linkedin.com/company/adobe"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "San Francisco",
    "region": "CA",
    "postal_code": "94121",
    "street_address": null,
    "latitude": 37.78008,
    "longitude": -122.42016
  }
}