{
  "job": {
    "title": "Drainage Engineer Supervisor - Transportation Infrastructure",
    "industry": "Construction,Civil Engineering,Transportation/Trucking/Railroad",
    "description": "ATS Job ID- R119734, Job Location- US-IN-Indianapolis Not Applicable/None Our Parsons Indianapolis office has is seeking to hire a highly experienced for our . This role will support transportation projects work in these states and Tennessee. Working with Parsons means being with a global team that has worked on award-winning programs and embraces new technologies to keep us at the forefront of the transportation market.  In this role, you will lead a team of professionals overseeing drainage and hydrology components of multiple transportation projects in Indiana and the Midwest Region. We are respected by our clients as an organization with strong technical skills, solid project delivery, and excellent performance and are seeking an individual that embraces technology and creative solutions to enhance our performance. We have a great history of Our experience includes delivering multi-million dollar Design/Build projects and a stable Design/Bid/Build project backlog. Bachelor's degree in Civil or Structural Engineering (or a related field) is required 12+ years or more of related work experience in Drainage/Hydrology design, including project management or supervisory/managerial experience of engineers, and designers  Proficiency utilizing Microstation or AutoDesk CAD platforms Experience with drainage software including HY8, HEC-RAS, Bentley StormCAD, PondPack and CivilStorm, FHWA Hydraulic Toolbox, NRCS WinTR20 Professional Engineer (PE) registration is required Experience directing work involving complex technical situations. Excellent written and oral communications skills",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-07-15T18:33:02.000Z"
  },
  "company": {
    "name": "Parsons Corporation",
    "link": "https://www.linkedin.com/company/parsons"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 144,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Indianapolis",
    "region": "IN",
    "postal_code": "46203",
    "street_address": null,
    "latitude": 39.76845,
    "longitude": -86.15621
  }
}