{
  "job": {
    "title": "Data Scientist",
    "industry": "Computer Software,Information Technology and Services,Internet",
    "description": "Are you seeking an environment where you can drive innovation? The Consumer Finance Science and Analytics (CFSA) team's mission is to inject advanced quantitative techniques into traditional financial analytics. We are data leaders, who identify and deliver actionable financial analyses and recommendations.  As we expand our transportation footprint, Amazon faces important questions, including how can we identify and influence controllable factors to reduce transportation costs while driving the Amazon flywheel? CFSA is partnering with the Supply Chain Optimization Technologies (SCOT) finance team, who is dedicated to answering these questions using statistical and machine learning methods.  Amazon is looking for the next outstanding Data Scientist to help build a brand new product that analyzes transportation costs, led by SCOT. They will partner with a team of finance specialists, economists and business intelligence engineers to build models that explain Amazon’s transportation costs and decompose them into controllable and non-controllable levers. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. - Amazon.com Services LLC  Job ID: A1666669",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T09:26:14.000Z"
  },
  "company": {
    "name": "Amazon",
    "link": "https://www.linkedin.com/company/amazon"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 83100,
    "max_value": 124000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Santa Monica",
    "region": "CA",
    "postal_code": "90403",
    "street_address": null,
    "latitude": 34.010933,
    "longitude": -118.491516
  }
}