{
  "job": {
    "title": "ELS - AMZ - Reliability Engineer",
    "industry": "Electrical/Electronic Manufacturing,Construction,Automotive",
    "description": "is a major single source maintenance solution in the industry with the bandwidth to service all of your equipment maintenance needs. We maintain all original equipment manufacturers for material handling equipment, BHS, PBB, Facilities, GSE and vehicles. Our hybrid programs efficiently cross utilize technicians between equipment types to provide seamless coverage that protects the best interest of our customers. Whether this is getting full warranty value for new parts and systems or applying experienced and specialized technical support for mature equipment needs, ELS has you covered. Join a rapidly growing team at ELS by helping us grow the client’s US portfolio. This ground floor expansion provides an opportunity for team members to apply building engineering skills in new ways. As part of a new line of business for the client, we are developing means and methods by which facilities, systems and assets are managed throughout their lifecycle. This explosive new business will create near term challenges and long term career choices. Stand  F (Frequently)  Walk  F (Frequently)  Sit  O (Occasionally)  Handling / Fingering  F (Frequently)  Reach Outward  F (Frequently))  Reach Above Shoulder  O (Occasionally)  Climb  F (Frequently)  Crawl  O (Occasionally)  Squat or Kneel  F (Frequently)  Bend  F (Frequently)  10 lbs or less  F (Frequently)  11-20 lbs  F (Frequently)  21-50 lbs  O (Occasionally)  51-100 lbs  O (Occasionally)  Over 100 lbs  N (Not Applicable) 12 lbs or less  O (Occasionally)  13-25 lbs  O (Occasionally)  26-40 lbs  O (Occasionally)  41-100 lbs  N (Not Applicable) Activity is not applicable to this occupation. Occupation requires this activity up to 33% of the time (0 - 2.5+ hrs/day) Occupation requires this activity from 33% - 66% of the time (2.5 - 5.5+ hrs/day) Occupation requires this activity more than 66% of the time (5.5+ hrs/day) Varies between an office environment as well as all areas located in a distribution center. May be around dust, dirt and noise levels above OSHA minimum requirements. Use of PPE required. Elite Line Services (ELS) is an Affirmative Action/Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to their race, color, gender identity, religion, ancestry, national origin, sex, sexual orientation, age, disability, marital status, veteran status or medical condition. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact elshr@elitelineservices.com.  This email address is reserved solely for job seekers with disabilities requesting accessibility assistance or an accommodation in the job application process. Please do not call about the status of your job application if you do not require accessibility assistance or an accommodation. Messages left for other purposes, such as following up on an application or non-disability related technical issues, will not receive a response.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-24T01:22:08.000Z"
  },
  "company": {
    "name": "ELS",
    "link": "https://www.linkedin.com/company/els"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 96,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "North Las Vegas",
    "region": "NV",
    "postal_code": "89030",
    "street_address": null,
    "latitude": 36.19585,
    "longitude": -115.11457
  }
}