{
  "job": {
    "title": "Data Scientist",
    "industry": "Pharmaceuticals",
    "description": "The Clinical, Medical and Regulatory (CMR) department at Novo Nordisk is one of the most diverse and collaborative groups within the organization. From health-care-provider interactions and developing and implementing regulatory strategies with the Food & Drug Administration (FDA) to providing medical education and collecting data to support efficacy and new product development, CMR is involved. The one thing that keeps us all marching to the same beat is our patient-centered focus. At Novo Nordisk, you will help patients around the world. As their needs evolve, so does our challenge to find better and more innovative ways to improve their quality of life. We’re changing lives for a living. Are you ready to make a difference? The Data Scientist identifies and delivers dynamic and reliable analytics products and services by leveraging internal and external data to enable faster decision making across Novo Nordisk; and contributes to the growth, competitiveness, and innovation of the company. This position reports the head of Scientific Analytics and functions as an analytics specialist in the Medical Information & Analytics department. Collaborates closely with teams in departments throughout the organization, including Medical Affairs, Health Economics & Outcomes Research (HEOR), Clinical Trial Management, Market Development & healthcare professional (HCP) Engagement, as well as with other data science units globally. May also mentor Analytics interns and oversee projects with external vendors. 0-10% overnight travel required. Novo Nordisk is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, gender identity, sexual orientation, national origin, disability, protected veteran status or any other characteristic protected by local, state or federal laws, rules or regulations.  If you are interested in applying to Novo Nordisk and need special assistance or an accommodation to apply, please call us at 1-855-411-5290. This contact is for accommodation requests only and cannot be used to inquire about the status of applications.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-05T03:06:04.000Z"
  },
  "company": {
    "name": "Novo Nordisk",
    "link": "https://dk.linkedin.com/company/novo-nordisk"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 72,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 103000,
    "max_value": 163000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Princeton",
    "region": "NJ",
    "postal_code": "08540",
    "street_address": null,
    "latitude": 40.35198,
    "longitude": -74.66074
  }
}