{
  "job": {
    "title": "Data Scientist.",
    "industry": "Information Technology and Services,Banking,Financial Services",
    "description": "We connect great people to great opportunities. Are you ready to take the next step? Discover a career in banking at Fifth Third Bank. The Data Scientist will perform data analysis, statistical analysis, and develop algorithms and methodologies on structured and unstructured data for on-demand and software-embedded use. Manage key analyses to drive more profitable business decisions. Focus on providing value-added analysis and recommendations to support business growth.  Responsible and accountable for risk by openly exchanging ideas and opinions, elevating concerns, and personally following policies and procedures as defined. Accountable for always doing the right thing for customers and colleagues, and ensures that actions and behaviors drive a positive customer experience. While operating within the Bank's risk appetite, achieves results by consistently identifying, assessing, managing, monitoring, and reporting risks of all types. Data Scientist.LOCATION -- Cincinnati, Ohio 45202  Fifth Third Bank, National Association is proud to have an engaged and inclusive culture and to promote and ensure equal employment opportunity in all employment decisions regardless of race, color, gender, national origin, religion, age, disability, sexual orientation, gender identity, military status, veteran status or any other legally protected status.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-18T12:40:18.000Z"
  },
  "company": {
    "name": "Fifth Third Bank",
    "link": "https://www.linkedin.com/company/fifth-third-bank"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 48,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Cincinnati",
    "region": "OH",
    "postal_code": "45241",
    "street_address": null,
    "latitude": 39.1037,
    "longitude": -84.51361
  }
}