{
  "job": {
    "title": "Full Stack Software Engineer (Infrastructure Services)",
    "industry": "Consumer Electronics",
    "description": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!   The Infrastructure Services Software Development team is looking for a passionate and self-motivated engineer to be part of a diverse, fast paced and high-energy team. You will design and implement tools, services and applications that enable Network and Data Center operation teams to work effortlessly. You will chip in to key and innovative technology which supports major Apple applications, with all the scalability and high-availability requirements that entails. Collaborating with other group’s to lead and deliver elite products in an exciting rapidly changing environment. 5+ years of full stack development experience.  Strong front-end technology stack including HTML, CSS, JavaScript and React UI Framework.  Good website design experience including developing wireframes and UX.  Quick prototyping and iterative skills with building REST services and UI-Frontends for proof of concepts.  Strong Java Programming skills.  Experience with Spring boot based micro-services.  Experience with NoSQL databases.  Experience writing effective unit tests and debugging skills.  Nice to have good troubleshooting production issues.  Building applications and products with scale and performance in mind.  Customer focused and agile.  We seek a self starter, visionary person with strong leadership capabilities. You will use your technical expertise to implement new features and improvements. You should be comfortable with rapidly-evolving designs and requirements, and have excellent communication skills. Success depends on influencing other teams that run Apple's infrastructure and datacenter operations. You will have a sense of customer-focused solutions that \"just work,\" and keep this in mind at every stage of development. You will articulate ideas clearly within our team and collaborate with other organizations at Apple. BS/MS in Computer Science or related field, or equivalent work experience.    Role Number: 200259183",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T07:40:45.000Z"
  },
  "company": {
    "name": "Apple",
    "link": "https://www.linkedin.com/company/apple"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Austin",
    "region": "TX",
    "postal_code": "78746",
    "street_address": null,
    "latitude": 30.264978,
    "longitude": -97.7466
  }
}