{
  "job": {
    "title": "Data Scientist, Growth Analytics",
    "industry": "Information Technology and Services,Computer Software,Internet",
    "description": "LIAISE WITH ATLASSIAN’S UNIQUE TEAM OF ANALYSTS, DATA SCIENTISTS, DEVELOPERS, DESIGNERS, AND PRODUCT MANAGERS TO RUN EXPERIMENTS AGAINST ATLASSIAN USERS. UTILIZE DATA ANALYTICS TO SUPPORT SOFTWARE DEVELOPMENT FOR ATLASSIAN’S SOFTWARE PRODUCTS. RESPONSIBLE FOR DESIGNING AND ANALYZING EXPERIMENTS THAT DRIVE KEY PRODUCT DECISIONS UTILIZING KNOWLEDGE OF SQL, PYTHON AND A/B TESTING. UTILIZE SQL EXPERTISE, CUSTOMER FOCUSED DATA ANALYTICS AND BEHAVIORAL PRODUCT ANALYTICS TO SUPPORT INSIGHT GENERATION, REPORTING AND ROADMAP DECISIONS TO SUPPORT PRODUCTS DECISIONS. RESPONSIBLE FOR MODELLING CUSTOMER BEHAVIOR USING DISPARATE DATASETS. WORK WITH ANALYTICS AND VISUALIZATION TOOLS SUCH AS TABLEAU, MODE, ETC. WORK WITH ENTERPRISE (OR B2B) AS WELL AS CONSUMER (OR B2C) ENVIRONMENTS. ASSIST IN DEFINING AND DEVELOPING DEEP INSIGHTS FOR ATLASSIAN’S PRODUCTS UTILIZING STATISTICAL TECHNIQUES SUCH AS LINEAR REGRESSION, LOGISTIC REGRESSION, CLUSTERING AND CAUSAL INFERENCE. PROVIDE QUANTITATIVE AND QUALITATIVE INSIGHTS FOR ATLASSIAN’S GROWTH TEAM TO SUPPORT OPPORTUNITIES THAT DRIVE REVENUE.  MINIMUM REQUIREMENTS: MASTER’S DEGREE IN STATISTICS, BIOSTATISTICS, COMPUTER SCIENCE, MATHEMATICS OR A CLOSELY RELATED ANALYTICAL FIELD OF STUDY PLUS TWO (2) YEARS OF EXPERIENCE IN PRODUCT ANALYSIS, KEY METRICS, CUSTOMER BEHAVIOR/DATA USING KNOWLEDGE OF SQL, PYTHON AND STATISTICS.  ALTERNATE REQUIREMENTS: BACHELOR’S DEGREE IN STATISTICS, BIOSTATISTICS, COMPUTER SCIENCE, MATHEMATICS OR A CLOSELY RELATED ANALYTICAL FIELD OF STUDY PLUS FIVE (5) YEARS OF EXPERIENCE IN PRODUCT ANALYSIS, KEY METRICS, CUSTOMER BEHAVIOR/DATA USING KNOWLEDGE OF SQL, PYTHON AND STATISTICS.  SPECIAL REQUIREMENTS: MUST PASS TECHNICAL INTERVIEW. Whether you work in an office or a distributed team, Atlassian is highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time off to relax and recharge, flexible working options, five paid volunteer days a year for your favourite cause, an annual allowance to support your learning & growth, unique ShipIt days, a company paid trip after five years and lots more. Creating software that empowers everyone from small startups to the who’s who of tech is why we’re here. We build tools like Jira, Confluence, Bitbucket, and Trello to help teams across the world become more nimble, creative, and aligned—collaboration is the heart of every product we dream of at Atlassian. From Amsterdam and Austin, to Sydney and San Francisco, we’re looking for people who want to write the future and who believe that we can accomplish so much more together than apart. At Atlassian, we’re committed to an environment where everyone has the autonomy and freedom to thrive, as well as the support of like-minded colleagues who are motivated by a common goal to: Unleash the potential of every team . We believe that the unique contributions of all Atlassians is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.  All your information will be kept confidential according to EEO guidelines.  If your experience looks a little different from what we’ve identified and you think you can rock the role, we’d love to learn more about you.  Learn more about Atlassian’s culture, interviewing flow, and hiring process by checking out our Candidate Resource Hub .",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-10T04:08:21.000Z"
  },
  "company": {
    "name": "Atlassian",
    "link": "https://au.linkedin.com/company/atlassian"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 60,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 102000,
    "max_value": 139000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Mountain View",
    "region": "CA",
    "postal_code": "94040",
    "street_address": null,
    "latitude": 37.39008,
    "longitude": -122.08139
  }
}