{
  "job": {
    "title": "Electrical Engineer (North Office) - Houston, TX",
    "industry": "Construction,Mechanical or Industrial Engineering,Oil &amp; Energy",
    "description": "Independently performs Electrical Engineering activities for all phases of electrical development and equipment design for a project of significant size and complexity (e.g., continuing services project involving multiple engineering disciplines). Must be fully competent in performing all conventional aspects of Electrical Engineering and application of independent judgment for the evaluation, selection and substantial adaptation and modification of standard design engineering criteria, methods and procedures. Periodic evaluation of work done by less experienced engineers is required. Assignments require knowledge and understanding of Project Management requirements including staffing and scheduling. Provides technical guidance and coordination of manpower for the Electrical Engineering staff assigned to one or more projects. Assists in the evaluation and review for hiring of personnel. Normally requires at least a 4-year degree in Electrical Engineering. Requires a minimum of 10 years experience in Electrical Engineering (or equivalent working knowledge/experience). Incumbent must be cognizant of the capabilities and limitations of various computer software packages and automated engineering and design equipment to effectively direct their use for diverse engineering assignments. Registration as a licensed professional engineer is required. Ability to read, analyze and interpret general business periodicals, professional journals, technical procedures or governmental regulations. Ability to write reports, business correspondence and procedure manuals. Ability to effectively present information and respond to questions from groups of clients, managers, designers and engineers. Ability to work with mathematical concepts such as probability and statistical inference, and fundamentals of plane and solid geometry and trigonometry. Ability to apply concepts such as fractions, percentages, ratios and proportions to practical situations. Occasionally may conduct or participate in a field trip to an operating plant or construction site. This requires normal hearing, the ability to stand, walk, reach, climb and balance, clear close and distance vision, depth perception and the ability to focus. Lifting up to 25 pounds may be required. Normal work environment will be a business office with moderate noise. Occasionally may visit or be temporarily assigned to work in an operating plant or at a construction site. This may require exposure to outdoor weather conditions, loud noise, work near moving mechanical parts, electrical energy, construction equipment, vibration, fumes, chemicals and airborne particles.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:37:57.000Z"
  },
  "company": {
    "name": "S &amp; B Engineers and Constructors, Ltd.",
    "link": "https://www.linkedin.com/company/s&amp;b-engineers-and-constructors"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": "USD",
    "min_value": 61800,
    "max_value": 103000,
    "unit": "YEAR"
  },
  "location": {
    "country": "US",
    "locality": "Houston",
    "region": "TX",
    "postal_code": "77208",
    "street_address": null,
    "latitude": 29.760803,
    "longitude": -95.36951
  }
}