{
  "job": {
    "title": "Data Scientist",
    "industry": "Financial Services",
    "description": "Data Scientist Office in Colorado, open to virtual employment 10 (internal purposes) The S&P Global Ratings Data Science team combines automation, machine learning, and data engineering to improve the delivery of Ratings data & content to our analysts and customers. The team sits within the organizations Operating Office and works in close partnership with all teams throughout the organization.  You will be a part of key transformation projects aiming to streamline and automate our data processes: sourcing, collection, tagging, linking, extraction, translation, and other manual processes.  In doing so, you will build relationships across the division to generate and unlock new and existing data for content delivery through technological advancements using intelligent automation, data science, and coding design principles.  Projects will span the entirety of the data and content value chain enhancing customer satisfaction, and driving business results and growth through the timely and accurate delivery of fundamentals, ratings and reference data. You will be a key member of the S&P Global Ratings Data Science team, playing a key role in developing intelligent automation solutions for our data and content generation processes. You will work with technology, business and operations teams in this role, driving and executing on automation improvement opportunities to expand our capabilities around making our data value chain processes more efficient. S&P Global states that the anticipated base salary range for this position is $68,300 to $141,800. Base salary ranges may vary by geographic location.  In addition to base compensation, this role is eligible for an annual incentive plan.  This role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit S&P Global Ratings is the world’s leading provider of independent credit ratings. Our ratings are essential to driving growth, providing transparency and helping educate market participants so they can make decisions with confidence. We have more than 1 million credit ratings outstanding on government, corporate, financial sector and structured finance entities and securities. We offer an independent view of the market built on a unique combination of broad perspective and local insight. We provide our opinions and research about relative credit risk; market participants gain independent information to help support the growth of transparent, liquid debt markets worldwide.  S&P Global Ratings is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.spglobal.com/ratings.  S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.  If you need an accommodation during the application process due to a disability, please send an email to: and your request will be forwarded to the appropriate person. The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.  #  IFTECH202.1 - Middle Professional Tier I (EEO Job Group) 263209 2021-07-22 Centennial, Colorado, United States",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-09T06:30:14.000Z"
  },
  "company": {
    "name": "S&amp;P Global Ratings",
    "link": "https://www.linkedin.com/company/spglobalratings"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 36,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Centennial",
    "region": "CO",
    "postal_code": "80018",
    "street_address": null,
    "latitude": 39.597305,
    "longitude": -104.85381
  }
}