{
  "job": {
    "title": "Associate Director, Quality Assurance - Remote",
    "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
    "description": "Regulatory Professionals, a division of Premier Research, is a consultancy firm specializing in drug, biologics and device regulatory affairs. Our purpose as a company is to support our clients by furthering the development of human therapeutics that will benefit the health and well-being of patients around the world. With a presence in the US, EU, Canada and Japan we are growing and looking for talented people to grow our business, advance the goals of our clients and contribute to our unique culture. Our focus is to provide strategic and tactical support in all aspects of regulatory affairs, including preclinical, CMC and clinical development for drugs, biologics, devices, and combination products.  We are seeking a talented to join our growing team at RPI! This position is available as a fully remote role.  The , in conjunction with the Director and the QA team, is responsible for assisting with developing, implementing, and supporting both regional and international quality strategies for assigned projects, while acting as the client representative on various cross-functional teams. This role supports and executes quality strategies that advance client goals for GXP compliance with applicable laws, regulations, SOPs, protocols and guidelines for all stages of product development. This position contributes to successful project delivery, while adhering to timelines and budgets, for clients and within RPI. The Associate Director provides advice and guidance for and actively contributes to the development, implementation and maintenance of quality management systems ensuring compliance with current health authority requirements, GXPs, and industry standards.",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-25T17:28:06.000Z"
  },
  "company": {
    "name": "Premier Research",
    "link": "https://www.linkedin.com/company/premier-research"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 84,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "United States",
    "region": null,
    "postal_code": "99999",
    "street_address": null,
    "latitude": 39.50355,
    "longitude": -99.0183
  }
}