{
  "job": {
    "title": "Enterprise Data, AI, and Machine Learning Architect",
    "industry": "Marketing and Advertising,Computer Software,Hospital &amp; Health Care",
    "description": "Our reliability is one of the best in the nation, and we're working to make it even better. We live here too. That's why we're committed to making Florida a better place. Join our team today Position Specific Description Position Specific Description At NextEra Energy, we are investing heavily in AI/ML efforts and enterprise data platform. We are looking for a senior program manager to lead several strategic AI/ML projects to optimize the business operation excellence in Power Delivery from Image Detection, Outage prediction, to Storm Damage Forecast and Resource Optimization. In this role, the candidate will lead a few agile teams and partner business product owners, data scientists and technical architects to offer the best solution delivery. The ideal candidate shall have seasonal Agile project/program management skill who enjoys innovative AI digital technology solution and business transformation. The candidate shall also be comfortable with big data strategy and cloud technologies. The candidate must be self-directed and comfortable supporting the AI & data needs of multiple teams, systems and products. SpecificJob Functions You will be adding value by hands on as well as supervise a team of data analyst and developers from Enterprise Data Architecture perspective to design and write scripts and processes that manage the data extraction, transformation, movement, loading, cleansing and updating of data.You will use your solutions-oriented approach and high work ethic, along with excellent communication and process management skills, to mentor internal customers and teammates on datalake technology and data modeling practices. Thorough understanding of AWS or Cloud based Data Lake, Data Pipeline Architecture & Ecosystem leveraging AWS technology. Keen to innovative digital solutions utilizing AI/ML technology Comfortable with analytics tools that utilize the data pipeline to provide actionable insights into areas related to customer service systems. Experience in installing, configuring, and maintaining enterprise data environment Experience in Geospatial, network topology data architecture and applications Experience with image detection, IoT, APM and various AI/ML technology platforms Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using NoSQL and SQL AWS 'big data' technologies (Dynamo, Kinesis, S3, HIVE/Spark). Experience with Batch data loading using Talend, Hive or Spark and Hive Experience with real-time data ingestion using Kafka, Spark and Hbase/Mongo DB Knowledge of Enterprise Software Platforms including Salesforce, SAP, Mulesoft middleware Serve as liaison between technical and non-technical departments. Communicate with other management, developers, product managers and technical support specialists on product issues. Excellent in business partnership and leadership skills 10+ years of experience in technology project/program management who attained a Graduate degree in Computer Science, Computer/Electrical Engineering, Statistics, Informatics, Information Systems or another quantitative field. Experience with big data or AI initiatives Understands big data and cloud tools: AWS S3, Dynamo, Athena, EC2, EMR, RDS, Redshift, Snowflake, Power BI etc Understands object-oriented/object function scripting languages: Python, Java, Scala, etc. AWS hands-on experience and AWS cloud architect or big data certification a plus Experience building and optimizing 'big data' data pipelines, architectures and data sets is a plus. Excellent communication skill Experience with utility power business is a plus Strong leadership skill with team management experience Strong team player with experience of leading or supervising technical resources This position establishes strategy, develops business plans, and oversees and leads in the design, development and implementation of technology solutions to meet business needs. Leaders in this role provide leadership and oversight to manage performance and results in one or more Information Technology (IT) disciplines. Individuals will be accountable for the reliability, performance, security, and continuity of IT systems and supported business processes. Provides leadership, influence, vision, and direction to the organization to contribute to achieving the company's goals Works with IT leaders to develop overall IT strategy in alignment with business strategy Oversees value stream by focusing on cost and risks of technology portfolio to meet business needs Supports and fosters innovative technologies to deliver new ideas that enable business transformation Ensures high levels of ongoing system and application performance in production environments Oversees development of processes and tools to automate code releases from development to operations (DevOps) Attracts, develops and retains a high-performing and diverse team Establishes and drives technology roadmaps that align with current and future business needs Manages third party technical and outsourcing relationships to deliver project and operational support objectives Ensures technology processes are conducted in line with applicable standards and company policies Performs other job-related duties as assigned High School Grad / GED Bachelor's or Equivalent Experience Experience: 7+ years Bachelor's Degree Supervisor/Management Experience: 2+ years Employee Group: Exempt Employee Type:Full Time Job Category: Information Technology Organization: Florida Power & Light Company Location: Jupiter, Florida Other Work Locations: Florida Relocation Provided: Yes, if applicable NextEra Energy is an Equal Opportunity Employer. Qualified applicants are considered for employment without regard to race, color, age, national origin, religion, marital status, sex, sexual orientation, gender identity, gender expression, genetics, disability, protected veteran status or any other basis prohibited by law. We are committed to a diverse and inclusive workplace. If you require special support or accommodation while seeking employment with NextEra Energy, please send an e-mail to , providing your name, telephone number and the best time for us to reach you. Alternatively, you may call 1-844-694-4748. Please do not use this line to inquire about your application status. NextEra Energy will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. NextEra Energy does not accept any unsolicited resumes or referrals from any third-party recruiting firms or agencies. Please see our for more information. PDN-9392f8b6-35bf-4086-a012-a427b9a8a3c4",
    "employment_type": "FULL_TIME",
    "date_posted": "2021-08-01T06:43:28.000Z"
  },
  "company": {
    "name": " Professional Diversity Network",
    "link": "https://www.linkedin.com/company/prodivnet"
  },
  "education": {
    "required_credential": "bachelor degree"
  },
  "experience": {
    "months_of_experience": 120,
    "seniority_level": " "
  },
  "salary": {
    "currency": " ",
    "min_value": 0,
    "max_value": 0,
    "unit": " "
  },
  "location": {
    "country": "US",
    "locality": "Jupiter",
    "region": "FL",
    "postal_code": "33458",
    "street_address": null,
    "latitude": 26.934145,
    "longitude": -80.09974
  }
}